{
  "backend/main.mo": "Motoko canister managing user profiles and publisher records with access control and CRUD operations.",
  "feature_evidence.json": "Feature evidence report listing required UI updates for scrollable dropdowns in several frontend modals.",
  "frontend-file-summaries.txt": "Text file containing predefined summaries for numerous frontend files and components.",
  "frontend/.env": "Environment file setting the Internet Identity provider URL.",
  "frontend/index.css": "Global Tailwind-based stylesheet defining OKLCH color variables and light/dark theme tokens.",
  "frontend/index.html": "Basic HTML entry point mounting the root React application.",
  "frontend/src/App.tsx": "Main routing setup using TanStack Router, handling authentication and route definitions for all pages.",
  "frontend/src/components/conductors/ConductorModal.tsx": "Modal for creating and editing trained conductors with form state, publisher selection, and submission logic.",
  "frontend/src/components/conductors/DeleteConductorDialog.tsx": "Confirmation dialog for deleting a conductor using mutation hooks with a loading state.",
  "frontend/src/components/layout/AppLayout.tsx": "Layout component combining sidebar, header, routed content outlet, and toast notifications.",
  "frontend/src/components/layout/Header.tsx": "Header component with menu toggle and logout that clears identity and query cache.",
  "frontend/src/components/layout/Sidebar.tsx": "Sidebar with navigation links, mobile toggle behavior, and footer info.",
  "frontend/src/components/notes/AddGlobalNoteModal.tsx": "Modal for creating or editing global notes with validation, publisher attachment, and toast feedback.",
  "frontend/src/components/notes/GlobalNoteCard.tsx": "Card displaying a global note with category badge, preview, date, and edit/delete actions.",
  "frontend/src/components/pioneers/AddPioneerModal.tsx": "Modal to add a pioneer by selecting a publisher and service year with validation and toast notifications.",
  "frontend/src/components/pioneers/DeletePioneerDialog.tsx": "Confirmation dialog for deleting a pioneer record with status-aware actions and toast feedback.",
  "frontend/src/components/pioneers/EditPioneerModal.tsx": "Modal to edit an existing pioneer, pre-filling fields and updating via mutation with validation.",
  "frontend/src/components/publicWitnessing/DeleteTrainedPublisherDialog.tsx": "Dialog confirming deletion of a trained publisher using a mutation with pending state handling.",
  "frontend/src/components/publicWitnessing/TrainedPublisherModal.tsx": "Modal for creating or editing a trained publisher, handling form state, validation, and mutation calls.",
  "frontend/src/components/publishers/AddPublisherModal.tsx": "Modal for adding a new publisher with form inputs, validation, and mutation submission.",
  "frontend/src/components/publishers/DeletePublisherNoteDialog.tsx": "Empty file with no implemented content.",
  "frontend/src/components/publishers/EditPublisherModal.tsx": "Modal for editing an existing publisher, preloading data, validating fields, and submitting updates.",
  "frontend/src/components/publishers/EditPublisherNoteModal.tsx": "Empty file with no implemented content.",
  "frontend/src/components/publishers/PublisherNoteCard.tsx": "Empty file with no implemented content.",
  "frontend/src/components/publishers/PublisherNotesSection.tsx": "Empty file with no implemented content.",
  "frontend/src/components/shepherding/EditShepherdingVisitModal.tsx": "Modal for editing a shepherding visit, loading visit data, validating fields, and updating the record.",
  "frontend/src/components/shepherding/RecordVisitModal.tsx": "Modal for recording a new shepherding visit, handling form input, validation, and creation mutation.",
  "frontend/src/components/tasks/AddTaskModal.tsx": "Modal form for creating tasks with validation, date conversion, and mutation submission.",
  "frontend/src/components/tasks/EditTaskModal.tsx": "Modal for editing existing tasks, preloading task data and submitting updates via mutation.",
  "frontend/src/components/territories/AddTerritoryModal.tsx": "Modal for adding a new territory with simple validation and create mutation.",
  "frontend/src/components/territories/CheckoutHistoryTable.tsx": "Table displaying sorted checkout history with optional edit actions.",
  "frontend/src/components/territories/CheckOutTerritoryModal.tsx": "Modal to check out a territory by selecting a publisher and optional campaign flag, submitting via mutation.",
  "frontend/src/components/territories/DeleteTerritoryNoteDialog.tsx": "Confirmation dialog to delete a territory note using a delete mutation.",
  "frontend/src/components/territories/EditCheckoutRecordModal.tsx": "Modal for editing a territory checkout record, supporting publisher selection, date handling, and update mutation submission.",
  "frontend/src/components/territories/EditTerritoryModal.tsx": "Modal to edit a territory’s number and type with validation and update mutation.",
  "frontend/src/components/territories/EditTerritoryNoteModal.tsx": "Modal for editing a territory note’s content and saving changes via mutation.",
  "frontend/src/components/territories/TerritoryNoteCard.tsx": "Displays a single territory note with content, date, and edit/delete actions.",
  "frontend/src/components/territories/TerritoryNotesSection.tsx": "Section to create, list, sort, edit, and delete notes for a territory using note-related hooks.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on user identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useAddPublisher.ts": "Mutation hook to add a publisher, mapping UI privileges to backend format and invalidating publisher queries.",
  "frontend/src/hooks/useCallerUserProfile.ts": "Hooks to fetch and save the caller’s user profile, tied to actor state and query invalidation.",
  "frontend/src/hooks/useCheckOutTerritory.ts": "Mutation hook to check out a territory and invalidate related territory queries on success.",
  "frontend/src/hooks/useCreateGlobalNote.ts": "Mutation hook to create a global note with basic validation and invalidation of global notes queries.",
  "frontend/src/hooks/useCreatePioneer.ts": "Creates a pioneer via mutation and invalidates the pioneers query.",
  "frontend/src/hooks/useCreateShepherdingVisit.ts": "Creates a shepherding visit and invalidates the shepherdingVisits query.",
  "frontend/src/hooks/useCreateTask.ts": "Creates a task from mapped params and refreshes all task queries.",
  "frontend/src/hooks/useCreateTerritory.ts": "Creates a territory with a generated ID and invalidates territory queries.",
  "frontend/src/hooks/useCreateTrainedConductor.ts": "Adds a trained conductor, invalidates its list, and shows toast notifications.",
  "frontend/src/hooks/useCreateTrainedPublisher.ts": "Adds a trained publisher with success/error toasts and cache invalidation.",
  "frontend/src/hooks/useDeleteGlobalNote.ts": "Deletes a global note and invalidates the globalNotes query.",
  "frontend/src/hooks/useDeletePioneer.ts": "Deletes a pioneer and invalidates the pioneers query.",
  "frontend/src/hooks/useDeletePublisher.ts": "Deletes a publisher with optimistic updates and query invalidation.",
  "frontend/src/hooks/useDeleteTask.ts": "Deletes a task and invalidates all task queries.",
  "frontend/src/hooks/useDeleteTrainedConductor.ts": "Deletes a trained conductor with toast notifications and cache invalidation.",
  "frontend/src/hooks/useDeleteTrainedPublisher.ts": "Deletes a trained publisher and triggers toasts and cache refresh.",
  "frontend/src/hooks/useGlobalNotes.ts": "Provides queries for all global notes or a single global note.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity auth state, login, logout, and context provider.",
  "frontend/src/hooks/usePioneers.ts": "Fetches all pioneers using React Query.",
  "frontend/src/hooks/usePublisherNotes.ts": "Empty file with no implementation.",
  "frontend/src/hooks/useQueries.ts": "Fetches all publishers or a single publisher by ID.",
  "frontend/src/hooks/useServiceMeetingConductors.ts": "Retrieves all service meeting conductor assignments.",
  "frontend/src/hooks/useShepherdingVisit.ts": "Fetches, updates (full or notes), and deletes shepherding visits with cache updates.",
  "frontend/src/hooks/useShepherdingVisits.ts": "Fetches all shepherding visits.",
  "frontend/src/hooks/useTasks.ts": "Fetches tasks by status or a single task by ID.",
  "frontend/src/hooks/useTerritories.ts": "Fetches all territories using React Query.",
  "frontend/src/hooks/useTerritory.ts": "Hooks for fetching and mutating territory data, with cache invalidation for single territories and the territory list.",
  "frontend/src/hooks/useTerritoryNotes.ts": "Hooks to fetch and manage notes for a specific territory, invalidating territoryNotes queries on changes.",
  "frontend/src/hooks/useTrainedConductors.ts": "Provides a query hook to load all trained conductors once the actor is ready.",
  "frontend/src/hooks/useTrainedPublishers.ts": "Provides a query hook to fetch all trained publishers when the actor is available.",
  "frontend/src/hooks/useUpdateCheckoutRecord.ts": "Mutation hook to update a territory checkout record and refresh related territory queries.",
  "frontend/src/hooks/useUpdateGlobalNote.ts": "Mutation hook to edit a global note and invalidate the globalNotes query.",
  "frontend/src/hooks/useUpdatePioneer.ts": "Mutation hook to update a pioneer and invalidate the pioneers list.",
  "frontend/src/hooks/useUpdatePublisher.ts": "Mutation hook to update publisher details, mapping privileges and invalidating the publishers query.",
  "frontend/src/hooks/useUpdateTask.ts": "Mutation hook for updating a task and invalidating all task queries.",
  "frontend/src/hooks/useUpdateTaskCompletion.ts": "Mutation hook to toggle a task’s completion status and refresh task queries.",
  "frontend/src/hooks/useUpdateTrainedConductor.ts": "Mutation hook to update a trained conductor with toast feedback and query invalidation.",
  "frontend/src/hooks/useUpdateTrainedPublisher.ts": "Mutation hook to update a trained publisher with toast feedback and query invalidation.",
  "frontend/src/index.css": "Tailwind base styles plus custom CSS variables for themes and Theiarco color utilities.",
  "frontend/src/main.tsx": "Application entry that sets up React Query and Internet Identity provider before rendering App.",
  "frontend/src/pages/ComingSoon.tsx": "Simple placeholder page showing a 'Coming Soon' message with an icon and title.",
  "frontend/src/pages/Dashboard.tsx": "Dashboard page computing publisher, territory, task, and visit stats and displaying recent activity.",
  "frontend/src/pages/FieldServiceGroupProfile.tsx": "Displays details for a specific field service group, including overseer, assistant, and sorted member list with badges. Handles loading, invalid groups, and navigation.",
  "frontend/src/pages/FieldServiceGroups.tsx": "Lists all field service groups with overseer, assistant, and active publishers, linking to each group’s profile page. Fetches publishers and organizes data by group number.",
  "frontend/src/pages/Login.tsx": "Provides a login screen using Internet Identity with a styled authentication button. Shows loading feedback during the login process.",
  "frontend/src/pages/Notes.tsx": "Manages global notes with category filtering, sorting, creation, editing, and deletion. Fetches notes and publishers while supporting modal dialogs and confirmation prompts.",
  "frontend/src/pages/Pioneers.tsx": "Displays all pioneers in a sortable table with options to add, edit, and delete entries. Integrates modal dialogs and loads publisher data for selection.",
  "frontend/src/pages/PublicWitnessing.tsx": "Shows a sortable table of trained publishers with training date and authorization status. Supports adding, editing, and deleting trained publisher records via modals and dialogs.",
  "frontend/src/pages/PublisherProfile.tsx": "Displays a single publisher's profile with edit and delete actions, loading states, and privilege badges.",
  "frontend/src/pages/Publishers.tsx": "Lists all publishers with filtering, search, and group selection plus add, edit, and delete functionality.",
  "frontend/src/pages/ServiceMeetingConductors.tsx": "Shows trained conductors in a sortable table with add, edit, and delete options.",
  "frontend/src/pages/Shepherding.tsx": "Manages shepherding visits with search, sorting, and actions to view, record, edit, or delete visits.",
  "frontend/src/pages/ShepherdingVisitProfile.tsx": "Displays details of a single shepherding visit with note editing, visit editing, and delete functionality.",
  "frontend/src/pages/Tasks.tsx": "Renders the task list with filtering, add/edit/delete modals, and completion toggling via task-related hooks.",
  "frontend/src/pages/Territories.tsx": "Displays all territories with status coloring, duration highlighting, and navigation to individual territory profiles.",
  "frontend/src/pages/TerritoryProfile.tsx": "Shows details for a single territory with edit, delete, checkout, return, and checkout history management.",
  "frontend/src/pages/UserProfile.tsx": "Provides a user profile page allowing editing and saving of name and congregation fields with inline edit controls.",
  "frontend/src/utils/formatters.ts": "Contains utility functions for formatting various backend timestamps into human-readable date strings.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL or hash parameters, persist them in sessionStorage, and clear parameters, supporting both standard and hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, custom colors, animations, container settings, and plugin usage.",
  "project_state.json": "Stores the project’s state, including metadata, existing features, and a new feature request about scrollable dropdown menus in several modals."
}