{
  "backend/main.mo": "Motoko backend implementing user profiles, access control, and full CRUD operations for publishers with permission checks.",
  "feature_evidence.json": "Feature evidence report listing required frontend changes related to showing publisher data in the Territories table.",
  "frontend-file-summaries.txt": "Prewritten summaries describing roles of various frontend files including pages, hooks, and components.",
  "frontend/.env": "Environment variable file defining the Internet Identity provider URL.",
  "frontend/index.css": "Global Tailwind base configuration defining theme variables, colors, and dark mode styles.",
  "frontend/index.html": "Simple HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main routing setup for all pages including authentication gating and layout rendering.",
  "frontend/src/components/conductors/ConductorModal.tsx": "Modal form for creating and editing trained conductors, loading publishers and submitting mutations.",
  "frontend/src/components/conductors/DeleteConductorDialog.tsx": "Confirmation dialog that deletes a conductor using a mutation and shows a loading state.",
  "frontend/src/components/fieldService/DeleteGroupVisitDialog.tsx": "Dialog to confirm deletion of a group visit, calling a mutation and showing toast notifications.",
  "frontend/src/components/fieldService/GroupVisitCard.tsx": "Displays a group visit’s date, topics, attendees, and notes with optional edit/delete actions.",
  "frontend/src/components/fieldService/RecordGroupVisitModal.tsx": "Form modal for creating or editing a group visit with validation and timestamp conversion.",
  "frontend/src/components/layout/AppLayout.tsx": "Main application layout with sidebar, header, routed content, and global toasts.",
  "frontend/src/components/layout/Header.tsx": "Header with menu toggle and logout functionality that clears identity and cache.",
  "frontend/src/components/layout/Sidebar.tsx": "Collapsible navigation sidebar listing app routes with mobile overlay support.",
  "frontend/src/components/notes/AddGlobalNoteModal.tsx": "Modal for creating or editing global notes, including category selection and optional publisher attachment.",
  "frontend/src/components/notes/GlobalNoteCard.tsx": "Displays a note card with title, category badge, optional attached publisher, content preview, creation date, and edit/delete actions.",
  "frontend/src/components/pioneers/AddPioneerHoursModal.tsx": "Modal for adding monthly pioneer hours, validating input and submitting via mutation before closing.",
  "frontend/src/components/pioneers/AddPioneerModal.tsx": "Modal to create a pioneer by selecting an active publisher and service year, submitting via mutation with success/error toasts.",
  "frontend/src/components/pioneers/CurrentStatusBadge.tsx": "Badge component showing pioneer status (loading, no entries, on track, behind) based on average monthly hours.",
  "frontend/src/components/pioneers/DeletePioneerDialog.tsx": "Confirmation dialog to delete a pioneer record, triggering a mutation and showing success/error toasts.",
  "frontend/src/components/pioneers/DeletePioneerHoursDialog.tsx": "Dialog to delete a specific month's pioneer hours, calling a mutation and showing a loading state during deletion.",
  "frontend/src/components/pioneers/EditPioneerHoursModal.tsx": "Modal for editing an existing hours record, pre-filling current value and updating it via mutation.",
  "frontend/src/components/pioneers/EditPioneerModal.tsx": "Modal for editing pioneer details, allowing publisher and service year changes and submitting updates with validation and toasts.",
  "frontend/src/components/pioneers/PioneerSummaryStatsCard.tsx": "Displays total hours, service year average, and a status badge for a pioneer.",
  "frontend/src/components/pioneers/PioneerTableRow.tsx": "Renders a table row showing a pioneer's details, calculated hours, status badge, and action buttons.",
  "frontend/src/components/publicWitnessing/DeleteTrainedPublisherDialog.tsx": "Confirmation dialog to delete a trained publisher using a mutation hook.",
  "frontend/src/components/publicWitnessing/TrainedPublisherModal.tsx": "Modal for creating or editing a trained publisher with form fields and mutation handling.",
  "frontend/src/components/publishers/AddPublisherModal.tsx": "Modal to add a new publisher with validation, mutation submission, and toast notifications.",
  "frontend/src/components/publishers/DeletePublisherNoteDialog.tsx": "Empty file.",
  "frontend/src/components/publishers/EditPublisherModal.tsx": "Modal to edit publisher details, mapping privileges and submitting updates via mutation.",
  "frontend/src/components/publishers/EditPublisherNoteModal.tsx": "Empty file.",
  "frontend/src/components/publishers/PublisherNoteCard.tsx": "Empty file.",
  "frontend/src/components/publishers/PublisherNotesSection.tsx": "Empty file.",
  "frontend/src/components/shepherding/EditShepherdingVisitModal.tsx": "Modal to edit a shepherding visit with validation, timestamp conversion, and update mutation.",
  "frontend/src/components/shepherding/RecordVisitModal.tsx": "Modal form for recording a shepherding visit, including validation, date conversion, and API submission.",
  "frontend/src/components/tasks/AddTaskModal.tsx": "Modal for creating a new task with required field validation, date conversion, and task submission.",
  "frontend/src/components/tasks/EditTaskModal.tsx": "Modal for editing an existing task, initializing form fields from the task and submitting updates via API.",
  "frontend/src/components/territories/AddTerritoryModal.tsx": "Modal for adding a new territory with basic validation and API creation.",
  "frontend/src/components/territories/CheckoutHistoryTable.tsx": "Table displaying sorted territory checkout history with optional edit and delete actions.",
  "frontend/src/components/territories/CheckOutTerritoryModal.tsx": "Modal to check out a territory to a publisher, supporting campaign flagging and API submission.",
  "frontend/src/components/territories/DeleteCheckoutRecordDialog.tsx": "Confirmation dialog that deletes a checkout record via mutation and shows success or error toasts.",
  "frontend/src/components/territories/DeleteTerritoryNoteDialog.tsx": "Dialog to confirm and execute deletion of a territory note, with toast notifications.",
  "frontend/src/components/territories/EditCheckoutRecordModal.tsx": "Modal for editing a checkout record, handling publisher selection, date fields, validation, and update mutation.",
  "frontend/src/components/territories/EditTerritoryModal.tsx": "Modal for editing a territory’s number and type with validation and update mutation.",
  "frontend/src/components/territories/EditTerritoryNoteModal.tsx": "Modal that edits an existing territory note’s content and saves updates via mutation.",
  "frontend/src/components/territories/TerritoryNoteCard.tsx": "Card displaying a territory note with formatted date and edit/delete buttons.",
  "frontend/src/components/territories/TerritoryNotesSection.tsx": "Section for creating, listing, editing, and deleting territory notes with sorting and modals.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages the backend actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useAddPublisher.ts": "Mutation hook to add a publisher, mapping UI privileges to backend format and invalidating publisher queries.",
  "frontend/src/hooks/useCallerUserProfile.ts": "No summary available.",
  "frontend/src/hooks/useCheckOutTerritory.ts": "No summary available.",
  "frontend/src/hooks/useCreateGlobalNote.ts": "No summary available.",
  "frontend/src/hooks/useCreateGroupVisit.ts": "No summary available.",
  "frontend/src/hooks/useCreatePioneer.ts": "No summary available.",
  "frontend/src/hooks/useCreateShepherdingVisit.ts": "No summary available.",
  "frontend/src/hooks/useCreateTask.ts": "No summary available.",
  "frontend/src/hooks/useCreateTerritory.ts": "No summary available.",
  "frontend/src/hooks/useCreateTrainedConductor.ts": "No summary available.",
  "frontend/src/hooks/useCreateTrainedPublisher.ts": "No summary available.",
  "frontend/src/hooks/useDeleteCheckoutRecord.ts": "No summary available.",
  "frontend/src/hooks/useDeleteGlobalNote.ts": "No summary available.",
  "frontend/src/hooks/useDeleteGroupVisit.ts": "No summary available.",
  "frontend/src/hooks/useDeletePioneer.ts": "No summary available.",
  "frontend/src/hooks/useDeletePublisher.ts": "No summary available.",
  "frontend/src/hooks/useDeleteTask.ts": "No summary available.",
  "frontend/src/hooks/useDeleteTrainedConductor.ts": "No summary available.",
  "frontend/src/hooks/useDeleteTrainedPublisher.ts": "No summary available.",
  "frontend/src/hooks/useGlobalNotes.ts": "No summary available.",
  "frontend/src/hooks/useGroupVisit.ts": "No summary available.",
  "frontend/src/hooks/useGroupVisits.ts": "No summary available.",
  "frontend/src/hooks/useInternetIdentity.ts": "No summary available.",
  "frontend/src/hooks/usePioneerHours.ts": "Provides React Query hooks to fetch, add, update, and delete pioneer monthly hours with cache invalidation and toast notifications.",
  "frontend/src/hooks/usePioneers.ts": "Defines hooks to fetch all pioneers or a single pioneer using actor-backed queries.",
  "frontend/src/hooks/usePioneersOnTrack.ts": "Calculates how many pioneers meet the 50‑hour monthly average by aggregating service year hours via actor queries.",
  "frontend/src/hooks/usePublisherNotes.ts": "Empty placeholder file for publisher notes hooks.",
  "frontend/src/hooks/useQueries.ts": "Exposes hooks for fetching all publishers or a specific publisher from the backend actor.",
  "frontend/src/hooks/useServiceMeetingConductors.ts": "Fetches all service meeting conductor assignments through a simple React Query hook.",
  "frontend/src/hooks/useShepherdingVisit.ts": "Hooks to fetch, update, update notes, and delete a single shepherding visit with appropriate cache updates.",
  "frontend/src/hooks/useShepherdingVisits.ts": "Provides a hook to retrieve all shepherding visits from the backend actor.",
  "frontend/src/hooks/useTasks.ts": "Contains hooks to fetch tasks by status or fetch a single task by ID.",
  "frontend/src/hooks/useTerritories.ts": "Fetches all territories using an actor‑backed React Query hook.",
  "frontend/src/hooks/useTerritory.ts": "Supplies hooks for retrieving, updating, deleting, and marking territories returned or available with cache invalidation.",
  "frontend/src/hooks/useTerritoryNotes.ts": "Implements CRUD hooks for territory notes scoped to a territory ID.",
  "frontend/src/hooks/useTrainedConductor.ts": "Offers hooks to fetch, update notes for, and delete a single trained conductor with cache updates.",
  "frontend/src/hooks/useTrainedConductors.ts": "Provides a hook to retrieve all trained service meeting conductors.",
  "frontend/src/hooks/useTrainedPublishers.ts": "Defines a hook for fetching all trained publishers.",
  "frontend/src/hooks/useUpdateCheckoutRecord.ts": "Mutation hook to modify a territory checkout record and refresh related territory queries.",
  "frontend/src/hooks/useUpdateGlobalNote.ts": "Mutation hook to update a global note and invalidate the global notes list.",
  "frontend/src/hooks/useUpdateGroupVisit.ts": "Provides a mutation to update a group visit and invalidates related group visit queries.",
  "frontend/src/hooks/useUpdatePioneer.ts": "Defines a mutation for editing a pioneer and refreshes the pioneers list and profile queries.",
  "frontend/src/hooks/useUpdatePublisher.ts": "Updates a publisher's details and privileges, then invalidates the publishers list query.",
  "frontend/src/hooks/useUpdateTask.ts": "Supplies a mutation to update a task and triggers refetch of all tasks.",
  "frontend/src/hooks/useUpdateTaskCompletion.ts": "Allows updating a task's completion status and refreshes all task queries.",
  "frontend/src/hooks/useUpdateTrainedConductor.ts": "Handles updating trained conductor data, invalidates related queries, and shows a success toast.",
  "frontend/src/hooks/useUpdateTrainedPublisher.ts": "Updates a trained publisher and their S-148 status, refreshes list data, and handles toast notifications.",
  "frontend/src/index.css": "Defines Tailwind base styles and extensive color variables for light and dark modes with utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/ComingSoon.tsx": "Renders a placeholder page indicating a feature is under development.",
  "frontend/src/pages/ConductorProfile.tsx": "Displays and manages a trained conductor's profile with notes editing and delete actions.",
  "frontend/src/pages/Dashboard.tsx": "Computes and displays congregation statistics, recent activity, and task/territory statuses on the dashboard.",
  "frontend/src/pages/FieldServiceGroupProfile.tsx": "Displays details for a specific field service group, including publishers, overseer/assistant info, and visit history with options to add, edit, or delete visits.",
  "frontend/src/pages/FieldServiceGroups.tsx": "Lists all field service groups with overseer, assistant, and active publishers, linking to each group's profile page.",
  "frontend/src/pages/GroupVisitProfile.tsx": "Shows details for a single group visit with publisher mapping, notes, and editing or deletion options, validating group association.",
  "frontend/src/pages/Login.tsx": "Provides a login screen using Internet Identity with a branded layout and loading state.",
  "frontend/src/pages/Notes.tsx": "Manages global notes with category filtering, creation, editing, deletion, and publisher name mapping.",
  "frontend/src/pages/PioneerProfile.tsx": "Displays and manages a pioneer's profile, including monthly hours, inline editing, statistics, and modals for editing or deleting records.",
  "frontend/src/pages/Pioneers.tsx": "Page that lists pioneers, supports sorting by publisher name, and provides add, edit, and delete modals.",
  "frontend/src/pages/PublicWitnessing.tsx": "Displays trained publishers with sorting, status badges, and edit/delete actions, plus a modal to add or modify entries.",
  "frontend/src/pages/PublisherProfile.tsx": "Shows a single publisher’s details with privilege badges and provides edit and delete functionality.",
  "frontend/src/pages/Publishers.tsx": "Lists publishers with search, group, and activity filters, and includes add, edit, and delete workflows.",
  "frontend/src/pages/ServiceMeetingConductors.tsx": "Manages trained conductors with alphabetical sorting, availability display, and add, edit, and delete dialogs.",
  "frontend/src/pages/Shepherding.tsx": "Lists shepherding visits with search, sorting, and actions to view, edit, record, or delete visits.",
  "frontend/src/pages/ShepherdingVisitProfile.tsx": "Displays a single shepherding visit with editable notes and options to edit or delete the record.",
  "frontend/src/pages/Tasks.tsx": "Shows tasks with filtering, completion toggling, and dialogs for adding, editing, and deleting tasks.",
  "frontend/src/pages/Territories.tsx": "Displays all territories with status, publisher info, and check-out duration, plus the option to add territories.",
  "frontend/src/pages/TerritoryProfile.tsx": "Shows detailed territory info with edit, delete, check-out, return, and checkout-history management actions.",
  "frontend/src/pages/UserProfile.tsx": "User profile page with editable full name and congregation fields, including save and cancel logic tied to profile hooks.",
  "frontend/src/utils/formatters.ts": "Collection of timestamp formatting helpers converting bigint timestamps (seconds or nanoseconds) into readable date strings.",
  "frontend/src/utils/groupVisitNotes.ts": "Parses a combined notes string into structured fields for discussion topics, overseer notes, assistant notes, and next visit date.",
  "frontend/src/utils/serviceYear.ts": "Computes the current service year string based on the date, using a September–August cycle.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, persisting, and clearing URL parameters, supporting both query and hash routing.",
  "frontend/tailwind.config.js": "Tailwind configuration with custom colors, animations, radius values, and plugin integrations.",
  "project_state.json": "Project state file tracking requirements to add a Publisher column to the Territories table based on the most recent checkout."
}