{
  "backend/main.mo": "Motoko canister implementing access-controlled user profiles and publisher management, including CRUD operations for publishers and caller-scoped user profiles using an authorization mixin.",
  "feature_evidence.json": "Structured report documenting implemented frontend features, their related files, components, test requirements, and confidence levels for Notes and related functionality.",
  "frontend-file-summaries.txt": "Prewritten summaries of numerous frontend files describing routing, layout, authentication, publisher management, hooks, and styling across the React application.",
  "frontend/.env": "Environment configuration specifying the Internet Identity provider URL used for authentication.",
  "frontend/index.css": "Global Tailwind CSS styles defining design tokens, color themes (light/dark), and base layout styling for the application.",
  "frontend/index.html": "HTML entry point that mounts the React application and loads the main TypeScript module.",
  "frontend/src/App.tsx": "Main React application file that configures authentication-aware routing using TanStack Router and defines all top-level routes.",
  "frontend/src/components/layout/AppLayout.tsx": "Authenticated application layout composing the sidebar, header, routed content outlet, and global toast notifications.",
  "frontend/src/components/layout/Header.tsx": "Top navigation header showing the app title, mobile menu toggle, and logout button that clears authentication and cached queries.",
  "frontend/src/components/layout/Sidebar.tsx": "Responsive navigation sidebar component with mobile overlay, active route highlighting, and links to main app sections using TanStack Router.",
  "frontend/src/components/notes/AddGlobalNoteModal.tsx": "Modal form for creating a global note with title, content, category, and optional publisher attachment, using react-query mutation and toast feedback.",
  "frontend/src/components/publishers/AddPublisherModal.tsx": "Modal dialog for adding a new publisher with personal details, privileges, group roles, and active status, backed by a react-query mutation.",
  "frontend/src/components/publishers/DeletePublisherNoteDialog.tsx": "Empty or unimplemented file intended for a dialog to confirm deletion of a publisher note.",
  "frontend/src/components/publishers/EditPublisherModal.tsx": "Modal form for editing an existing publisher, prefilled from backend data and updating details via a react-query mutation.",
  "frontend/src/components/publishers/EditPublisherNoteModal.tsx": "Empty or unimplemented file intended for editing a publisher note.",
  "frontend/src/components/publishers/PublisherNoteCard.tsx": "Empty or unimplemented file likely meant to render an individual publisher note card.",
  "frontend/src/components/publishers/PublisherNotesSection.tsx": "Empty or unimplemented file likely intended to display and manage a list of notes for a publisher.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches a backend actor based on authentication state and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useAddPublisher.ts": "React-query mutation hook that maps UI privilege selections to backend format and calls the actor to add a new publisher.",
  "frontend/src/hooks/useCreateGlobalNote.ts": "React-query mutation hook for creating global notes with validation and cache invalidation for global notes.",
  "frontend/src/hooks/useDeletePublisher.ts": "React-query mutation hook to delete a publisher with optimistic cache updates, rollback on error, and toast notifications.",
  "frontend/src/hooks/useGlobalNotes.ts": "React-query hooks for fetching all global notes or a single global note from the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Defines a React context, provider, and hook to manage Internet Identity authentication using DFINITY AuthClient, exposing login/logout, identity state, and detailed login status flags.",
  "frontend/src/hooks/usePublisherNotes.ts": "This file currently contains no implementation and appears to be a placeholder for future publisher notes–related hooks.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks to fetch all publishers or a single publisher from the backend actor, handling availability of the actor before querying.",
  "frontend/src/hooks/useUpdatePublisher.ts": "Implements a React Query mutation hook to update publisher details, mapping UI privilege selections to backend privilege objects and invalidating cached publisher queries on success.",
  "frontend/src/index.css": "Configures Tailwind CSS base styles, theme variables for light and dark modes, and custom utility classes including a branded Theiarco primary color.",
  "frontend/src/main.tsx": "Application entry point that renders the React app, wrapping it with React Query and Internet Identity providers and importing global styles.",
  "frontend/src/pages/ComingSoon.tsx": "Reusable page component that displays a centered \"Coming Soon\" message with an icon and title for unfinished features.",
  "frontend/src/pages/Login.tsx": "Login page that triggers Internet Identity authentication and displays a branded login UI with loading feedback.",
  "frontend/src/pages/Notes.tsx": "Notes page UI with category filters, an add-note modal trigger, and placeholder content for future notes display.",
  "frontend/src/pages/PublisherProfile.tsx": "Detail page for a single publisher showing profile information, privileges, edit and delete actions, and navigation back to the publishers list.",
  "frontend/src/pages/Publishers.tsx": "Publishers list page with table display, search and filter controls, add/edit/delete modals, and React Query–powered data fetching.",
  "frontend/src/utils/formatters.ts": "Utility function to convert backend nanosecond timestamps into human-readable date strings for display.",
  "frontend/src/utils/urlParams.ts": "Provides utilities to read URL parameters from query strings or hash-based routes, persist them in sessionStorage, and retrieve or clear them across navigation. Includes helpers to prioritize URL values, fall back to session storage, and safely manage sensitive params.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration enabling class-based dark mode, custom container settings, and extensive theme extensions for colors, radii, shadows, and animations. Integrates typography, container queries, and animation plugins.",
  "project_state.json": "Machine-readable snapshot of the project’s current state, describing Theiarco as an ICP dapp with a Motoko backend and React/Vite frontend. Enumerates implemented features such as RBAC, user profiles, and publisher management with versioned metadata."
}