{
  "backend/main.mo": "Motoko canister implementing user profiles and CRUD operations for publishers with access‑controlled queries and updates.",
  "feature_evidence.json": "Feature evidence report listing required frontend changes, involved files, components, and test IDs for territory table enhancements.",
  "frontend-file-summaries.txt": "JSON-like text providing summaries of various frontend files and components for reference.",
  "frontend/.env": "Environment file setting the Internet Identity provider URL.",
  "frontend/index.css": "Global Tailwind and OKLCH theme variable definitions for light and dark modes.",
  "frontend/index.html": "Base HTML file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React routing setup with authentication gating, layout rendering, and all app routes defined.",
  "frontend/src/components/layout/AppLayout.tsx": "App shell containing header, sidebar, and routed content area with toast support.",
  "frontend/src/components/layout/Header.tsx": "Header with app title, mobile menu button, and logout logic clearing auth and cache.",
  "frontend/src/components/layout/Sidebar.tsx": "Responsive sidebar component providing navigation links with active-state styling and mobile toggle behavior.",
  "frontend/src/components/notes/AddGlobalNoteModal.tsx": "Modal for creating or editing global notes with category selection, publisher attachment, validation, and mutation handling.",
  "frontend/src/components/notes/GlobalNoteCard.tsx": "Card displaying a global note with category badge, content preview, date, and edit/delete actions.",
  "frontend/src/components/publishers/AddPublisherModal.tsx": "Modal for adding a new publisher with form fields, validation, and submission via mutation.",
  "frontend/src/components/publishers/DeletePublisherNoteDialog.tsx": "Empty file containing no implementation.",
  "frontend/src/components/publishers/EditPublisherModal.tsx": "Modal for editing an existing publisher, initializing form fields from data and updating via mutation.",
  "frontend/src/components/publishers/EditPublisherNoteModal.tsx": "Empty file containing no implementation.",
  "frontend/src/components/publishers/PublisherNoteCard.tsx": "Empty file containing no implementation.",
  "frontend/src/components/publishers/PublisherNotesSection.tsx": "Empty file containing no implementation.",
  "frontend/src/components/tasks/AddTaskModal.tsx": "Modal for creating a new task with title, due date, category, notes, validation, and submission handling.",
  "frontend/src/components/tasks/EditTaskModal.tsx": "Modal form for editing a task, initializing fields from the task and submitting updates via useUpdateTask.",
  "frontend/src/components/territories/AddTerritoryModal.tsx": "Modal for creating a new territory with validation and submission through useCreateTerritory.",
  "frontend/src/components/territories/CheckoutHistoryTable.tsx": "Displays a sorted table of a territory’s checkout history with dates and campaign status.",
  "frontend/src/components/territories/CheckOutTerritoryModal.tsx": "Modal for checking out a territory to a publisher, including campaign flag and publisher lookup.",
  "frontend/src/components/territories/DeleteTerritoryNoteDialog.tsx": "Confirmation dialog for deleting a territory note using useDeleteTerritoryNote.",
  "frontend/src/components/territories/EditTerritoryModal.tsx": "Modal for editing a territory’s number and type with validation and update submission.",
  "frontend/src/components/territories/EditTerritoryNoteModal.tsx": "Modal for editing the content of a territory note and saving updates via useUpdateTerritoryNote.",
  "frontend/src/components/territories/TerritoryNoteCard.tsx": "Card displaying a territory note’s content and date with edit and delete action buttons.",
  "frontend/src/components/territories/TerritoryNotesSection.tsx": "Renders a notes composer and list for a territory, handling creation, sorting, editing, and deletion of notes via modals and hooks.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refreshing dependent queries when the identity changes.",
  "frontend/src/hooks/useAddPublisher.ts": "Provides a mutation to add a publisher, mapping UI privilege values to backend format and invalidating the publishers list.",
  "frontend/src/hooks/useCheckOutTerritory.ts": "Defines a mutation to check out a territory to a publisher and refreshes related territory queries on success.",
  "frontend/src/hooks/useCreateGlobalNote.ts": "Handles creating global notes with validation and invalidates global notes queries after creation.",
  "frontend/src/hooks/useCreateTask.ts": "Provides a mutation to create a task from given params and invalidates all task queries afterward.",
  "frontend/src/hooks/useCreateTerritory.ts": "Creates a new territory with a generated ID and refreshes the territories list on success.",
  "frontend/src/hooks/useDeleteGlobalNote.ts": "Deletes a global note by ID and invalidates the global notes query.",
  "frontend/src/hooks/useDeletePublisher.ts": "Deletes a publisher with optimistic updates and rollback handling, then refreshes the publishers list.",
  "frontend/src/hooks/useDeleteTask.ts": "Defines a mutation to delete a task and invalidates task queries afterward.",
  "frontend/src/hooks/useGlobalNotes.ts": "Provides queries to fetch all global notes or a single note using the actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider and hook for managing login, stored identities, and auth state.",
  "frontend/src/hooks/usePublisherNotes.ts": "This file is currently empty.",
  "frontend/src/hooks/useQueries.ts": "Exposes queries to fetch all publishers or a single publisher using the backend actor.",
  "frontend/src/hooks/useTasks.ts": "Provides queries to fetch tasks by status or a single task from the backend.",
  "frontend/src/hooks/useTerritories.ts": "Supplies a query for fetching all territories via the backend actor.",
  "frontend/src/hooks/useTerritory.ts": "Provides React Query hooks for fetching, updating, deleting, and modifying the status of territories, with cache invalidation for territory-related queries.",
  "frontend/src/hooks/useTerritoryNotes.ts": "Implements hooks to fetch, create, update, and delete territory notes, triggering cache invalidation for note lists.",
  "frontend/src/hooks/useUpdateGlobalNote.ts": "Defines a mutation hook to update a global note and invalidate the global notes query cache.",
  "frontend/src/hooks/useUpdatePublisher.ts": "Provides a mutation hook to update publisher data, including privilege mapping, and invalidates the publishers list cache.",
  "frontend/src/hooks/useUpdateTask.ts": "Exposes a hook to update tasks and refresh all task queries.",
  "frontend/src/hooks/useUpdateTaskCompletion.ts": "Offers a hook to update task completion state and invalidate task queries.",
  "frontend/src/index.css": "Configures Tailwind styles and custom OKLCH color variables, including light/dark themes and utility classes.",
  "frontend/src/main.tsx": "Initializes the React app with React Query and Internet Identity providers and renders the root component.",
  "frontend/src/pages/ComingSoon.tsx": "Renders a simple placeholder page displaying a title and 'Coming Soon' message.",
  "frontend/src/pages/Login.tsx": "Implements the login screen using Internet Identity with a styled authentication button.",
  "frontend/src/pages/Notes.tsx": "Displays, filters, sorts, creates, edits, and deletes global notes with modal and confirmation dialogs.",
  "frontend/src/pages/PublisherProfile.tsx": "Shows a detailed publisher profile with edit and delete functionality, including privilege display and navigation controls.",
  "frontend/src/pages/Publishers.tsx": "Page for listing, filtering, adding, editing, and deleting publishers with search, group, and active-status filters.",
  "frontend/src/pages/Tasks.tsx": "Page for viewing, filtering, adding, editing, completing, and deleting tasks with backend-driven status filtering.",
  "frontend/src/pages/Territories.tsx": "Displays all territories, their status, checkout duration, and provides navigation and adding new territories.",
  "frontend/src/pages/TerritoryProfile.tsx": "Shows a single territory’s details, status actions, edit/delete options, checkout history, and notes.",
  "frontend/src/utils/formatters.ts": "Utility functions for converting backend timestamps (nanoseconds/seconds) into formatted date strings.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, storing, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom color tokens, extended theme utilities, animations, and typography/container-query/animate plugins.",
  "project_state.json": "JSON describing the project’s current feature state, outlining territory checkout-duration requirements, architecture notes, and existing feature definitions."
}