{
  "backend/main.mo": "Motoko canister implementing access control, user profiles, and CRUD operations for publishers with permission checks.",
  "feature_evidence.json": "Feature evidence report listing dashboard-related features, affected files, components, test IDs, and confidence.",
  "frontend-file-summaries.txt": "Text file summarizing the purpose of all frontend files including pages, hooks, components, and configuration.",
  "frontend/.env": "Environment file specifying the Internet Identity provider URL.",
  "frontend/index.css": "Global Tailwind and OKLCH-based theme variables defining light and dark mode styling.",
  "frontend/index.html": "Base HTML document bootstrapping the React application.",
  "frontend/src/App.tsx": "Main app router configuring authentication flow and all application routes.",
  "frontend/src/components/conductors/ConductorModal.tsx": "Modal form for creating and editing trained service meeting conductors with publisher lookup and availability fields.",
  "frontend/src/components/conductors/DeleteConductorDialog.tsx": "Confirmation dialog that triggers deletion of a conductor using a mutation and displays a loading state.",
  "frontend/src/components/layout/AppLayout.tsx": "Main layout wrapper providing sidebar, header, routed page content, and toast notifications.",
  "frontend/src/components/layout/Header.tsx": "Top header bar with menu toggle and logout functionality that clears identity and query cache.",
  "frontend/src/components/layout/Sidebar.tsx": "Navigation sidebar with mobile toggle, active-route highlighting, and scrollable nav links.",
  "frontend/src/components/notes/AddGlobalNoteModal.tsx": "Modal for creating or editing a global note with validation, category handling, and publisher attachment.",
  "frontend/src/components/notes/GlobalNoteCard.tsx": "Displays a note with category badge, preview text, date, and edit/delete actions.",
  "frontend/src/components/pioneers/AddPioneerModal.tsx": "Modal for adding a pioneer by selecting an active publisher and service year, with validation and success/error toasts.",
  "frontend/src/components/pioneers/DeletePioneerDialog.tsx": "Confirmation dialog to delete a pioneer record using a mutation with success/error feedback.",
  "frontend/src/components/pioneers/EditPioneerModal.tsx": "Provides a modal for editing a pioneer's assigned publisher and service year with validation and update mutation.",
  "frontend/src/components/publicWitnessing/DeleteTrainedPublisherDialog.tsx": "Confirmation dialog that deletes a trained publisher using a mutation and closes on completion.",
  "frontend/src/components/publicWitnessing/TrainedPublisherModal.tsx": "Modal for creating or editing a trained publisher, including publisher selection, training date, and authorization state.",
  "frontend/src/components/publishers/AddPublisherModal.tsx": "Modal for adding a new publisher with fields for name, group, privileges, and activity status, submitted via mutation.",
  "frontend/src/components/publishers/DeletePublisherNoteDialog.tsx": "Empty file placeholder for a delete-note dialog component.",
  "frontend/src/components/publishers/EditPublisherModal.tsx": "Provides a modal to edit publisher details such as name, group, privileges, and activity status using an update mutation.",
  "frontend/src/components/publishers/EditPublisherNoteModal.tsx": "Empty file placeholder for an edit-note modal component.",
  "frontend/src/components/publishers/PublisherNoteCard.tsx": "Empty file placeholder for a note display component.",
  "frontend/src/components/publishers/PublisherNotesSection.tsx": "Empty file placeholder for a section displaying publisher notes.",
  "frontend/src/components/shepherding/EditShepherdingVisitModal.tsx": "Modal for editing a shepherding visit with publisher selection, visit date, and elders present, submitted via update mutation.",
  "frontend/src/components/shepherding/RecordVisitModal.tsx": "Modal for recording a shepherding visit with form validation and mutation submission.",
  "frontend/src/components/tasks/AddTaskModal.tsx": "Modal for creating a new task with required fields, category selection, and mutation handling.",
  "frontend/src/components/tasks/EditTaskModal.tsx": "Modal for editing an existing task, preloading task data and submitting updates.",
  "frontend/src/components/territories/AddTerritoryModal.tsx": "Modal to create a territory with number and type validation before submitting.",
  "frontend/src/components/territories/CheckoutHistoryTable.tsx": "Table displaying sorted territory checkout history with optional edit actions.",
  "frontend/src/components/territories/CheckOutTerritoryModal.tsx": "Modal to check out a territory to a selected publisher with optional campaign flag.",
  "frontend/src/components/territories/DeleteTerritoryNoteDialog.tsx": "Confirmation dialog that deletes a territory note using a mutation and shows toast messages.",
  "frontend/src/components/territories/EditCheckoutRecordModal.tsx": "Modal for editing a checkout record, including publisher selection and date handling, and saving updates via mutation.",
  "frontend/src/components/territories/EditTerritoryModal.tsx": "Modal for editing a territory’s number and type with validation and update mutation.",
  "frontend/src/components/territories/EditTerritoryNoteModal.tsx": "Modal allowing users to edit a territory note’s content and save changes through a mutation.",
  "frontend/src/components/territories/TerritoryNoteCard.tsx": "Card component displaying a single territory note with edit and delete controls.",
  "frontend/src/components/territories/TerritoryNotesSection.tsx": "Section to create, list, edit, and delete notes for a territory using related hooks and modals.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages the authenticated or anonymous backend actor and invalidates dependent queries on change.",
  "frontend/src/hooks/useAddPublisher.ts": "Mutation hook to add a new publisher, mapping privilege data and invalidating publisher queries on success.",
  "frontend/src/hooks/useCheckOutTerritory.ts": "Mutation hook for checking out a territory and invalidating territory-related queries afterward.",
  "frontend/src/hooks/useCreateGlobalNote.ts": "Mutation hook to create a validated global note and refresh global notes queries on success.",
  "frontend/src/hooks/useCreatePioneer.ts": "Creates a pioneer via actor.createPioneer and invalidates the pioneers query.",
  "frontend/src/hooks/useCreateShepherdingVisit.ts": "Creates a shepherding visit and invalidates the shepherdingVisits query.",
  "frontend/src/hooks/useCreateTask.ts": "Creates a task from mapped params and invalidates all task queries.",
  "frontend/src/hooks/useCreateTerritory.ts": "Generates an ID, creates a territory, and invalidates the territories query.",
  "frontend/src/hooks/useCreateTrainedConductor.ts": "Creates a trained conductor, invalidates trainedConductors, and shows toast feedback.",
  "frontend/src/hooks/useCreateTrainedPublisher.ts": "Creates a trained publisher, invalidates trainedPublishers, and shows toast feedback.",
  "frontend/src/hooks/useDeleteGlobalNote.ts": "Deletes a global note and invalidates the globalNotes query.",
  "frontend/src/hooks/useDeletePioneer.ts": "Deletes a pioneer and invalidates the pioneers query.",
  "frontend/src/hooks/useDeletePublisher.ts": "Deletes a publisher with optimistic updates and invalidates the publishers query.",
  "frontend/src/hooks/useDeleteTask.ts": "Deletes a task and invalidates all tasks queries.",
  "frontend/src/hooks/useDeleteTrainedConductor.ts": "Deletes a trained conductor, invalidates trainedConductors, and shows toast feedback.",
  "frontend/src/hooks/useDeleteTrainedPublisher.ts": "Deletes a trained publisher, invalidates trainedPublishers, and shows toast feedback.",
  "frontend/src/hooks/useGlobalNotes.ts": "Provides queries to fetch all global notes or a single note by ID.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context providing identity, login, logout, and status management.",
  "frontend/src/hooks/usePioneers.ts": "Fetches all pioneers using actor.getAllPioneers.",
  "frontend/src/hooks/usePublisherNotes.ts": "Empty file with no implementation.",
  "frontend/src/hooks/useQueries.ts": "Provides queries to fetch all publishers or a single publisher by ID.",
  "frontend/src/hooks/useServiceMeetingConductors.ts": "Fetches all service meeting conductors.",
  "frontend/src/hooks/useShepherdingVisit.ts": "Fetches, updates, or deletes a single shepherding visit with cache invalidation.",
  "frontend/src/hooks/useShepherdingVisits.ts": "Fetches all shepherding visits.",
  "frontend/src/hooks/useTasks.ts": "Fetches tasks filtered by status or a single task by ID.",
  "frontend/src/hooks/useTerritories.ts": "Fetches all territories.",
  "frontend/src/hooks/useTerritory.ts": "Provides React Query hooks for fetching and mutating territory data, including get, update, delete, return, and make-available operations.",
  "frontend/src/hooks/useTerritoryNotes.ts": "Implements hooks to fetch, create, update, and delete notes tied to a specific territory with query invalidation.",
  "frontend/src/hooks/useTrainedConductors.ts": "Fetches all trained service meeting conductors using React Query.",
  "frontend/src/hooks/useTrainedPublishers.ts": "Fetches all trained publishers via a simple React Query hook.",
  "frontend/src/hooks/useUpdateCheckoutRecord.ts": "Mutation hook to update a territory checkout record and refresh related queries.",
  "frontend/src/hooks/useUpdateGlobalNote.ts": "Mutation hook for editing global notes and invalidating the global notes list.",
  "frontend/src/hooks/useUpdatePioneer.ts": "Updates a pioneer record and invalidates the pioneers query.",
  "frontend/src/hooks/useUpdatePublisher.ts": "Updates publisher details, maps privilege choices, and refreshes the publishers list.",
  "frontend/src/hooks/useUpdateTask.ts": "Mutation hook to update a task and refresh all task queries.",
  "frontend/src/hooks/useUpdateTaskCompletion.ts": "Updates a task’s completion status and invalidates all task queries.",
  "frontend/src/hooks/useUpdateTrainedConductor.ts": "Updates trained conductor records with toast notifications and query invalidation.",
  "frontend/src/hooks/useUpdateTrainedPublisher.ts": "Updates trained publisher data with success/error toasts and query refresh.",
  "frontend/src/index.css": "Tailwind setup defining theme variables, dark mode values, and custom utility classes.",
  "frontend/src/main.tsx": "Application entry point setting up React Query, identity provider, and rendering App.",
  "frontend/src/pages/ComingSoon.tsx": "Simple placeholder page showing a coming-soon notice with an icon and title.",
  "frontend/src/pages/Dashboard.tsx": "Dashboard page aggregating publishers, territories, tasks, and visits to display activity stats and recent items.",
  "frontend/src/pages/FieldServiceGroupProfile.tsx": "Displays details for a specific field service group, including leadership, members, and badges, with loading and invalid-group handling.",
  "frontend/src/pages/FieldServiceGroups.tsx": "Lists all field service groups with overseer, assistant, and active publisher summaries, linking to each group’s profile.",
  "frontend/src/pages/Login.tsx": "Provides the login screen using Internet Identity with a branded UI and loading state.",
  "frontend/src/pages/Notes.tsx": "Manages global notes with category filtering, sorting, add/edit/delete actions, and publisher name resolution.",
  "frontend/src/pages/Pioneers.tsx": "Displays, adds, edits, and deletes pioneers in a sortable table with supporting modals.",
  "frontend/src/pages/PublicWitnessing.tsx": "Shows trained publishers for public witnessing with sorting, add/edit/delete modals, and authorization status.",
  "frontend/src/pages/PublisherProfile.tsx": "Displays a single publisher’s profile with badges, edit/delete actions, and loading/error states.",
  "frontend/src/pages/Publishers.tsx": "Lists all publishers with filters, table display, and add/edit/delete functionality.",
  "frontend/src/pages/ServiceMeetingConductors.tsx": "Manages trained service meeting conductors with add, edit, delete options and a sortable table.",
  "frontend/src/pages/Shepherding.tsx": "Shows shepherding visits with search, sorting, record/edit/delete actions, and navigation to visit profiles.",
  "frontend/src/pages/ShepherdingVisitProfile.tsx": "Displays details for a single shepherding visit with note editing and delete/edit controls.",
  "frontend/src/pages/Tasks.tsx": "Tasks page with filtering, add/edit modals, completion toggling, and delete confirmation using task hooks.",
  "frontend/src/pages/Territories.tsx": "List view for territories with status colors, checkout duration logic, row highlighting, and add territory modal.",
  "frontend/src/pages/TerritoryProfile.tsx": "Territory detail page supporting editing, deletion, checkout/return actions, and viewing/editing checkout history.",
  "frontend/src/utils/formatters.ts": "Provides date formatting utilities for various backend timestamp types including tasks, notes, visits, and checkouts.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters across navigation and session storage.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme colors, container settings, animations, and plugin usage.",
  "project_state.json": "Holds project state describing a dashboard update to add a Recent Activity section listing the five latest shepherding visits. Includes existing features, a pending feature request, and metadata such as schema and project version."
}