{
  "backend/main.mo": "Actor implements access‑controlled user profiles and CRUD operations for publishers using in‑memory Map storage.",
  "feature_evidence.json": "Feature evidence report listing dashboard‑related requirements, affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries of all frontend files for reference.",
  "frontend/.env": "Environment file setting the Internet Identity provider URL.",
  "frontend/index.css": "Global stylesheet defining Tailwind layers and OKLCH CSS variables for light and dark themes.",
  "frontend/index.html": "Base HTML file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main router and auth gate configuring all application routes and rendering login or app layout based on identity state.",
  "frontend/src/components/conductors/ConductorModal.tsx": "Modal form for creating or editing trained service meeting conductors with publisher selection and availability fields.",
  "frontend/src/components/conductors/DeleteConductorDialog.tsx": "Confirmation dialog that deletes a conductor using a mutation and shows a loading state.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines the main application layout with sidebar, header, routed content, and toast notifications.",
  "frontend/src/components/layout/Header.tsx": "Header bar with menu toggle and logout logic that clears identity and query cache.",
  "frontend/src/components/layout/Sidebar.tsx": "Collapsible navigation sidebar with route links, mobile overlay handling, and a footer.",
  "frontend/src/components/notes/AddGlobalNoteModal.tsx": "Modal for creating or editing global notes with category and optional publisher attachment.",
  "frontend/src/components/notes/GlobalNoteCard.tsx": "Displays a global note with category badge, content preview, date, and edit/delete actions.",
  "frontend/src/components/pioneers/AddPioneerModal.tsx": "Modal to add a pioneer by selecting an active publisher and service year, with validation and success toasts.",
  "frontend/src/components/pioneers/DeletePioneerDialog.tsx": "Confirmation dialog to delete a pioneer record using a mutation and showing toast feedback.",
  "frontend/src/components/pioneers/EditPioneerModal.tsx": "Modal for editing a pioneer, handling form state, validation, and update mutation.",
  "frontend/src/components/publicWitnessing/DeleteTrainedPublisherDialog.tsx": "Confirmation dialog to delete a trained publisher using a delete mutation.",
  "frontend/src/components/publicWitnessing/TrainedPublisherModal.tsx": "Modal for creating or editing a trained publisher with form state, validation, and create/update mutations.",
  "frontend/src/components/publishers/AddPublisherModal.tsx": "Modal to add a new publisher with form fields, validation, and create mutation.",
  "frontend/src/components/publishers/DeletePublisherNoteDialog.tsx": "Empty file with no implementation.",
  "frontend/src/components/publishers/EditPublisherModal.tsx": "Modal to edit publisher details, initializing fields from existing data and submitting updates.",
  "frontend/src/components/publishers/EditPublisherNoteModal.tsx": "Empty file with no implementation.",
  "frontend/src/components/publishers/PublisherNoteCard.tsx": "Empty file with no implementation.",
  "frontend/src/components/publishers/PublisherNotesSection.tsx": "Empty file with no implementation.",
  "frontend/src/components/shepherding/EditShepherdingVisitModal.tsx": "Modal for editing a shepherding visit with validation, date handling, and update mutation.",
  "frontend/src/components/shepherding/RecordVisitModal.tsx": "Modal for creating a shepherding visit, including form validation, publisher selection, and submission using createVisit mutation.",
  "frontend/src/components/tasks/AddTaskModal.tsx": "Modal for adding a new task with fields for title, due date, category, and notes, validating input and submitting via createTask mutation.",
  "frontend/src/components/tasks/EditTaskModal.tsx": "Modal for editing an existing task, preloading task data and submitting updates through updateTask mutation.",
  "frontend/src/components/territories/AddTerritoryModal.tsx": "Modal for adding a territory with number and type fields, basic validation, and createTerritory mutation.",
  "frontend/src/components/territories/CheckoutHistoryTable.tsx": "Table displaying sorted territory checkout history with optional edit actions and formatted dates.",
  "frontend/src/components/territories/CheckOutTerritoryModal.tsx": "Modal for checking out a territory by selecting a publisher and campaign flag, submitting via checkOutTerritory mutation.",
  "frontend/src/components/territories/DeleteTerritoryNoteDialog.tsx": "Confirmation dialog that deletes a territory note using a mutation and shows success or error toasts.",
  "frontend/src/components/territories/EditCheckoutRecordModal.tsx": "Modal for editing a checkout record, handling publisher selection, date conversion, validation, and submitting updates.",
  "frontend/src/components/territories/EditTerritoryModal.tsx": "Modal for editing a territory’s number and type with validation and update mutation.",
  "frontend/src/components/territories/EditTerritoryNoteModal.tsx": "Modal for editing a territory note's content and submitting the update.",
  "frontend/src/components/territories/TerritoryNoteCard.tsx": "Card displaying a territory note with edit and delete action buttons.",
  "frontend/src/components/territories/TerritoryNotesSection.tsx": "Section for creating, listing, editing, and deleting territory notes, including composer and modals.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages the backend actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useAddPublisher.ts": "Hook to add a new publisher, mapping UI privilege selections and invalidating publisher queries on success.",
  "frontend/src/hooks/useCheckOutTerritory.ts": "Hook to check out a territory to a publisher and invalidate related queries on success.",
  "frontend/src/hooks/useCreateGlobalNote.ts": "Hook for creating global notes with validation and invalidating global notes queries afterward.",
  "frontend/src/hooks/useCreatePioneer.ts": "Provides a mutation to create a pioneer and invalidates the pioneers list on success.",
  "frontend/src/hooks/useCreateShepherdingVisit.ts": "Creates a shepherding visit via mutation and refreshes the shepherdingVisits query afterward.",
  "frontend/src/hooks/useCreateTask.ts": "Builds a CreateTaskInput from params, creates a task, and invalidates all task queries.",
  "frontend/src/hooks/useCreateTerritory.ts": "Generates an ID, creates a territory through the actor, and invalidates the territories query.",
  "frontend/src/hooks/useCreateTrainedConductor.ts": "Adds a trained conductor, invalidates trainedConductors, and shows toast notifications.",
  "frontend/src/hooks/useCreateTrainedPublisher.ts": "Creates a trained publisher, invalidates trainedPublishers, and displays toast messages.",
  "frontend/src/hooks/useDeleteGlobalNote.ts": "Deletes a global note by ID and invalidates the globalNotes query.",
  "frontend/src/hooks/useDeletePioneer.ts": "Deletes a pioneer and invalidates the pioneers query.",
  "frontend/src/hooks/useDeletePublisher.ts": "Deletes a publisher with optimistic updates and refetches the publishers list.",
  "frontend/src/hooks/useDeleteTask.ts": "Deletes a task by ID and invalidates all task queries.",
  "frontend/src/hooks/useDeleteTrainedConductor.ts": "Deletes a trained conductor, invalidates trainedConductors, and shows toast messages.",
  "frontend/src/hooks/useDeleteTrainedPublisher.ts": "Deletes a trained publisher, invalidates trainedPublishers, and shows toast notifications.",
  "frontend/src/hooks/useGlobalNotes.ts": "Provides queries for fetching all global notes or a specific global note by ID.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context/provider and hook for login, logout, and identity state management.",
  "frontend/src/hooks/usePioneers.ts": "Fetches all pioneers using react-query.",
  "frontend/src/hooks/usePublisherNotes.ts": "Empty placeholder file with no implementation.",
  "frontend/src/hooks/useQueries.ts": "Provides queries to fetch all publishers or a specific publisher by ID.",
  "frontend/src/hooks/useServiceMeetingConductors.ts": "Fetches all service meeting conductor assignments.",
  "frontend/src/hooks/useShepherdingVisit.ts": "Gets, updates, or deletes a single shepherding visit with appropriate cache invalidation.",
  "frontend/src/hooks/useShepherdingVisits.ts": "Fetches all shepherding visits.",
  "frontend/src/hooks/useTasks.ts": "Queries tasks filtered by status or fetches a single task by ID.",
  "frontend/src/hooks/useTerritories.ts": "Fetches all territories.",
  "frontend/src/hooks/useTerritory.ts": "React Query hooks for fetching, updating, deleting, and changing status of territories, with cache invalidation.",
  "frontend/src/hooks/useTerritoryNotes.ts": "Hooks to fetch and mutate territory notes, invalidating note queries after changes.",
  "frontend/src/hooks/useTrainedConductors.ts": "Fetches all trained service meeting conductors via React Query.",
  "frontend/src/hooks/useTrainedPublishers.ts": "Fetches all trained publishers using React Query.",
  "frontend/src/hooks/useUpdateCheckoutRecord.ts": "Mutation hook to update a territory checkout record and refresh related queries.",
  "frontend/src/hooks/useUpdateGlobalNote.ts": "Updates a global note and invalidates the global notes query.",
  "frontend/src/hooks/useUpdatePioneer.ts": "Updates a pioneer record and refreshes the pioneers list.",
  "frontend/src/hooks/useUpdatePublisher.ts": "Updates a publisher's details and privileges, then invalidates the publishers list.",
  "frontend/src/hooks/useUpdateTask.ts": "Updates a task and invalidates all task queries.",
  "frontend/src/hooks/useUpdateTaskCompletion.ts": "Updates task completion status and refreshes all task queries.",
  "frontend/src/hooks/useUpdateTrainedConductor.ts": "Mutates trained conductor data with toast feedback and query invalidation.",
  "frontend/src/hooks/useUpdateTrainedPublisher.ts": "Updates trained publisher data with toast notifications and cache invalidation.",
  "frontend/src/index.css": "Tailwind setup defining theme colors, dark mode variables, and custom utilities.",
  "frontend/src/main.tsx": "App entry configuring React Query and Internet Identity provider before rendering App.",
  "frontend/src/pages/ComingSoon.tsx": "UI component displaying a placeholder page for upcoming features.",
  "frontend/src/pages/Dashboard.tsx": "Dashboard page aggregating publisher, territory, and task stats with loading states.",
  "frontend/src/pages/FieldServiceGroupProfile.tsx": "Displays details for a specific field service group, including overseer, assistant, and sorted publishers, with validation and loading states.",
  "frontend/src/pages/FieldServiceGroups.tsx": "Lists all field service groups with their overseer, assistant, and active publishers, linking to individual group profiles.",
  "frontend/src/pages/Login.tsx": "Provides a login page using Internet Identity with a styled authentication button and loading state.",
  "frontend/src/pages/Notes.tsx": "Manages global notes with category filtering, sorting, add/edit/delete modals, and publisher name resolution.",
  "frontend/src/pages/Pioneers.tsx": "Displays a table of pioneers with add, edit, and delete functionality, including sorted listing and modal management.",
  "frontend/src/pages/PublicWitnessing.tsx": "Shows trained publishers for public witnessing with sorting, add/edit/delete controls, and authorization status.",
  "frontend/src/pages/PublisherProfile.tsx": "Displays a single publisher’s profile with privilege badges and supports editing or deleting the record.",
  "frontend/src/pages/Publishers.tsx": "Lists all publishers with search and filtering, and provides add, edit, and delete actions.",
  "frontend/src/pages/ServiceMeetingConductors.tsx": "Shows trained conductors in a sortable table and supports adding, editing, and deleting conductor records.",
  "frontend/src/pages/Shepherding.tsx": "Lists shepherding visits with search, sorting, and actions to record, edit, or delete visits.",
  "frontend/src/pages/ShepherdingVisitProfile.tsx": "Displays details for a single shepherding visit, allowing note editing, visit editing, and deletion.",
  "frontend/src/pages/Tasks.tsx": "Tasks page with filtering, add/edit/delete modals, and hooks for fetching and mutating tasks.",
  "frontend/src/pages/Territories.tsx": "Lists territories with status coloring, checkout duration logic, highlight rules, and add-territory modal.",
  "frontend/src/pages/TerritoryProfile.tsx": "Displays a single territory with edit/delete, checkout management, status actions, and history components.",
  "frontend/src/utils/formatters.ts": "Utility functions for converting backend timestamps to formatted date strings across multiple data types.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, storing, and clearing URL and session parameters including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, layout, animations, and integrating plugins for typography and container queries.",
  "project_state.json": "Describes the project's current dashboard-related requirements, including how stats must be computed from publisher, territory, and task backends. Lists existing features, architectural notes, and pending feature requests for the dashboard."
}