{
  "backend/main.mo": "Actor managing user profiles and publisher records with CRUD operations and authorization checks.",
  "backend/migration.mo": "Migration module converting old actor state to new format by adding an empty serviceMeetingConductors map.",
  "feature_evidence.json": "Feature evidence report describing requirements, affected files, components, and test IDs for multiple frontend features.",
  "frontend-file-summaries.txt": "JSON mapping of frontend file paths to short textual summaries of their functionality.",
  "frontend/.env": "Sets the Internet Identity provider URL for authentication.",
  "frontend/index.css": "Global Tailwind-based style definitions including color tokens and dark mode variables.",
  "frontend/index.html": "HTML entry point loading the main React application script.",
  "frontend/src/App.tsx": "Main application router defining authentication flow and routes including the Service Meeting Conductors page.",
  "frontend/src/components/layout/AppLayout.tsx": "Layout component containing header, sidebar, routed content, and toaster notifications.",
  "frontend/src/components/layout/Header.tsx": "Header bar showing app title, mobile menu button, and logout functionality.",
  "frontend/src/components/layout/Sidebar.tsx": "Responsive sidebar component rendering navigation links with active-state styling and mobile toggle behavior.",
  "frontend/src/components/notes/AddGlobalNoteModal.tsx": "Modal form for creating or editing global notes with validation, publisher attachment, and API mutation handling.",
  "frontend/src/components/notes/GlobalNoteCard.tsx": "Card UI that displays a global note preview with category badge, attached publisher, date, and edit/delete actions.",
  "frontend/src/components/pioneers/AddPioneerModal.tsx": "Modal for adding a pioneer record by selecting an active publisher and service year, submitting via mutation.",
  "frontend/src/components/pioneers/DeletePioneerDialog.tsx": "Confirmation dialog for deleting a pioneer record, triggering a delete mutation with success/error toasts.",
  "frontend/src/components/pioneers/EditPioneerModal.tsx": "Modal for editing an existing pioneer, pre-filling fields and submitting updates through a mutation.",
  "frontend/src/components/publishers/AddPublisherModal.tsx": "Modal form for creating a publisher, handling validation, mutations, and form state reset.",
  "frontend/src/components/publishers/DeletePublisherNoteDialog.tsx": "Empty placeholder file for a dialog to delete a publisher note.",
  "frontend/src/components/publishers/EditPublisherModal.tsx": "Modal for editing an existing publisher, preloading values and submitting updates via mutation.",
  "frontend/src/components/publishers/EditPublisherNoteModal.tsx": "Empty placeholder file for a modal to edit a publisher note.",
  "frontend/src/components/publishers/PublisherNoteCard.tsx": "Empty placeholder file for a UI card displaying a publisher note.",
  "frontend/src/components/publishers/PublisherNotesSection.tsx": "Empty placeholder file for a section listing publisher notes.",
  "frontend/src/components/shepherding/EditShepherdingVisitModal.tsx": "Modal for editing a shepherding visit, initializing fields from existing data and submitting updates after validation.",
  "frontend/src/components/shepherding/RecordVisitModal.tsx": "Modal for recording a new shepherding visit, validating required fields and creating the visit via mutation.",
  "frontend/src/components/tasks/AddTaskModal.tsx": "Modal for adding a task with title, due date, category, and notes, including validation and mutation handling.",
  "frontend/src/components/tasks/EditTaskModal.tsx": "Modal form for editing a task, preloading task data and submitting updates via useUpdateTask.",
  "frontend/src/components/territories/AddTerritoryModal.tsx": "Modal to create a new territory with number and type validation and submit via useCreateTerritory.",
  "frontend/src/components/territories/CheckoutHistoryTable.tsx": "Displays sorted checkout history records in a table with optional edit actions.",
  "frontend/src/components/territories/CheckOutTerritoryModal.tsx": "Modal for checking out a territory to a selected publisher, with campaign option and submission via useCheckOutTerritory.",
  "frontend/src/components/territories/DeleteTerritoryNoteDialog.tsx": "Confirmation dialog to delete a territory note using useDeleteTerritoryNote.",
  "frontend/src/components/territories/EditCheckoutRecordModal.tsx": "Modal to edit an existing checkout record, prefilled from the record and submitted via useUpdateCheckoutRecord.",
  "frontend/src/components/territories/EditTerritoryModal.tsx": "Modal form for editing a territory's number and type, with validation and update mutation.",
  "frontend/src/components/territories/EditTerritoryNoteModal.tsx": "Modal for editing an existing territory note, saving updates through a mutation.",
  "frontend/src/components/territories/TerritoryNoteCard.tsx": "Displays a single territory note with its date and edit/delete buttons.",
  "frontend/src/components/territories/TerritoryNotesSection.tsx": "Manages creating, listing, sorting, editing, and deleting notes for a territory.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on authentication, invalidating dependent queries when it changes.",
  "frontend/src/hooks/useAddPublisher.ts": "Mutation hook to add a publisher, mapping UI privilege selections to backend format and refreshing publisher data.",
  "frontend/src/hooks/useCheckOutTerritory.ts": "Mutation hook for checking out a territory to a publisher and refreshing relevant territory queries.",
  "frontend/src/hooks/useCreateGlobalNote.ts": "Mutation hook for creating a global note with validation and cache invalidation.",
  "frontend/src/hooks/useCreatePioneer.ts": "Mutation hook for creating a pioneer and invalidating the pioneers list.",
  "frontend/src/hooks/useCreateShepherdingVisit.ts": "Mutation hook for creating a shepherding visit and refreshing visit data.",
  "frontend/src/hooks/useCreateTask.ts": "Mutation hook for creating a task with structured input and invalidating task queries.",
  "frontend/src/hooks/useCreateTerritory.ts": "Creates a new territory with a generated ID and invalidates the territories list.",
  "frontend/src/hooks/useDeleteGlobalNote.ts": "Mutation hook to delete a global note and refresh global note queries.",
  "frontend/src/hooks/useDeletePioneer.ts": "Mutation hook to delete a pioneer and refresh the pioneers list.",
  "frontend/src/hooks/useDeletePublisher.ts": "Provides a mutation to delete a publisher with optimistic cache updates and error rollback.",
  "frontend/src/hooks/useDeleteTask.ts": "Creates a mutation to delete a task and invalidate all task queries.",
  "frontend/src/hooks/useGlobalNotes.ts": "Defines queries to fetch all global notes or a single note by ID via the actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context provider and hook for login, logout, and identity management.",
  "frontend/src/hooks/usePioneers.ts": "Provides a query to fetch all pioneers from the backend actor.",
  "frontend/src/hooks/usePublisherNotes.ts": "Empty file with no implementation.",
  "frontend/src/hooks/useQueries.ts": "Contains queries for fetching all publishers or a single publisher by ID.",
  "frontend/src/hooks/useServiceMeetingConductors.ts": "Exposes a query to load all service meeting conductor assignments.",
  "frontend/src/hooks/useShepherdingVisit.ts": "Implements queries and mutations for fetching, updating, and deleting single shepherding visits.",
  "frontend/src/hooks/useShepherdingVisits.ts": "Provides a query to fetch all shepherding visits.",
  "frontend/src/hooks/useTasks.ts": "Contains queries for tasks filtered by status and for fetching a single task by ID.",
  "frontend/src/hooks/useTerritories.ts": "Provides a query to fetch all territories.",
  "frontend/src/hooks/useTerritory.ts": "Defines queries and mutations for fetching, updating, deleting, and changing availability of a single territory.",
  "frontend/src/hooks/useTerritoryNotes.ts": "Implements queries and mutations for CRUD operations on territory notes tied to a territory ID.",
  "frontend/src/hooks/useUpdateCheckoutRecord.ts": "Provides a mutation to update a territory checkout record and invalidate related queries.",
  "frontend/src/hooks/useUpdateGlobalNote.ts": "Creates a mutation to update a global note and refresh global notes cache.",
  "frontend/src/hooks/useUpdatePioneer.ts": "Defines a mutation to update a pioneer and invalidate the pioneers list.",
  "frontend/src/hooks/useUpdatePublisher.ts": "Provides a mutation hook to update a publisher and invalidate the publishers list. Maps UI privilege options to backend privilege flags.",
  "frontend/src/hooks/useUpdateTask.ts": "Defines a mutation hook for updating tasks and invalidating all task queries. Calls the backend actor’s updateTask method.",
  "frontend/src/hooks/useUpdateTaskCompletion.ts": "Mutation hook to toggle task completion status and refresh task data. Wraps actor.updateTaskCompletion.",
  "frontend/src/index.css": "Sets up Tailwind base styles and custom CSS variables including theme colors and Theiarco-specific utilities. Adds light and dark mode color definitions.",
  "frontend/src/main.tsx": "Initializes React app with React Query and Internet Identity providers. Renders the root App component and imports global styles.",
  "frontend/src/pages/ComingSoon.tsx": "Simple placeholder page showing a coming soon message with icon and title. Used for unfinished features.",
  "frontend/src/pages/Login.tsx": "Login page using Internet Identity authentication with styled UI elements. Displays a login button and app branding.",
  "frontend/src/pages/Notes.tsx": "Notes management page with filtering, sorting, adding, editing, and deleting global notes. Uses multiple hooks and dialogs to manage note interactions.",
  "frontend/src/pages/Pioneers.tsx": "Lists pioneers with add, edit, and delete functionality through modals and dialogs. Loads pioneer and publisher data and shows a sortable table.",
  "frontend/src/pages/PublisherProfile.tsx": "Displays detailed info for a single publisher with edit and delete actions. Fetches publisher data, shows badges, and handles navigation and dialogs.",
  "frontend/src/pages/Publishers.tsx": "Manages listing, filtering, adding, editing, and deleting publishers with modals and search/group filters.",
  "frontend/src/pages/ServiceMeetingConductors.tsx": "Displays assigned service meeting conductors with loading and empty states and a placeholder for assignment actions.",
  "frontend/src/pages/Shepherding.tsx": "Shows, filters, sorts, records, edits, and deletes shepherding visits with modals and search filtering.",
  "frontend/src/pages/ShepherdingVisitProfile.tsx": "Displays a single shepherding visit profile with note editing, visit editing, and delete functionality.",
  "frontend/src/pages/Tasks.tsx": "Lists tasks with filtering, completion toggling, and modals for adding, editing, and deleting tasks.",
  "frontend/src/pages/Territories.tsx": "Shows territories with status coloring, checkout duration logic, highlighting overdue checkouts, and a modal for adding new territories.",
  "frontend/src/pages/TerritoryProfile.tsx": "Territory detail page handling territory fetch, edit, delete, checkout actions, and rendering notes and history components.",
  "frontend/src/utils/formatters.ts": "Utility functions that convert backend bigint timestamps (nanoseconds or seconds) into formatted date strings.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading URL parameters, persisting them in sessionStorage, and managing hash-based query values.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state file describing planned and existing features for the Service Meeting Conductors functionality and backend domain."
}