{
  "backend/main.mo": "Motoko canister defining user profiles and publisher management with access control, including CRUD operations for publishers and permission-checked queries and updates.",
  "feature_evidence.json": "Machine-readable report mapping implemented frontend features to files, components, test requirements, and confidence levels for publisher profile routing and UI work.",
  "frontend-file-summaries.txt": "Prewritten JSON-style summaries describing the purpose of all major frontend files, components, hooks, pages, and configuration used in the application.",
  "frontend/.env": "Environment configuration file specifying the Internet Identity provider URL used for authentication.",
  "frontend/index.css": "Global Tailwind CSS setup defining base styles, light and dark theme color tokens using OKLCH, and shared layout variables.",
  "frontend/index.html": "Base HTML entry point that defines the root container and loads the React application bundle.",
  "frontend/src/App.tsx": "Main React application file that sets up authentication-aware routing with TanStack Router, including protected routes and the publisher profile route.",
  "frontend/src/components/layout/AppLayout.tsx": "Authenticated application shell combining sidebar, header, routed page outlet, and toast notifications with responsive layout handling.",
  "frontend/src/components/layout/Header.tsx": "Top navigation header displaying the app title, mobile menu toggle, and logout button that clears authentication and cached queries.",
  "frontend/src/components/layout/Sidebar.tsx": "Implements a responsive navigation sidebar with links, icons, active route highlighting, and mobile toggle behavior using TanStack Router and UI components.",
  "frontend/src/components/publishers/AddPublisherModal.tsx": "Modal dialog with a form to create a new publisher, handling validation, submission via useAddPublisher, success/error toasts, and form reset on close.",
  "frontend/src/components/publishers/EditPublisherModal.tsx": "Modal dialog for editing an existing publisher, pre-filling form state from props, mapping backend privileges to UI options, and updating via useUpdatePublisher with toasts.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and caches a backend actor based on the current Internet Identity, initializes access control, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useAddPublisher.ts": "Mutation hook that maps UI privilege selections to backend format and calls actor.addPublisher, invalidating the publishers query on success.",
  "frontend/src/hooks/useDeletePublisher.ts": "Mutation hook to delete a publisher with optimistic cache updates, rollback on error, toast notifications, and publishers query invalidation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing AuthClient creation, login/logout, identity persistence, and detailed login status flags.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching all publishers or a single publisher from the backend actor, enabled only when the actor is ready.",
  "frontend/src/hooks/useUpdatePublisher.ts": "Defines a React Query mutation hook to update a publisher via the backend actor, mapping UI privilege selections to backend privilege flags and invalidating the publishers query on success.",
  "frontend/src/index.css": "Configures Tailwind base styles, CSS variables for light/dark themes, custom Theiarco colors, and utility classes using OKLCH color space.",
  "frontend/src/main.tsx": "Application entry point that renders the App component wrapped with React Query and Internet Identity providers and imports global styles.",
  "frontend/src/pages/ComingSoon.tsx": "Reusable page component that displays a centered \"Coming Soon\" message with an icon and title for unfinished features.",
  "frontend/src/pages/Login.tsx": "Login page that uses Internet Identity authentication and renders a styled login button with loading state.",
  "frontend/src/pages/PublisherProfile.tsx": "Displays detailed information for a single publisher, fetching data by ID, handling loading/error states, and showing privileges and responsibilities.",
  "frontend/src/pages/Publishers.tsx": "Main publishers list page with filtering, search, add/edit/delete actions, navigation to profiles, and table-based display of publisher data.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading URL parameters from query strings or hash routes and persisting them in sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, custom colors tied to CSS variables, animations, container settings, and plugins.",
  "project_state.json": "Project metadata describing an ICP dapp with a Motoko backend and React (Vite) frontend, including authentication via Internet Identity and an authenticated dashboard shell. It enumerates implemented features such as RBAC, user profiles, and publisher management APIs and UI workflows."
}