{
  "backend/main.mo": "Main Motoko actor handling access control, user profiles, and CRUD operations for publishers with authorization checks.",
  "feature_evidence.json": "Feature evidence report listing dashboard alert requirements and associated frontend file dependencies.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend files including pages, hooks, and components.",
  "frontend/.env": "Environment config defining the Internet Identity provider URL.",
  "frontend/index.css": "Global stylesheet defining Tailwind layers and extensive OKLCH color variables for light and dark themes.",
  "frontend/index.html": "Base HTML file loading the root React application.",
  "frontend/src/App.tsx": "Main React routing setup handling authentication and defining all application routes.",
  "frontend/src/components/conductors/ConductorModal.tsx": "Modal form for creating and editing trained conductors with publisher selection and availability fields.",
  "frontend/src/components/conductors/DeleteConductorDialog.tsx": "Confirmation dialog for deleting a trained conductor with pending‑state handling.",
  "frontend/src/components/layout/AppLayout.tsx": "Main layout component with sidebar, header, outlet for routes, and global toast notifications.",
  "frontend/src/components/layout/Header.tsx": "Header bar showing app title and logout button with mobile menu toggle.",
  "frontend/src/components/layout/Sidebar.tsx": "Responsive navigation sidebar with route links, active state handling, and mobile overlay.",
  "frontend/src/components/notes/AddGlobalNoteModal.tsx": "Modal for creating or editing global notes with category and optional publisher attachment.",
  "frontend/src/components/notes/GlobalNoteCard.tsx": "Card displaying note title, category badge, preview text, date, and edit/delete actions.",
  "frontend/src/components/pioneers/AddPioneerModal.tsx": "Modal for adding a pioneer by selecting an active publisher and service year.",
  "frontend/src/components/pioneers/DeletePioneerDialog.tsx": "Confirmation dialog for deleting a pioneer record with toast feedback.",
  "frontend/src/components/pioneers/EditPioneerModal.tsx": "Modal for editing a pioneer’s publisher and service year with prefilled data.",
  "frontend/src/components/publicWitnessing/DeleteTrainedPublisherDialog.tsx": "Confirmation dialog that deletes a trained publisher using a mutation and closes on success.",
  "frontend/src/components/publicWitnessing/TrainedPublisherModal.tsx": "Modal for creating or editing a trained publisher, handling form state, validation, and save mutations.",
  "frontend/src/components/publishers/AddPublisherModal.tsx": "Form modal for adding a new publisher with validation, privilege selection, and success/error toasts.",
  "frontend/src/components/publishers/DeletePublisherNoteDialog.tsx": "Empty placeholder file for deleting a publisher note.",
  "frontend/src/components/publishers/EditPublisherModal.tsx": "Modal for editing an existing publisher, pre-filling fields and submitting updates via mutation.",
  "frontend/src/components/publishers/EditPublisherNoteModal.tsx": "Empty placeholder file for editing a publisher note.",
  "frontend/src/components/publishers/PublisherNoteCard.tsx": "Empty placeholder file for displaying an individual publisher note.",
  "frontend/src/components/publishers/PublisherNotesSection.tsx": "Empty placeholder file for listing or managing publisher notes.",
  "frontend/src/components/shepherding/EditShepherdingVisitModal.tsx": "Modal that loads an existing shepherding visit, validates input, and updates it via mutation.",
  "frontend/src/components/shepherding/RecordVisitModal.tsx": "Modal for recording a new shepherding visit with validation and submit handling.",
  "frontend/src/components/tasks/AddTaskModal.tsx": "Modal form for creating a task with title, due date, category, notes, validation, and mutation submission.",
  "frontend/src/components/tasks/EditTaskModal.tsx": "Modal for editing an existing task, preloading task data, validating input, and submitting an update mutation.",
  "frontend/src/components/territories/AddTerritoryModal.tsx": "Modal for adding a new territory with number and type fields, validation, and createTerritory mutation.",
  "frontend/src/components/territories/CheckoutHistoryTable.tsx": "Table displaying sorted territory checkout records with dates, campaign status, and optional edit actions.",
  "frontend/src/components/territories/CheckOutTerritoryModal.tsx": "Modal to check out a territory by selecting a publisher and optional campaign flag, submitting via mutation.",
  "frontend/src/components/territories/DeleteTerritoryNoteDialog.tsx": "Confirmation dialog for deleting a territory note using a delete mutation with success/error toasts.",
  "frontend/src/components/territories/EditCheckoutRecordModal.tsx": "Modal for editing a territory checkout record, handling date conversions, form state, validation, and update mutation.",
  "frontend/src/components/territories/EditTerritoryModal.tsx": "Modal for editing a territory’s number and type with validation and update mutation.",
  "frontend/src/components/territories/EditTerritoryNoteModal.tsx": "Modal for editing a single territory note and saving changes via a mutation.",
  "frontend/src/components/territories/TerritoryNoteCard.tsx": "Card component displaying a territory note with edit and delete actions.",
  "frontend/src/components/territories/TerritoryNotesSection.tsx": "Section for creating, listing, sorting, editing, and deleting territory notes.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages the backend actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useAddPublisher.ts": "Mutation hook for adding a publisher and mapping privilege selections to backend format.",
  "frontend/src/hooks/useCheckOutTerritory.ts": "Mutation hook to check out a territory and invalidate related queries on success.",
  "frontend/src/hooks/useCreateGlobalNote.ts": "Mutation hook for creating global notes with validation and publisher attachment logic.",
  "frontend/src/hooks/useCreatePioneer.ts": "Mutation hook for creating a pioneer and invalidating the pioneers list.",
  "frontend/src/hooks/useCreateShepherdingVisit.ts": "Mutation hook for creating shepherding visits and refreshing the visits list.",
  "frontend/src/hooks/useCreateTask.ts": "Provides a mutation to create a task through the actor and invalidates the tasks query on success.",
  "frontend/src/hooks/useCreateTerritory.ts": "Creates a territory with a generated ID and refreshes the territories list after success.",
  "frontend/src/hooks/useCreateTrainedConductor.ts": "Adds a trained conductor via actor, invalidates related queries, and shows toast notifications.",
  "frontend/src/hooks/useCreateTrainedPublisher.ts": "Adds a trained publisher and refreshes the list with success and error toasts.",
  "frontend/src/hooks/useDeleteGlobalNote.ts": "Deletes a global note and invalidates the globalNotes query.",
  "frontend/src/hooks/useDeletePioneer.ts": "Deletes a pioneer and refreshes the pioneers list.",
  "frontend/src/hooks/useDeletePublisher.ts": "Deletes a publisher with optimistic updates and error rollback, then refetches publishers.",
  "frontend/src/hooks/useDeleteTask.ts": "Deletes a task and triggers tasks refetch.",
  "frontend/src/hooks/useDeleteTrainedConductor.ts": "Deletes a trained conductor with success/error toasts and invalidates the list.",
  "frontend/src/hooks/useDeleteTrainedPublisher.ts": "Deletes a trained publisher and refreshes its list with toast feedback.",
  "frontend/src/hooks/useGlobalNotes.ts": "Provides queries to fetch all global notes or a specific note by ID.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity auth state, providing login, logout, and identity context.",
  "frontend/src/hooks/usePioneers.ts": "Fetches the full list of pioneers from the actor.",
  "frontend/src/hooks/usePublisherNotes.ts": "Empty file with no implemented logic.",
  "frontend/src/hooks/useQueries.ts": "Provides queries to fetch all publishers or a single publisher by ID.",
  "frontend/src/hooks/useServiceMeetingConductors.ts": "Fetches all service meeting conductor assignments.",
  "frontend/src/hooks/useShepherdingVisit.ts": "Provides queries and mutations for fetching, updating, and deleting individual shepherding visits.",
  "frontend/src/hooks/useShepherdingVisits.ts": "Fetches all shepherding visits.",
  "frontend/src/hooks/useTasks.ts": "Fetches tasks filtered by status or a single task by ID.",
  "frontend/src/hooks/useTerritories.ts": "Fetches all territories from the actor.",
  "frontend/src/hooks/useTerritory.ts": "Provides queries and mutations for retrieving, updating, deleting, and marking territories returned or available.",
  "frontend/src/hooks/useTerritoryNotes.ts": "Provides React Query hooks to fetch and mutate territory notes with automatic cache invalidation.",
  "frontend/src/hooks/useTrainedConductors.ts": "Fetches all trained service meeting conductors using React Query.",
  "frontend/src/hooks/useTrainedPublishers.ts": "Fetches all trained publishers via a simple React Query hook.",
  "frontend/src/hooks/useUpdateCheckoutRecord.ts": "Mutation hook to update a territory checkout record and invalidate related territory queries.",
  "frontend/src/hooks/useUpdateGlobalNote.ts": "Updates a global note and refreshes the global notes query cache.",
  "frontend/src/hooks/useUpdatePioneer.ts": "Mutation for editing a pioneer and invalidating the pioneers list.",
  "frontend/src/hooks/useUpdatePublisher.ts": "Updates publisher details, maps privileges, and invalidates the publishers list.",
  "frontend/src/hooks/useUpdateTask.ts": "Updates a task and triggers refetch of all task-related queries.",
  "frontend/src/hooks/useUpdateTaskCompletion.ts": "Toggles task completion status and invalidates task queries.",
  "frontend/src/hooks/useUpdateTrainedConductor.ts": "Updates a trained conductor with success/error toasts and cache invalidation.",
  "frontend/src/hooks/useUpdateTrainedPublisher.ts": "Updates a trained publisher and shows status toasts while invalidating queries.",
  "frontend/src/index.css": "Tailwind base setup defining light/dark theme variables and custom utility classes.",
  "frontend/src/main.tsx": "App entry point setting up React, React Query, Internet Identity, and global styles.",
  "frontend/src/pages/ComingSoon.tsx": "Simple placeholder page showing a construction icon and coming‑soon message.",
  "frontend/src/pages/Dashboard.tsx": "Dashboard page computing and displaying stats for publishers, territories, tasks, and shepherding visits.",
  "frontend/src/pages/FieldServiceGroupProfile.tsx": "Displays details for a field service group, including leadership and sorted member list.",
  "frontend/src/pages/FieldServiceGroups.tsx": "Displays field service groups with overseers, assistants, and sorted active publishers fetched from queries.",
  "frontend/src/pages/Login.tsx": "Renders a login screen using Internet Identity with a loading state and styled button.",
  "frontend/src/pages/Notes.tsx": "Manages global notes with category filtering, add/edit/delete modals, and sorted note display.",
  "frontend/src/pages/Pioneers.tsx": "Shows a sortable pioneers table with add, edit, and delete modals tied to publisher data.",
  "frontend/src/pages/PublicWitnessing.tsx": "Lists trained publishers with sorting, authorization labels, and modals for adding, editing, and deleting.",
  "frontend/src/pages/PublisherProfile.tsx": "Displays a publisher’s details with privilege badges and supports editing or deleting the profile.",
  "frontend/src/pages/Publishers.tsx": "Displays a publishers list with filtering, plus add, edit, and delete modals tied to query and mutation hooks.",
  "frontend/src/pages/ServiceMeetingConductors.tsx": "Shows trained conductors in a sortable table with add, edit, and delete dialogs.",
  "frontend/src/pages/Shepherding.tsx": "Manages shepherding visits with search, sorting, record/edit modals, and delete confirmation.",
  "frontend/src/pages/ShepherdingVisitProfile.tsx": "Displays a single shepherding visit with notes editing, visit editing, and delete actions.",
  "frontend/src/pages/Tasks.tsx": "Lists tasks with filtering, completion toggling, and add/edit/delete modals integrated with task APIs.",
  "frontend/src/pages/Territories.tsx": "Displays a territories list with status-based styling, checkout duration logic, and an add-territory modal trigger.",
  "frontend/src/pages/TerritoryProfile.tsx": "Shows detailed territory info with editing, checkout management, delete confirmation, and history display.",
  "frontend/src/utils/formatters.ts": "Provides timestamp formatting helpers for notes, tasks, checkouts, visits, weeks, and training dates.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, animations, containers, and theme tokens with custom plugins.",
  "project_state.json": "Project metadata describing the dashboard alerts feature, requirements, and current state."
}