{
  "backend/main.mo": "Motoko canister implementing access-controlled user profiles and publisher management, including CRUD-style operations and role-based authorization for users and admins.",
  "feature_evidence.json": "Feature evidence report documenting build/deployment retry behavior and error-capture workflows, mapping features to files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Pre-generated summary map describing the purpose of all major frontend files, components, hooks, pages, and configuration used in the application.",
  "frontend/.env": "Frontend environment configuration defining the Internet Identity provider URL for Vite-based builds.",
  "frontend/index.css": "Global Tailwind CSS setup defining light and dark theme design tokens using the OKLCH color system and base layout styles.",
  "frontend/index.html": "HTML entry point for the Vite React app that mounts the root element and loads the main TypeScript module.",
  "frontend/src/App.tsx": "Main application and routing setup using TanStack Router, handling authentication state, error handling, and defining all protected routes.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary that catches runtime exceptions, logs them, and renders a user-friendly fallback UI with error details and reload support.",
  "frontend/src/components/layout/AppLayout.tsx": "Authenticated application shell that composes the sidebar, header, routed page outlet, and global toast notifications.",
  "frontend/src/components/layout/Header.tsx": "Top navigation header displaying the app title, mobile menu toggle, and logout action that clears authentication and cached queries.",
  "frontend/src/components/layout/Sidebar.tsx": "Responsive, collapsible navigation sidebar listing all application routes with icons, active-state styling, and mobile behavior.",
  "frontend/src/components/publishers/AddPublisherModal.tsx": "Modal dialog component with a form to add a new publisher, managing local form state, validation, and submission via the useAddPublisher hook with success/error toasts.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and caches a backend actor based on the current Internet Identity, initializing access control and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useAddPublisher.ts": "Mutation hook that maps UI privilege selections to backend format and calls the actor’s addPublisher method, invalidating the publishers query on success.",
  "frontend/src/hooks/useInternetIdentity.ts": "Authentication context and provider for Internet Identity, handling login/logout, identity persistence, and exposing login status flags to the app.",
  "frontend/src/hooks/useQueries.ts": "Collection of data-fetching hooks, currently providing a useGetAllPublishers query that retrieves all publishers from the backend actor.",
  "frontend/src/index.css": "Global Tailwind CSS setup defining theme variables, light/dark color palettes, custom Theiarco colors, and utility classes.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/pages/ComingSoon.tsx": "Simple presentational page showing a centered \"Coming Soon\" message with an icon and title for unfinished features.",
  "frontend/src/pages/Login.tsx": "Login page UI that triggers Internet Identity authentication and shows a loading state while logging in.",
  "frontend/src/pages/Publishers.tsx": "Publishers management page that lists publishers in a table, shows loading/empty states, and opens the AddPublisherModal to create new publishers.",
  "frontend/src/utils/urlParams.ts": "Provides utilities to read URL parameters from query strings or hash-based routes, persist them in sessionStorage, and retrieve or clear them across navigation. Includes helpers to prioritize URL values, fall back to session storage, and safely manage sensitive parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode behavior, content paths, container settings, and an extended theme with custom OKLCH-based colors, radii, shadows, and animations. Integrates typography, container queries, and animation plugins.",
  "project_state.json": "Tracks the overall project state, schema/versioning, and a structured list of existing features covering the Motoko backend, authorization, React/Tailwind frontend, authentication, UI layout, build/deploy templates, and initial Publishers functionality."
}