{
  "backend/main.mo": "Motoko backend actor managing user profiles and publishers with permission checks and CRUD operations.",
  "feature_evidence.json": "Feature evidence report listing feature requirements, associated files, components, and test mappings.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for various frontend project files.",
  "frontend/.env": "Environment config setting the Internet Identity provider URL.",
  "frontend/index.css": "Tailwind base and theme variable definitions for light and dark mode styling.",
  "frontend/index.html": "Basic HTML entry point that loads the React application root.",
  "frontend/src/App.tsx": "Main router setup and auth gate integrating all app routes including shepherding visit profile.",
  "frontend/src/components/layout/AppLayout.tsx": "Layout component combining header, sidebar, page outlet, and toast system.",
  "frontend/src/components/layout/Header.tsx": "Header with app title, mobile menu toggle, and logout functionality clearing auth and cache.",
  "frontend/src/components/layout/Sidebar.tsx": "Responsive sidebar with navigation links, mobile toggle behavior, and footer branding.",
  "frontend/src/components/notes/AddGlobalNoteModal.tsx": "Modal for creating or editing global notes with validation, publisher attachment, and mutation handling.",
  "frontend/src/components/notes/GlobalNoteCard.tsx": "Card UI displaying a global note with category badge, preview, timestamp, and edit/delete actions.",
  "frontend/src/components/pioneers/AddPioneerModal.tsx": "Modal for adding a pioneer by selecting an active publisher and service year, with form validation and mutation.",
  "frontend/src/components/pioneers/DeletePioneerDialog.tsx": "Alert dialog confirming and executing deletion of a pioneer record with success/error toasts.",
  "frontend/src/components/pioneers/EditPioneerModal.tsx": "Modal for editing an existing pioneer, pre-filling fields and updating via mutation with validation.",
  "frontend/src/components/publishers/AddPublisherModal.tsx": "Modal form for creating a new publisher with validation, privilege options, and mutation handling.",
  "frontend/src/components/publishers/DeletePublisherNoteDialog.tsx": "Empty placeholder file for a dialog to delete a publisher note.",
  "frontend/src/components/publishers/EditPublisherModal.tsx": "Modal for editing an existing publisher, preloading data and submitting updates via mutation.",
  "frontend/src/components/publishers/EditPublisherNoteModal.tsx": "Empty placeholder file for a modal to edit a publisher note.",
  "frontend/src/components/publishers/PublisherNoteCard.tsx": "Empty placeholder file for rendering an individual publisher note.",
  "frontend/src/components/publishers/PublisherNotesSection.tsx": "Empty placeholder file for displaying a section of publisher notes.",
  "frontend/src/components/shepherding/EditShepherdingVisitModal.tsx": "Modal for editing a shepherding visit, including publisher selection, date conversion, validation, and update mutation.",
  "frontend/src/components/shepherding/RecordVisitModal.tsx": "Modal for recording a new shepherding visit with form validation, date conversion, and create mutation.",
  "frontend/src/components/tasks/AddTaskModal.tsx": "Modal for creating a new task with fields for title, due date, category, and optional notes.",
  "frontend/src/components/tasks/EditTaskModal.tsx": "Modal form for editing a task, handling field initialization, validation, and update mutation.",
  "frontend/src/components/territories/AddTerritoryModal.tsx": "Modal for creating a new territory with basic validation and create mutation.",
  "frontend/src/components/territories/CheckoutHistoryTable.tsx": "Displays a sorted table of territory checkout history with optional edit actions.",
  "frontend/src/components/territories/CheckOutTerritoryModal.tsx": "Modal to check out a territory by selecting a publisher and campaign option, then submitting a mutation.",
  "frontend/src/components/territories/DeleteTerritoryNoteDialog.tsx": "Confirmation dialog for deleting a territory note using a delete mutation.",
  "frontend/src/components/territories/EditCheckoutRecordModal.tsx": "Modal for editing a territory checkout record, including date conversion, validation, and update mutation.",
  "frontend/src/components/territories/EditTerritoryModal.tsx": "Modal form for editing a territory’s number and type, with validation and update mutation.",
  "frontend/src/components/territories/EditTerritoryNoteModal.tsx": "Modal for editing a single territory note’s content and saving changes via mutation.",
  "frontend/src/components/territories/TerritoryNoteCard.tsx": "Displays a territory note with timestamp and edit/delete action buttons.",
  "frontend/src/components/territories/TerritoryNotesSection.tsx": "Manages creating, listing, editing, and deleting notes for a territory using related modals and cards.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and refreshes dependent queries on change.",
  "frontend/src/hooks/useAddPublisher.ts": "Mutation hook to add a publisher, mapping UI privilege selections to backend format and invalidating the publishers list.",
  "frontend/src/hooks/useCheckOutTerritory.ts": "Mutation hook for checking out a territory to a publisher and refreshing affected territory queries.",
  "frontend/src/hooks/useCreateGlobalNote.ts": "Creates a global note with validation and invalidates globalNotes queries.",
  "frontend/src/hooks/useCreatePioneer.ts": "Mutation hook for creating a pioneer and invalidating the pioneers list.",
  "frontend/src/hooks/useCreateShepherdingVisit.ts": "Creates a shepherding visit entry and triggers refetch of related visit queries.",
  "frontend/src/hooks/useCreateTask.ts": "Creates a task with required fields and invalidates all task queries.",
  "frontend/src/hooks/useCreateTerritory.ts": "Creates a new territory with a generated ID and refreshes the territories list.",
  "frontend/src/hooks/useDeleteGlobalNote.ts": "Deletes a global note and invalidates globalNotes queries.",
  "frontend/src/hooks/useDeletePioneer.ts": "Deletes a pioneer by ID and triggers refetch of the pioneers list.",
  "frontend/src/hooks/useDeletePublisher.ts": "Provides a mutation to delete a publisher with optimistic cache updates and error rollback.",
  "frontend/src/hooks/useDeleteTask.ts": "Defines a mutation to delete a task and invalidates the tasks query on success.",
  "frontend/src/hooks/useGlobalNotes.ts": "Exports queries to fetch all global notes or a single note by ID using the actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements a React context provider and hook for Internet Identity login, state management, and AuthClient setup.",
  "frontend/src/hooks/usePioneers.ts": "Provides a query to fetch all pioneers from the backend actor.",
  "frontend/src/hooks/usePublisherNotes.ts": "Empty file with no implemented logic.",
  "frontend/src/hooks/useQueries.ts": "Exports queries to fetch all publishers or a specific publisher by ID.",
  "frontend/src/hooks/useShepherdingVisit.ts": "Provides queries and mutations for fetching, updating, and deleting individual shepherding visits.",
  "frontend/src/hooks/useShepherdingVisits.ts": "Defines a query to fetch all shepherding visits.",
  "frontend/src/hooks/useTasks.ts": "Provides queries to fetch tasks by status and to fetch a single task.",
  "frontend/src/hooks/useTerritories.ts": "Defines a query to fetch all territories.",
  "frontend/src/hooks/useTerritory.ts": "Exports queries and mutations for fetching, updating, deleting, and changing availability of a single territory.",
  "frontend/src/hooks/useTerritoryNotes.ts": "Implements queries and mutations for managing notes tied to a specific territory.",
  "frontend/src/hooks/useUpdateCheckoutRecord.ts": "Defines a mutation to update a territory checkout record and refresh related queries.",
  "frontend/src/hooks/useUpdateGlobalNote.ts": "Provides a mutation to update a global note and invalidate the global notes list.",
  "frontend/src/hooks/useUpdatePioneer.ts": "Defines a mutation to update a pioneer and refresh the pioneers list.",
  "frontend/src/hooks/useUpdatePublisher.ts": "Provides a mutation to update a publisher, mapping privilege inputs and invalidating the publishers list.",
  "frontend/src/hooks/useUpdateTask.ts": "Defines a mutation hook to update a task via actor.updateTask and refreshes task queries on success.",
  "frontend/src/hooks/useUpdateTaskCompletion.ts": "Provides a mutation hook to update a task's completion state and invalidates task queries afterward.",
  "frontend/src/index.css": "Sets up Tailwind layers and defines light/dark theme CSS variables including custom Theiarco colors.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/ComingSoon.tsx": "Displays a simple placeholder page with a title and construction icon indicating future functionality.",
  "frontend/src/pages/Login.tsx": "Renders the login screen using Internet Identity authentication with a styled button and layout.",
  "frontend/src/pages/Notes.tsx": "Implements a notes management page with filtering, sorting, add/edit/delete modals, and data fetching.",
  "frontend/src/pages/Pioneers.tsx": "Shows a list of pioneers with add, edit, and delete functionality and sorted table display.",
  "frontend/src/pages/PublisherProfile.tsx": "Displays a detailed view of a single publisher with edit and delete options and privilege indicators.",
  "frontend/src/pages/Publishers.tsx": "Provides a full publishers list with search, group filtering, inactive toggling, and CRUD modals.",
  "frontend/src/pages/Shepherding.tsx": "Lists shepherding visits with search, sorting, and a modal to record new visits.",
  "frontend/src/pages/ShepherdingVisitProfile.tsx": "Displays a single shepherding visit with editable notes and options to edit or delete the visit.",
  "frontend/src/pages/Tasks.tsx": "Shows tasks with filtering, completion toggling, and modals for adding, editing, and deleting tasks.",
  "frontend/src/pages/Territories.tsx": "Displays all territories with status, checkout duration logic, and a modal to add new territories.",
  "frontend/src/pages/TerritoryProfile.tsx": "Shows territory details with editing, deletion, checkout management, and checkout history.",
  "frontend/src/utils/formatters.ts": "Provides date formatting utilities for notes, tasks, checkouts, and visits based on backend timestamps.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routing), persist them in sessionStorage, and clear them from storage or the URL hash.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, container settings, animations, and plugins like typography, container queries, and animate.",
  "project_state.json": "Defines the project’s current state, requirements, and planned features for building the Shepherding Visits UI including routing and Visit Profile functionality."
}