{
  "kind": "build_request",
  "title": "Fix Territories checked-out duration calculation and enforce checkout timestamps in seconds",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the \"Checked Out Duration\" calculation on the Territories page so it correctly computes the duration between the current (not-returned) checkout date and today using backend timestamps in seconds (with defensive handling for legacy nanoseconds/incorrect milliseconds values). Display the duration in whole months (\"1 month\", \"3 months\") when the duration is at least 1 month; otherwise display whole days (\"15 days\").",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-9"
        ],
        "quotes": [
          "Fix the checkout duration calculation on the Territories page:\n\n1. The \"Checked Out Duration\" column is showing incorrect durations (like \"673 months\" instead of the actual duration).\n\n3. Fix the calculation to properly compute the duration between the checkout date and today's date:\n   - Convert the checkout date from the backend (timestamp in seconds) to a JavaScript Date\n   - Calculate the difference between today and the checkout date\n   - Display in months (e.g., \"3 months\", \"1 month\")\n   - If less than a month, show in days (e.g., \"15 days\")\n\n5. Use the same date calculation pattern that was working before the date picker was added.\n\nKeep everything else unchanged."
        ]
      },
      "acceptanceCriteria": [
        "On frontend/src/pages/Territories.tsx, the duration calculation must not divide a seconds timestamp by 1_000_000 (nanoseconds conversion) when the value is in seconds.",
        "If the backend timestamp appears to be in nanoseconds or milliseconds (legacy/incorrect), the duration calculation must normalize it to a correct JavaScript Date in milliseconds using the same defensive pattern used elsewhere in the app (e.g., similar to formatCheckoutDate / CSV date handling).",
        "For a territory currently checked out (latest record with no dateReturned), the UI displays: \"1 month\" for durations from 1 month to <2 months, \"N months\" for N>=2, and \"N days\" for durations <1 month.",
        "The \"Checked Out Duration\" column sort for the duration column still works and sorts by the same underlying duration value used for display.",
        "All other Territories page behaviors (layout, columns, overdue highlighting threshold logic, navigation, CRUD actions) remain unchanged except for the duration text and its underlying calculation."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure checkout dates are saved and returned as timestamps in seconds (not milliseconds and not nanoseconds) for territory checkout records created/updated via the Check Out Territory and Edit Checkout Record flows.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-9"
        ],
        "quotes": [
          "4. Make sure the checkout date is being saved correctly as a timestamp in seconds (not milliseconds, not a different format)."
        ]
      },
      "acceptanceCriteria": [
        "When checking out a territory via frontend/src/components/territories/CheckOutTerritoryModal.tsx, the value sent to the backend remains a seconds-since-epoch timestamp (BigInt seconds).",
        "Backend territory checkout persistence (backend/main.mo checkOutTerritory) must store dateCheckedOut in seconds; if the backend receives an input that looks like milliseconds or nanoseconds, it must be normalized to seconds before storing.",
        "Backend checkout record update persistence (backend/main.mo updateCheckoutRecord) must store newDateCheckedOut/newDateReturned in seconds; if the backend receives inputs that look like milliseconds or nanoseconds, they must be normalized to seconds before storing.",
        "After creating a new checkout with the date picker, the stored dateCheckedOut value is consistent with seconds (e.g., ~10-digit epoch seconds), and the Territories page duration output matches real time elapsed (no extreme values like hundreds of months)."
      ]
    }
  ],
  "constraints": [
    "Keep everything else unchanged aside from correcting the checkout duration calculation and ensuring territory checkout timestamps are stored in seconds.",
    "Use English for any user-facing text.",
    "Frontend immutable paths must not be modified: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui."
  ],
  "nonGoals": [
    "Do not redesign the Territories page UI or change table columns beyond the corrected duration text formatting.",
    "Do not introduce new authentication methods or third-party integrations.",
    "Do not migrate or rewrite unrelated timestamp formatting utilities beyond what is necessary to fix the Territories duration and territory checkout timestamp storage."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}