{
  "kind": "build_request",
  "title": "Update Overseer and Assistant badge colors in Field Service Groups pages",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "In `frontend/src/pages/FieldServiceGroupProfile.tsx`, update the existing badges that display the labels \"Overseer\" and \"Assistant\" so that:\n- \"Overseer\" badges use a black background (#000000 or Tailwind equivalent) with white text.\n- \"Assistant\" badges use a gray background (#6B7280 or #9CA3AF, or Tailwind equivalent) with white text.\nKeep the badges the same size, padding, typography, border radius, and general styling as before; only change their background and text colors. Do not change \"Elder\" or \"Ministerial Servant\" badge colors.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Just update the colors of the existing Overseer and Assistant badges - don't create new pages or components.\n\nSearch for \"Overseer\" and \"Assistant\" badge styling in those two files and update their colors."
        ]
      },
      "acceptanceCriteria": [
        "When a publisher in the group has the Overseer badge, it renders with a black background and white text, with no change in badge sizing/shape other than color.",
        "When a publisher in the group has the Assistant badge, it renders with a gray background and white text, with no change in badge sizing/shape other than color.",
        "Elder and Ministerial Servant badges render exactly as they did before this change.",
        "No new pages or reusable badge components are introduced; changes are limited to styling within `FieldServiceGroupProfile.tsx`."
      ]
    },
    {
      "id": "REQ-2",
      "text": "In `frontend/src/pages/FieldServiceGroups.tsx`, locate any existing UI elements (badges or badge-like elements) used to visually label \"Overseer\" and/or \"Assistant\" and update their colors to match:\n- Overseer: black background with white text\n- Assistant: gray background with white text\nKeep sizing/styling the same aside from colors, and do not introduce new pages or components.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "The pages are:\n- frontend/src/pages/FieldServiceGroups.tsx (main groups list page)\n- frontend/src/pages/FieldServiceGroupProfile.tsx (individual group profile page)\n\nThe Overseer and Assistant badges already exist on these pages showing group leadership."
        ]
      },
      "acceptanceCriteria": [
        "Any existing Overseer/Assistant badges on the Field Service Groups list page render with the specified background/text colors and otherwise unchanged styling.",
        "No Elder/Ministerial Servant badge colors are changed on this page (if present).",
        "No new pages or components are added; updates are limited to `FieldServiceGroups.tsx` styling."
      ]
    }
  ],
  "constraints": [
    "Do not create new pages or new shared badge components; only update existing styling in the specified page files.",
    "Only change Overseer and Assistant badge background/text colors; do not change badge size, padding, typography, layout, or other role badge colors (Elder / Ministerial Servant).",
    "Use English for any user-facing text (no new user-facing text is expected for this change)."
  ],
  "nonGoals": [
    "Changing backend data models or APIs.",
    "Restyling other badges (e.g., Elder, Ministerial Servant) or changing any other UI outside the specified pages."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}