{
  "kind": "build_request",
  "title": "Make publisher dropdowns scrollable within modals (max height 250px)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the Publisher dropdown menus in the following modals so the dropdown list is scrollable with a maximum height of 250px, shows a scrollbar when the list exceeds that height, and stays visually contained within the modal/viewport (i.e., does not extend beyond the modal or off-screen):\n- Add Pioneer modal on the Pioneers page (frontend/src/components/pioneers/AddPioneerModal.tsx)\n- Record Visit modal on the Shepherding page (frontend/src/components/shepherding/RecordVisitModal.tsx)\n- Add Conductor modal on the Service Meeting Conductors page (frontend/src/components/conductors/ConductorModal.tsx)\n- Add Trained Publisher modal on the Public Witnessing page (frontend/src/components/publicWitnessing/TrainedPublisherModal.tsx)\n\nKeep all other behavior, styling, validation, and text unchanged.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Update the publisher dropdown menus in four specific modals to support scrolling:\n\n1. Add Pioneer modal on the Pioneers page - make the publisher dropdown scrollable.\n\n2. Record Visit modal on the Shepherding page - make the publisher dropdown scrollable.\n\n3. Add Conductor modal on the Service Meeting Conductors page - make the publisher dropdown scrollable.\n\n4. Add Trained Publisher modal on the Public Witnessing page - make the publisher dropdown scrollable.\n\nFor each dropdown:\n- Set a maximum height of 250 pixels\n- Add a scrollbar when there are more publishers than fit in that height\n- Make sure the dropdown stays inside the modal and doesn't extend beyond the screen\n\nKeep everything else unchanged."
        ]
      },
      "acceptanceCriteria": [
        "In each of the four specified modals, the Publisher dropdown list has a maximum height of 250px.",
        "When the Publisher list exceeds 250px in height, the dropdown list becomes vertically scrollable and a scrollbar is available.",
        "When opened near the bottom/top of the modal/viewport, the dropdown list repositions and/or constrains itself so it does not render off-screen and does not visually escape the modal experience.",
        "No other fields, dropdowns (e.g., service year, status), form validation, submission behavior, or user-facing text is changed."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/components/ui (read-only / immutable UI component sources). Achieve the behavior by adjusting how the existing Select/SelectContent components are used in the four specified modal components.",
    "No backend changes are required for this request."
  ],
  "nonGoals": [
    "Custom scrollbar styling beyond ensuring a scrollbar appears when needed.",
    "Changing option ordering, filtering logic, or which publishers appear in the lists.",
    "Modifying modal sizes/layouts beyond what is necessary to keep the dropdown contained and scrollable."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}