{
  "kind": "build_request",
  "title": "Add Publisher Profile page routed by publisher ID",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a new authenticated route for a Publisher Profile page that is addressed by publisher ID in the URL (e.g., `/publishers/:id`) and renders within the existing authenticated app layout.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2",
          "msg-3"
        ],
        "quotes": [
          "Create a Publisher Profile page",
          "Publisher profile page should be routed by publisher ID."
        ]
      },
      "acceptanceCriteria": [
        "Navigating to `/publishers/<publisherId>` renders the Publisher Profile page inside the existing AppLayout (sidebar/header remain visible).",
        "The route parameter is treated as a publisher ID and used to load the correct publisher record."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Make each publisher name in the Publishers table clickable so that clicking it navigates to that publisher’s profile route using the publisher’s ID.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "Make the publisher names in the table clickable. When clicked, navigate to a Publisher Profile page showing that publisher's details."
        ]
      },
      "acceptanceCriteria": [
        "Clicking a publisher’s name in the table navigates to `/publishers/<id>` for that row.",
        "The existing Edit/Delete actions continue to work unchanged."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Implement the Publisher Profile page UI to display the selected publisher’s details: full name as the page heading, group number, overseer status (Yes/No), assistant status (Yes/No), and privileges.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "The Publisher Profile page should display: - Publisher's full name as the heading at the top - Group number - Overseer status (Yes or No) - Assistant status (Yes or No)  - Privileges"
        ]
      },
      "acceptanceCriteria": [
        "The publisher full name is shown as the primary heading at the top of the page.",
        "Group number, overseer status, assistant status, and privileges are visible and reflect the backend values for the selected publisher.",
        "Overseer and Assistant are rendered as \"Yes\" or \"No\" (in English)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Add a \"Back to Publishers\" button at the top of the Publisher Profile page that returns the user to the Publishers list page (`/publishers`).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "Add a \"Back to Publishers\" button at the top that returns to the Publishers list page."
        ]
      },
      "acceptanceCriteria": [
        "The Publisher Profile page includes a visible \"Back to Publishers\" button at the top.",
        "Clicking the button navigates to `/publishers`."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Add frontend data fetching support for a single publisher by ID using the existing backend API, and handle the states for loading and \"publisher not found\" on the Publisher Profile page.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-2",
          "msg-3"
        ],
        "quotes": [
          "navigate to a Publisher Profile page showing that publisher's details.",
          "Publisher profile page should be routed by publisher ID."
        ]
      },
      "acceptanceCriteria": [
        "The frontend calls the backend to fetch a publisher by ID (using the existing backend method) when the Publisher Profile page loads.",
        "While the publisher is loading, the page shows a loading state (in English).",
        "If the publisher ID does not exist (backend returns null/empty), the page shows a clear \"not found\" message (in English) and still provides a way to return to `/publishers`."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend.immutablePaths (including frontend/src/main.tsx, frontend/src/hooks/useActor.ts, and frontend/src/hooks/useInternetIdentity.ts[x]).",
    "Keep all existing Publishers list functionality (filters, add/edit/delete, inactive styling) unchanged aside from adding name-click navigation.",
    "Respect the single-actor Motoko backend architecture; do not introduce additional backend services."
  ],
  "nonGoals": [
    "Do not add pagination to the Publishers table.",
    "Do not add additional permission restrictions beyond the existing authenticated-user gating for publisher data.",
    "Do not change the backend Publisher schema or add new publisher fields."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}