{
  "kind": "build_request",
  "title": "Global Notes: Add Note modal + separate backend storage with optional publisher attachment",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-8",
      "text": "Implement a new Global Notes backend data model and stable storage that is completely separate from Publisher Profile Notes storage. Global Notes must have their own unique IDs and must only reference a publisher when the note category is exactly \"Publishers\".",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Live in a separate Global Notes store, with their own IDs, and only reference a publisher when Category = Publishers. Keep Publisher Profile notes and Global Notes as two completely separate systems with separate storage."
        ]
      },
      "acceptanceCriteria": [
        "Global Notes are stored independently from Publisher Profile Notes (no shared collections/maps, no shared CRUD endpoints).",
        "Each Global Note has a unique ID generated by the backend.",
        "Global Notes may store an optional publisher reference only when category == \"Publishers\"; for any other category, the stored publisher reference is empty/none."
      ]
    },
    {
      "id": "REQ-9",
      "text": "Add backend APIs for creating Global Notes from the Notes page with fields: unique ID (generated), title, content, category, optional attached publisher reference (only for category \"Publishers\"), and an integer timestamp for creation time. Persist Global Notes using stable storage so notes survive canister upgrades.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Save the note to the backend with: unique ID, title, content, category, attachedTo (if applicable), and creation timestamp",
          "Store notes in the backend using stable storage with integer timestamps."
        ]
      },
      "acceptanceCriteria": [
        "Calling the create Global Note API returns the created note (including generated ID and integer creation timestamp).",
        "Created Global Notes persist after a canister upgrade (verified by upgrade + subsequent query returning previously created notes).",
        "The API rejects invalid payloads (missing title/content/category; attached publisher set when category is not \"Publishers\")."
      ]
    },
    {
      "id": "REQ-10",
      "text": "On the Notes page (/notes), implement the \"Add Note\" button to open a modal form with the required fields and conditional \"Attach To\" behavior: Title (required), Content (required), Category dropdown (required; options: None, Publishers, Territory, Shepherding, Elder, General), and an \"Attach To\" dropdown that only appears for Publishers/Territory/Shepherding with Territory and Shepherding disabled placeholders as specified.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "When \"Add Note\" button is clicked, open a modal form with these fields:",
          "Category (dropdown with options: None, Publishers, Territory, Shepherding, Elder, General, required)",
          "Attach To (conditional dropdown that appears based on category selection)"
        ]
      },
      "acceptanceCriteria": [
        "Clicking \"Add Note\" opens a modal containing Title, Content, Category, and Submit/Cancel controls.",
        "\"Attach To\" behavior matches exactly: shown for Publishers (enabled), shown for Territory (disabled with placeholder \"Territories (coming soon)\"), shown for Shepherding (disabled with placeholder \"Shepherding Visits (coming soon)\"), hidden for Elder/General/None.",
        "All user-facing text in the modal is in English."
      ]
    },
    {
      "id": "REQ-11",
      "text": "For Category = \"Publishers\" in the Global Notes Add Note modal, populate the \"Attach To\" dropdown with ONLY active publishers (exclude inactive publishers). If a publisher becomes inactive, it must no longer appear in the dropdown for new Global Notes.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Only active publishers. When someone is marked inactive, they shouldn't appear in the \"Attach To\" dropdown for new notes."
        ]
      },
      "acceptanceCriteria": [
        "The \"Attach To\" dropdown lists only publishers whose active flag is true.",
        "Inactive publishers are not visible/selectable in the dropdown without requiring a page reload after the publishers query refetches/updates."
      ]
    },
    {
      "id": "REQ-12",
      "text": "Wire the Global Notes Add Note modal Submit/Cancel flows: on Submit, call the backend create Global Note API, then close the modal, clear the form fields, and show a green success toast with exact text \"Note created successfully!\" that auto-dismisses after 3 seconds; on Cancel, close the modal without saving.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "When Submit is clicked:",
          "Close the modal",
          "Clear the form fields",
          "Show green success toast \"Note created successfully!\" that auto-dismisses after 3 seconds",
          "When Cancel is clicked, close the modal without saving."
        ]
      },
      "acceptanceCriteria": [
        "Submit triggers a backend call and creates a persisted Global Note with an integer creation timestamp.",
        "After a successful submit, the modal closes, form state resets, and a success toast appears with the exact text and auto-dismiss timing.",
        "Cancel closes the modal and does not create any note in the backend."
      ]
    },
    {
      "id": "REQ-13",
      "text": "Enforce the separation between Global Notes and Publisher Profile Notes: Global Notes created on /notes must not appear in any Publisher Profile Notes UI; Publisher Profile Notes must not appear on the Global Notes page. Keep them as independent systems even when a Global Note references a publisher.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Global Notes and Publisher Profile Notes should remain completely separate concepts.",
          "Global Notes ... can optionally reference a publisher but don't appear on the publisher's profile"
        ]
      },
      "acceptanceCriteria": [
        "Creating a Global Note attached to a publisher does not change or populate the Publisher Profile Notes section for that publisher.",
        "Publisher Profile Notes CRUD continues to operate only on the publisher-keyed notes system and does not read/write Global Notes storage."
      ]
    }
  ],
  "constraints": [
    "Respect the single-actor Motoko backend architecture; all backend logic must live in backend/main.mo.",
    "Only introduce backend migration (backend/migration.mo changes) if required to preserve existing stable state under the platform’s conditional migration policy.",
    "Do not modify files in frontend immutablePaths (frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui).",
    "Keep all existing behavior from the previous version unchanged aside from the requested Global Notes create flow."
  ],
  "nonGoals": [
    "Do not implement Territory, Shepherding, Elder, or General attachment entities beyond the specified disabled placeholders for Territory and Shepherding.",
    "Do not add cross-linking or unified search between Global Notes and Publisher Profile Notes in this phase.",
    "Do not change publishers CRUD behavior or publisher active/inactive semantics beyond filtering the Attach To dropdown."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}