{
  "kind": "build_request",
  "title": "Darken Field Service Group 3 green and align Publisher table Overseer/Assistant badges",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the centralized Field Service Group color mapping so Group 3 uses the darker green hex color #0B6623, and ensure this new color is reflected everywhere Field Service Group colors are consumed (including Field Service Groups main page colored bars/group text/icons and Field Service Group profile pages heading text/colored bars/Record Visit button).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Change Group 3 (Green) to a darker shade: - #0B6623 (Dark Green)\n\nUpdate these colors everywhere they appear:\n   - Field Service Groups main page (colored bars, group text, icons)\n   - Group profile pages (heading text, colored bars, Record Visit button)"
        ]
      },
      "acceptanceCriteria": [
        "In frontend/src/utils/fieldServiceGroupColors.ts, Group 3 color is exactly '#0B6623' (hex) and other group colors remain unchanged.",
        "On the Field Service Groups main page, Group 3’s top bar, group label text, and icon render using #0B6623.",
        "On the Field Service Group profile page for Group 3, the page heading, the group leadership colored section, and the Record Visit button use #0B6623.",
        "No other styling or behavior changes occur outside of Group 3’s color update."
      ]
    },
    {
      "id": "REQ-2",
      "text": "On the Publishers page table, update the Overseer and Assistant badges so their styling (background + text + hover behavior) matches the badge styling used for Overseer and Assistant on the Field Service Group profile page.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Update the Overseer and Assistant badge on the Publisher page in the table so that it looks similar to the the color the badges have in the Field Service Groups profile page."
        ]
      },
      "acceptanceCriteria": [
        "In the Publishers table rows, the Overseer badge uses the same Tailwind classes as the Field Service Group profile’s Overseer badge (currently black background with white text, including matching hover styling).",
        "In the Publishers table rows, the Assistant badge uses the same Tailwind classes as the Field Service Group profile’s Assistant badge (currently gray background with white text, including matching hover styling).",
        "Badge text remains 'Overseer' and 'Assistant' and appears only when the corresponding boolean flags are true.",
        "No other Publisher table styling, sorting, filtering, or CRUD behavior is changed."
      ]
    }
  ],
  "constraints": [
    "Keep everything else unchanged outside the specified color/badge styling updates.",
    "Do not edit files under frontend/src/components/ui (compose existing components instead).",
    "Do not change backend behavior or data models for this request."
  ],
  "nonGoals": [
    "Changing Group 1, Group 2, or Group 4 colors.",
    "Redesigning the Field Service Groups pages or Publishers page beyond the specified color/badge adjustments.",
    "Changing privilege badge colors for Elder/Ministerial Servant (only Overseer/Assistant badges on the Publishers table are in scope)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}