{
  "kind": "build_request",
  "title": "Add Checked Out Duration column and highlight long checkouts in Territories table",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the existing Territories list page table (frontend/src/pages/Territories.tsx) to add a new column titled \"Checked Out Duration\" immediately after the existing \"Status\" column, without changing any other table behavior.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "In the Territories list page table, add a new \"Checked Out Duration\" column after the Status column."
        ]
      },
      "acceptanceCriteria": [
        "The Territories table header includes a new \"Checked Out Duration\" column placed after \"Status\".",
        "Each Territories table row renders a corresponding cell under \"Checked Out Duration\"."
      ]
    },
    {
      "id": "REQ-2",
      "text": "For each territory row in the Territories list table, compute and display the checked-out duration in months only when territory.status is exactly \"Checked Out\". Use the most recent checkout record in territory.checkOutHistory where dateReturned is null (i.e., the active checkout). Calculate months as floor((currentTimestampSeconds - dateCheckedOut) / (30 * 24 * 60 * 60)) and render the cell text as \"[X] months\" (e.g., \"0 months\", \"2 months\"). If no active checkout record exists, display \"—\".",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Calculate months checked out using: floor((current timestamp - dateCheckedOut) / (30 * 24 * 60 * 60))",
          "The calculation should use the most recent checkout record where dateReturned is null.",
          "Checkout record structure ... dateCheckedOut (Int - timestamp in seconds) ... dateReturned (?Int - null when still checked out)",
          "The checkout records are stored in the territory's checkOutHistory array."
        ]
      },
      "acceptanceCriteria": [
        "For territories with status exactly \"Checked Out\" and an active checkout record, the \"Checked Out Duration\" cell shows \"[X] months\" where X matches the specified formula using current time in seconds and the active record's dateCheckedOut.",
        "The active checkout record is selected as the most recent record (largest dateCheckedOut) among those with dateReturned = null.",
        "If territory.status is \"Checked Out\" but there is no active checkout record, the duration cell displays \"—\" (em dash)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "For territories with status exactly \"Available\" or exactly \"Under Review\", render \"—\" (em dash) in the \"Checked Out Duration\" column and do not apply any red background styling.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "For territories with status \"Available\" or \"Under Review\": Show \"—\" in the duration column; No red background"
        ]
      },
      "acceptanceCriteria": [
        "If territory.status is exactly \"Available\", the duration cell displays \"—\" and the row has no red background class applied.",
        "If territory.status is exactly \"Under Review\", the duration cell displays \"—\" and the row has no red background class applied."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Conditionally apply a subtle light red background to the entire Territories table row when (a) territory.status is exactly \"Checked Out\" and (b) the computed months checked out is 4 or more. Use a Tailwind class such as bg-red-50 or bg-red-100 (subtle but noticeable) applied to the full <TableRow>.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "If the territory has been checked out for 4 or more months, display the entire row with a red background",
          "Use a light red background for the entire table row (like bg-red-50 or bg-red-100 in Tailwind). Keep it subtle but noticeable - not too bright."
        ]
      },
      "acceptanceCriteria": [
        "When a territory is \"Checked Out\" and computed months >= 4, the corresponding <TableRow> has a light red background class (e.g., bg-red-50 or bg-red-100) and the background spans the entire row width.",
        "When computed months < 4, no red background class is applied to the row.",
        "The row remains readable (text contrast preserved) and existing click/navigation behavior for the Territory Number remains unchanged."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be edited: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui (compose only).",
    "Do not change backend data models or add new backend methods; use the existing territory.checkOutHistory data already returned by getAllTerritories().",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Do not add new pages, new filters, or changes to the Territory Profile page workflow.",
    "Do not change existing status values, status color mapping, or existing columns beyond inserting the new duration column.",
    "Do not modify checkout history storage format or migrate existing canister state."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}