{
  "kind": "build_request",
  "title": "Update privilege badge background colors for Elder and Ministerial Servant",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the PRIVILEGE badges (the small badges shown next to publisher names) so that the \"Elder\" badge background color is Amethyst Purple (#7C3AED) and the \"Ministerial Servant\" badge background color is Sapphire Blue (#2563EB), while keeping all other badge styling exactly the same (padding, border radius, font weight, size, etc.).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "I'm updating the PRIVILEGE badges for Elders and Ministerial Servants:\n\n1. Elder privilege badge: Change to Amethyst Purple #7C3AED\n2. Ministerial Servant privilege badge: Change to Sapphire Blue #2563EB\n\nThese are the small badges that appear next to publisher names showing their privileges (like \"Elder\" or \"Ministerial Servant\" tags).\n\nKeep all styling (padding, border radius, font weight) exactly the same - only change the background colors."
        ]
      },
      "acceptanceCriteria": [
        "Wherever an \"Elder\" privilege badge is rendered next to a publisher name, its background color is exactly #7C3AED.",
        "Wherever a \"Ministerial Servant\" privilege badge is rendered next to a publisher name, its background color is exactly #2563EB.",
        "No changes are made to badge padding, border radius, font weight, text size, or any other styling besides background color.",
        "Changes apply across the app anywhere these privilege badges appear (including the publishers list shown on Field Service Group profile pages)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure the Field Service Group leadership role badges (\"Overseer\" and \"Assistant\") remain exactly as they are and are not modified as part of this change.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "The Overseer and Assistant badges (for field service groups) should stay exactly as they are - don't change those."
        ]
      },
      "acceptanceCriteria": [
        "Existing \"Overseer\" and \"Assistant\" badges keep their current colors and styling with no visual or code changes made specifically to them while implementing the privilege badge color updates."
      ]
    }
  ],
  "constraints": [
    "Do not change Overseer and Assistant badges anywhere in the app.",
    "Do not change any badge styling other than the Elder/Ministerial Servant privilege badge background colors (no changes to padding, border radius, font weight, size, etc.).",
    "Do not edit any files under frontend/src/components/ui (immutable UI components must be used as-is)."
  ],
  "nonGoals": [
    "Do not change the text labels for any badges.",
    "Do not change how privileges are determined or stored (no backend privilege logic changes).",
    "Do not update Field Service Group pages to add new badges or new UI elements beyond the color changes requested."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}