{
  "kind": "build_request",
  "title": "Service Meeting Conductors page wired to new stable backend domain (read-only list for now)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Replace the existing \"/conductors\" route placeholder with a real \"Service Meeting Conductors\" page that uses the standard app layout/styling and includes: (1) heading text \"Service Meeting Conductors\"; (2) a top \"Assign Conductor\" button styled with background color #43587A and white text that is clickable but currently performs no action; (3) a table with columns \"Week Of\", \"Conductor Name\", and \"Actions\" (actions are placeholder only); (4) an empty-state message exactly: \"No conductors assigned. Click 'Assign Conductor' to create one.\" when no assignments exist.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-3"
        ],
        "quotes": [
          "Create a Service Meeting Conductors page in the app",
          "Add an \"Assign Conductor\" button at the top using #43587A background color with white text.",
          "Show placeholder text: \"No conductors assigned. Click 'Assign Conductor' to create one.\" if no assignments exist.",
          "The \"Assign Conductor\" button should be functional but we're not building the modal yet... It can be a placeholder that doesn't do anything yet."
        ]
      },
      "acceptanceCriteria": [
        "Navigating to \"/conductors\" renders the new page (not the ComingSoon placeholder).",
        "The page heading reads \"Service Meeting Conductors\".",
        "The \"Assign Conductor\" button is clickable and has #43587A background with white text; clicking it does not navigate or open any modal yet.",
        "The table renders with the three specified columns and no runtime errors.",
        "When the backend returns zero assignments, the empty-state message matches exactly."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Wire the Service Meeting Conductors page to real backend queries using React Query, including a loading state that shows a spinner and the text \"Loading...\" while fetching assignments. The initial UI should correctly display an empty table/empty-state when the backend returns no assignments.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-3"
        ],
        "quotes": [
          "Show a loading spinner with \"Loading...\" text while fetching data.",
          "Wire the page to real backend queries now. The table should be empty initially"
        ]
      },
      "acceptanceCriteria": [
        "While the assignments query is in-flight, the page shows a visible spinner and the text \"Loading...\".",
        "When the assignments query resolves to an empty list, the loading UI disappears and the empty-state message is shown.",
        "No mock data is displayed; data shown (if any) comes from the backend query."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add a new backend domain for \"Service Meeting Conductor\" assignments with stable storage and query APIs. The backend must persist and return assignment records with fields: id (Text, unique), weekOf (Int; timestamp in seconds for the Monday of that week), conductorId (Text; links to Publishers), conductorName (Text), createdAt (Int timestamp). Implement at least a read API to list all assignments (for populating the table now), keeping the structure ready for a future create-assignment API in the next prompt.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "Yes, create a new Service Meeting Conductors backend domain with stable storage.",
          "The backend should store assignments with: id (Text, unique) ... weekOf (Int - timestamp in seconds for the Monday of that week) ... conductorId (Text) ... conductorName (Text) ... createdAt (Int timestamp)",
          "Set up the full backend structure now so the next prompt can add the create functionality smoothly."
        ]
      },
      "acceptanceCriteria": [
        "Backend compiles and deploys with a new stable-persisted collection for conductor assignments.",
        "A query method exists to fetch all conductor assignments and returns an array/list of records containing exactly the specified fields.",
        "A fresh deployment returns an empty list from the assignments query (no seed data).",
        "Assignments storage is preserved across canister upgrades (stable storage)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Expose the new backend query in the generated frontend backend bindings and consume it from the Service Meeting Conductors page to populate the table rows (Week Of, Conductor Name) when assignments exist.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-3"
        ],
        "quotes": [
          "Wire the page to real backend queries now."
        ]
      },
      "acceptanceCriteria": [
        "Frontend type bindings include the conductor assignment type and the list query method.",
        "When backend returns one or more assignments, the page renders a table row per assignment showing Week Of (formatted date) and Conductor Name.",
        "No console errors related to missing actor methods/bindings when visiting the page authenticated."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor (all logic in backend/main.mo).",
    "Do not implement the Assign Conductor modal/page/form in this change (button is placeholder only).",
    "Do not edit any files under frontend/src/components/ui or any paths listed in frontend.immutablePaths.",
    "Use English for all user-facing text."
  ],
  "nonGoals": [
    "Implementing create/update/delete conductor assignments.",
    "Implementing the date picker and conductor dropdown (Elder/Ministerial Servant filtering) UI for assignment creation (next prompt).",
    "Adding new authentication methods beyond existing Internet Identity flow."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}