{
  "kind": "build_request",
  "title": "Update Elder and Ministerial Servant privilege badge colors app-wide",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Create a single, shared privilege badge styling implementation for the \"Elder\" and \"Ministerial Servant\" badges, and use it everywhere these privilege badges are rendered in the UI so the styling is consistent across pages.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "The Elder and Ministerial Servant badges are displayed throughout multiple pages, but they should all use consistent styling. Update them wherever they appear - likely they share the same styling logic or component."
        ]
      },
      "acceptanceCriteria": [
        "There is a single shared implementation (e.g., a dedicated component or shared helper) responsible for styling/rendering the Elder and Ministerial Servant privilege badges.",
        "All locations that render Elder/Ministerial Servant as colored pill/rectangle badges are updated to use the shared implementation rather than duplicating ad-hoc styling.",
        "The updated badges remain the same size/shape/typography as before (only background color changes for these two badges)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update Elder and Ministerial Servant badge background colors everywhere they appear: Elder must use #7C3AED and Ministerial Servant must use #2563EB; badge text must remain white; do not introduce dark-mode variants for these badges.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-0",
          "msg-user-1"
        ],
        "quotes": [
          "Change Elder badge color to Amethyst Purple (#7C3AED).",
          "Change Ministerial Servant badge color to Sapphire Blue (#2563EB).",
          "Keep the badge text white for good contrast.",
          "No dark mode variants - just use the colors I specified (#7C3AED for Elder, #2563EB for Ministerial Servant) everywhere these badges appear."
        ]
      },
      "acceptanceCriteria": [
        "Every \"Elder\" privilege badge renders with background color #7C3AED and white text.",
        "Every \"Ministerial Servant\" privilege badge renders with background color #2563EB and white text.",
        "No separate/different colors are applied for dark mode for these two badges (they use the same colors in all themes).",
        "Hover/focus states (if any) do not change the background away from the specified colors in a noticeable way (i.e., remain effectively the same specified color)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Ensure that only the Elder and Ministerial Servant privilege badges change color; all other badges (e.g., Available, Checked Out, On Track, Behind, Overseer, Assistant, Inactive, etc.) must retain their current colors and styling.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "Yes, these new colors apply ONLY to Elder and Ministerial Servant badges. All other badges (like Available, Checked Out, On Track, etc.) should stay the same colors they currently are."
        ]
      },
      "acceptanceCriteria": [
        "Badges unrelated to Elder/Ministerial Servant privileges are visually unchanged compared to current behavior.",
        "Status badges such as \"On Track\"/\"Behind\" and role badges such as \"Overseer\"/\"Assistant\" remain as they are today (colors and variants unchanged)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Apply the updated Elder/Ministerial Servant badge styling in all the known pages where they appear (Publishers page table, Publisher profile page, Field Service Groups page publisher lists, Field Service Group profile page publisher lists, Pioneers page table) and any other UI location that displays these privilege badges next to publisher names.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-0",
          "msg-user-1"
        ],
        "quotes": [
          "Update these badges everywhere they appear:\n   - Publishers page table\n   - Publisher profile page\n   - Field Service Groups page (publisher lists)\n   - Field Service Group profile page (publisher lists)\n   - Pioneers page table\n   - Any other location where privilege badges are displayed",
          "The badges appear as small colored pills/rectangles with white text showing \"Elder\" or \"Ministerial Servant\" next to publisher names."
        ]
      },
      "acceptanceCriteria": [
        "Where the app currently displays an Elder badge next to a publisher name on any page, it uses #7C3AED with white text.",
        "Where the app currently displays a Ministerial Servant badge next to a publisher name on any page, it uses #2563EB with white text.",
        "If any of the listed pages do not currently show privilege badges next to names, no new product behavior is introduced beyond ensuring any existing Elder/Ministerial Servant badge instances are updated wherever present."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/components/ui (shadcn UI sources are read-only); compose them by wrapping/using them from non-immutable paths.",
    "Do not change backend/Motoko logic or data models for this request."
  ],
  "nonGoals": [
    "Adding new badges or changing which privileges/roles are displayed.",
    "Changing layout, spacing, or typography of badge elements beyond what is required to apply the two new background colors.",
    "Changing colors for any non-Elder / non-Ministerial Servant badges.",
    "Implementing dark mode variants for Elder/Ministerial Servant badge colors."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}