{
  "kind": "build_request",
  "title": "Add Recent Activity section to Dashboard showing latest shepherding visits",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the Dashboard page to include a new section directly below the existing four stat cards with a heading labeled \"Recent Activity\".",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Add a Recent Activity section to the Dashboard below the stat cards:\n\n1. Add a heading \"Recent Activity\" below the four stat cards."
        ]
      },
      "acceptanceCriteria": [
        "On the Dashboard page, the \"Recent Activity\" heading renders beneath the stat cards grid without changing the existing stat cards, header, or layout above it.",
        "The heading text is exactly \"Recent Activity\" (English, matching capitalization)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "In the new Dashboard \"Recent Activity\" section, fetch shepherding visits using the existing shepherding visits query hook and display the 5 most recent visits sorted by visit date (newest first).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "2. Show the 5 most recent shepherding visits sorted by date (newest first)."
        ]
      },
      "acceptanceCriteria": [
        "The Dashboard uses the existing query hook used elsewhere for shepherding visits (useGetAllShepherdingVisits) to retrieve the list.",
        "The displayed list is sorted descending by the visit date field used by the Shepherding pages (e.g., visit.visitDate).",
        "Only the 5 most recent visits are rendered (or fewer if fewer exist)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "For each visit shown in Dashboard \"Recent Activity\", render: publisher name, formatted visit date, and a small \"View\" link that navigates to that visit’s profile route.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "3. For each visit, show:\n   - Publisher name\n   - Visit date\n   - A small \"View\" link that goes to that visit's profile page"
        ]
      },
      "acceptanceCriteria": [
        "Each list item shows the visit publisher name using the same field currently used in the Shepherding visit list/profile pages (e.g., visit.publisherName).",
        "Each list item shows the visit date formatted using the existing visit date formatter utility (formatVisitDate).",
        "Each list item includes a \"View\" link (text exactly \"View\") that navigates to the existing shepherding visit profile route pattern (/shepherding/<visitId>).",
        "Clicking \"View\" opens the correct ShepherdingVisitProfile page for that visit."
      ]
    },
    {
      "id": "REQ-4",
      "text": "If there are no shepherding visits available, show muted/gray text \"No recent activity\" in the Dashboard \"Recent Activity\" section.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "4. If there are no shepherding visits, show gray text saying \"No recent activity\"."
        ]
      },
      "acceptanceCriteria": [
        "When the shepherding visits query returns an empty list, the Dashboard shows the text \"No recent activity\" styled with a muted/gray treatment (e.g., text-muted-foreground) in the Recent Activity section.",
        "When at least one visit exists, the empty-state text is not shown."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Keep all other Dashboard behavior and UI unchanged aside from adding the new Recent Activity section described above.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Keep everything else unchanged."
        ]
      },
      "acceptanceCriteria": [
        "The existing Dashboard header text (\"Dashboard\" and its subheading) remains unchanged.",
        "The existing four stat cards (labels, colors, computed values, and grid layout) remain unchanged.",
        "No other routes, pages, or non-dashboard components are modified except what is necessary to support rendering the Recent Activity section on the Dashboard."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (Shadcn components); compose them instead if needed.",
    "Do not modify immutable auth/actor hook files (frontend/src/hooks/useInternetIdentity.ts / .tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx).",
    "Backend is single-actor Motoko; do not introduce additional canisters/services."
  ],
  "nonGoals": [
    "Do not add new shepherding visit creation/editing capabilities to the Dashboard.",
    "Do not change the existing Dashboard stat calculations or card styling.",
    "Do not implement real-time updates or push notifications for recent activity."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}