{
  "kind": "build_request",
  "title": "Update Dashboard page with overview statistic cards",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the existing Dashboard page for the /dashboard route to display four statistic cards in a single row at the top of the page (keeping everything else unchanged).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "The Dashboard page already exists at /dashboard route - it currently just shows a simple \"Dashboard\" heading. Update that existing page.",
          "On the Dashboard page, show four stat cards in a row at the top."
        ]
      },
      "acceptanceCriteria": [
        "Navigating to /dashboard renders the Dashboard page (not a placeholder/Coming Soon screen).",
        "The top section of the /dashboard page shows exactly 4 stat cards laid out in a single row on desktop (responsive stacking allowed on small screens).",
        "Other routes/pages and existing layout components remain unchanged."
      ]
    },
    {
      "id": "REQ-2",
      "text": "On the Dashboard page, query the existing backends for publishers, territories, and tasks (using the existing frontend actor/query hooks where available) and compute the four counts based on the following rules: (1) Active Publishers = publishers where isActive == true; (2) Checked Out Territories = territories where status == \"Checked Out\"; (3) Upcoming Tasks = tasks where isCompleted == false and dueDate > currentTimestampSeconds; (4) Overdue Tasks = tasks where isCompleted == false and dueDate < currentTimestampSeconds. dueDate is an Int timestamp in seconds.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "Just query the existing backends (getPublishers, getTerritories, getTasks) and count the results based on the conditions I described.",
          "dueDate is stored as Int (timestamp in seconds). To check if it's in the future: compare dueDate to current timestamp. To check if it's past: dueDate < current timestamp."
        ]
      },
      "acceptanceCriteria": [
        "The Dashboard page fetches publishers, territories, and tasks via existing backend APIs (no new backend endpoints are introduced).",
        "The displayed Active Publishers count equals the number of publishers with isActive === true.",
        "The displayed Checked Out Territories count equals the number of territories with status exactly equal to \"Checked Out\".",
        "The displayed Upcoming Tasks count equals the number of tasks with isCompleted === false and dueDate strictly greater than the current timestamp in seconds.",
        "The displayed Overdue Tasks count equals the number of tasks with isCompleted === false and dueDate strictly less than the current timestamp in seconds.",
        "The timestamp used for comparisons is computed at runtime on the client as the current Unix timestamp in seconds (not milliseconds).",
        "If dueDate values arrive as a bigint-like type, the implementation converts safely for comparison without crashing the page."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Render the four Dashboard stat cards with the exact labels and color backgrounds: (1) Green background card labeled \"Active Publishers\"; (2) Blue background card labeled \"Checked Out Territories\"; (3) Orange background card labeled \"Upcoming Tasks\"; (4) Red background card labeled \"Overdue Tasks\". Each card must show the computed number prominently, with the label text below it.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "First card: \"Active Publishers\" ... Use a green background.",
          "Second card: \"Checked Out Territories\" ... Use a blue background.",
          "Third card: \"Upcoming Tasks\" ... Use an orange background.",
          "Fourth card: \"Overdue Tasks\" ... Use a red background."
        ]
      },
      "acceptanceCriteria": [
        "Each of the four cards shows a large numeric value and the specified label beneath it.",
        "The four card labels match exactly: \"Active Publishers\", \"Checked Out Territories\", \"Upcoming Tasks\", \"Overdue Tasks\".",
        "The card background colors are visually green/blue/orange/red respectively (Tailwind utility classes are acceptable).",
        "User-facing text on the cards is in English."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Update routing/navigation so that the Dashboard page is accessible at /dashboard as specified, without breaking existing navigation. If the app currently uses / for Dashboard navigation, ensure users can still reach the Dashboard from the sidebar and the route configuration aligns with /dashboard.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "The Dashboard page already exists at /dashboard route"
        ]
      },
      "acceptanceCriteria": [
        "Entering /dashboard in the browser loads the Dashboard page.",
        "The sidebar has a working Dashboard navigation link that takes the user to the Dashboard page.",
        "No other route definitions are removed or broken."
      ]
    }
  ],
  "constraints": [
    "Do not create or modify backend data models for publishers, territories, or tasks; they already exist.",
    "Do not change the meaning/storage of Task.dueDate; it remains an Int timestamp in seconds.",
    "Keep everything else unchanged outside the Dashboard page and minimal routing updates needed to support /dashboard.",
    "Do not edit files under frontend/src/components/ui or any other frontend immutable paths listed in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Adding new backend endpoints or changing backend persistence/state.",
    "Adding charts, tables, drill-down links, or additional dashboard widgets beyond the four stat cards.",
    "Changing publishers/territories/tasks CRUD behavior or filtering behavior on their existing pages."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}