{
  "kind": "build_request",
  "title": "Add Export to CSV button on Pioneers page",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add an \"Export to CSV\" button to the Pioneers page header, positioned in the top-right next to the existing \"Add Pioneer\" button.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Add an \"Export to CSV\" button in the top-right corner of the Pioneers page (next to the \"Add Pioneer\" button)."
        ]
      },
      "acceptanceCriteria": [
        "On the Pioneers page, the header area shows two buttons on the right side: \"Export to CSV\" and \"Add Pioneer\".",
        "The \"Add Pioneer\" button retains its current styling and behavior.",
        "The \"Export to CSV\" button is visible only on the Pioneers page and does not affect other pages."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Implement client-side CSV generation and download when the \"Export to CSV\" button is clicked. The exported CSV must include one row per pioneer and the following columns in this exact order: Pioneer Name, Service Year, Total Hours, Average Hours, Current Status, September Hours, October Hours, November Hours, December Hours, January Hours, February Hours, March Hours, April Hours, May Hours, June Hours, July Hours, August Hours.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "When clicked, create a CSV file with these columns:",
          "Include data for all pioneers, with their monthly hours filled in where they exist (show \"0\" or blank for months with no data).",
          "Download the file as \"pioneers-export.csv\"."
        ]
      },
      "acceptanceCriteria": [
        "Clicking \"Export to CSV\" downloads a file named exactly \"pioneers-export.csv\".",
        "The first row of the CSV is a header row with the exact column names and order specified.",
        "The CSV contains all pioneers shown in the Pioneers list (not just currently visible rows).",
        "For each pioneer, \"Pioneer Name\" uses the pioneer's display name (publisherName), and \"Service Year\" uses the pioneer's serviceYear.",
        "For each pioneer, monthly hour columns are filled from that pioneer's monthly hours for the same serviceYear; months with no entry are exported as \"0\" (or blank, consistently).",
        "\"Total Hours\" equals the sum of all recorded monthly hours for that pioneer’s serviceYear.",
        "\"Average Hours\" equals Total Hours divided by the number of recorded monthly entries for that serviceYear (not divided by 12), matching the Pioneers table logic; when there are no entries, Average Hours exports as 0 or blank consistently.",
        "\"Current Status\" matches the same logic and labels as the UI badge: \"No Entries\" when there are no hours, \"On Track\" when average >= 50, otherwise \"Behind\".",
        "CSV fields are properly escaped/quoted so names containing commas/quotes/newlines export correctly."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Style the new \"Export to CSV\" button to match the existing \"Add Pioneer\" button styling on the Pioneers page, but differentiate it using a secondary visual treatment and/or a download icon, while keeping all other UI unchanged.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Use the same button styling as the \"Add Pioneer\" button but maybe use a secondary color or add a download icon.",
          "Keep everything else unchanged."
        ]
      },
      "acceptanceCriteria": [
        "The \"Export to CSV\" button uses the same general size, typography, and hover behavior as the \"Add Pioneer\" button.",
        "The \"Export to CSV\" button is visually distinct from \"Add Pioneer\" (e.g., a secondary color treatment and/or a download icon).",
        "No other styling changes occur outside of adding this new button."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/components/ui (compose existing UI components instead).",
    "Keep all existing Pioneers page behaviors (sorting, modals, navigation, table rendering) unchanged except for adding CSV export.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Adding backend endpoints specifically for CSV export.",
    "Adding filtering options or exporting only a subset of pioneers.",
    "Exporting to formats other than CSV (e.g., XLSX, PDF).",
    "Changing how averages/status are calculated in the UI."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}