{
  "kind": "build_request",
  "title": "Persistent reconnect toast while canister calls are pending",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a global toast notification that appears whenever any canister call is pending and the backend actor is not available, and keep the toast visible until the actor reconnects, then auto-dismiss it.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-15"
        ],
        "quotes": [
          "1. When the canister call is pending.\n2. Make it a toast notification that shows until it is connected. \n3. Yes i would like it to automatically disappear one it reconnects."
        ]
      },
      "acceptanceCriteria": [
        "When at least one React Query query or mutation is in-flight (pending) and the backend actor is not available, a toast is shown in the top-right (using the existing Sonner <Toaster /> in AppLayout).",
        "The toast remains visible (is not auto-timed-out) until connectivity is restored (actor becomes available again).",
        "Once the actor becomes available again, the toast is dismissed automatically without user interaction.",
        "The toast uses English user-facing text (e.g., \"Reconnecting…\" / \"Connection restored\").",
        "The solution is global (no need to add per-button/per-modal loading UI) and applies across all pages/routes."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Detect and treat the \"Actor not available\" failure state as a reconnect condition by showing the same persistent reconnect toast when React Query operations fail with an Error whose message includes \"Actor not available\", and keep it visible until the actor is available again.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-12",
          "msg-15"
        ],
        "quotes": [
          "What happens when the actor not available error comes on and i have already pushed the version live?",
          "Make it a toast notification that shows until it is connected."
        ]
      },
      "acceptanceCriteria": [
        "If a mutation or query throws an error with message containing \"Actor not available\" (as seen in existing hooks), the reconnect toast appears and stays visible until the actor becomes available again.",
        "The reconnect toast does not spam duplicates; at most one reconnect toast is visible at a time (use a stable toast id or equivalent).",
        "After reconnection, the reconnect toast is dismissed and normal success/error toasts continue to work as before."
      ]
    }
  ],
  "constraints": [
    "Do not edit files in frontend/immutablePaths (including frontend/src/hooks/useActor.ts and frontend/src/hooks/useInternetIdentity.ts).",
    "Keep the existing toast system (Sonner) and its placement in frontend/src/components/layout/AppLayout.tsx intact; compose additional logic around it rather than replacing it."
  ],
  "nonGoals": [
    "Adding a full-screen blocking overlay or waiting screen (user requested a toast notification).",
    "Backend changes to Motoko canisters or canister deployment configuration.",
    "Implementing real-time connectivity via WebSockets or push mechanisms."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}