{
  "kind": "build_request",
  "title": "Service Meeting Conductors: Full CRUD UI (modal + table) connected to backend",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update/align the ServiceMeetingConductor backend domain to use this record data model: { id: Text (unique), publisherId: Text, publisherName: Text, trainingDate: Int (timestamp in seconds), status: Text (\"Available\" | \"Unavailable\"), createdAt: Int }.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "ServiceMeetingConductor record data model ... id ... publisherId ... publisherName ... trainingDate (Int - timestamp in seconds) ... status ... createdAt"
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes a ServiceMeetingConductor type (or equivalent) with exactly the fields above.",
        "trainingDate and createdAt are stored as Int timestamps; trainingDate is interpreted as seconds since epoch.",
        "status values are restricted/validated to \"Available\" or \"Unavailable\" (reject/trap on invalid values)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Implement complete CRUD backend APIs for ServiceMeetingConductor records, protected by the same authorization checks used elsewhere (checkUserPermission(caller, #user)): create, list all, get by id (if needed by UI), update by id, and delete by id.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Build the complete CRUD system: Create (Add), Read (display table), Update (Edit), Delete."
        ]
      },
      "acceptanceCriteria": [
        "There are backend methods to create a conductor record, fetch all records, update an existing record by id, and delete by id.",
        "Create returns the new record id (Text) and sets createdAt on the backend.",
        "Update preserves createdAt and id; only updates publisherId, publisherName, trainingDate, and status.",
        "Delete traps/returns an error when the id does not exist (consistent with existing patterns like deletePioneer/deleteTask)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "If the canister is already deployed with existing state, add conditional migration support so upgrading initializes the new conductor collection without breaking existing state.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Build the complete CRUD system..."
        ]
      },
      "acceptanceCriteria": [
        "Upgrade does not trap due to uninitialized conductor storage.",
        "Existing non-conductor state (publishers, pioneers, tasks, etc.) remains readable and unchanged after upgrade."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Replace the current ServiceMeetingConductors page placeholder UI with a full CRUD UI for trained conductors: an \"Add Conductor\" button that opens a modal, a table that lists conductors, and per-row Edit/Delete actions wired to backend mutations.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "add the full UI (modal, table, Edit/Delete, sorting, etc.) and connect it to the backend for the ServiceMeetingConductor"
        ]
      },
      "acceptanceCriteria": [
        "The page at route \"/conductors\" shows a header and an \"Add Conductor\" button.",
        "Clicking \"Add Conductor\" opens the conductor modal in create mode with empty fields.",
        "The table renders all conductors from the backend and updates automatically after create/edit/delete (React Query invalidation/refetch).",
        "Loading state and empty state messages are shown in English."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Implement a single modal component used for BOTH Create and Edit of a ServiceMeetingConductor, with the same form fields: Publisher dropdown, Training Date picker, Status dropdown. The modal title must be \"Add Conductor\" for create mode and \"Edit Conductor\" for edit mode, and edit mode must pre-fill current row data.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "The modal should be used for BOTH Create and Edit ... Same form fields for both ... Modal title changes: \"Add Conductor\" for create, \"Edit Conductor\" for edit"
        ]
      },
      "acceptanceCriteria": [
        "Create mode: opening modal shows empty Publisher/Training Date/Status controls and submit creates a new record.",
        "Edit mode: clicking Edit on a row opens the same modal pre-filled with that row’s publisherId/publisherName, trainingDate, and status; submit updates that record.",
        "Publisher dropdown is populated from the existing publishers backend list (use existing publishers query hook) and displays publisher full names.",
        "Training Date picker writes/reads a seconds-based timestamp compatible with the backend model.",
        "Status dropdown only allows \"Available\" and \"Unavailable\"."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Update the ServiceMeetingConductors table to use these columns and behaviors: Conductor Name (default alphabetical order; no user sorting UI required), Training Date (formatted like \"Feb 7, 2026\"), Status (green badge for \"Available\", red badge for \"Unavailable\"), Actions (Edit/Delete buttons).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Table columns: Conductor Name (no sorting needed, just alphabetically by default) ... Training Date (formatted like \"Feb 7, 2026\") ... Status (with color: Green badge ... Red badge ...) ... Actions (Edit and Delete buttons for each row)"
        ]
      },
      "acceptanceCriteria": [
        "Rows are displayed alphabetically by conductor/publisher name by default.",
        "Training Date displays in the format \"MMM d, yyyy\" (e.g., \"Feb 7, 2026\").",
        "Status renders as a colored badge: green for \"Available\", red for \"Unavailable\".",
        "Each row includes working Edit and Delete buttons."
      ]
    },
    {
      "id": "REQ-7",
      "text": "Add a delete confirmation dialog for conductors: clicking Delete opens a confirmation dialog with the exact prompt text \"Delete this conductor?\" before removing the record.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Delete shows confirmation dialog \"Delete this conductor?\" before removing."
        ]
      },
      "acceptanceCriteria": [
        "Delete action does not call the backend until the user confirms in the dialog.",
        "The dialog displays the exact question text \"Delete this conductor?\".",
        "On successful delete, the dialog closes and the table refreshes to remove the row.",
        "On error, the dialog remains usable and an English error toast/message is shown."
      ]
    },
    {
      "id": "REQ-8",
      "text": "Create the necessary React Query hooks/mutations for ServiceMeetingConductors (create, update, delete) and ensure they invalidate/refetch the existing ['serviceMeetingConductors'] query so the UI stays consistent after mutations.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "connect it to the backend ... Build the complete CRUD system"
        ]
      },
      "acceptanceCriteria": [
        "There are mutation hooks for create/update/delete that call the corresponding backend actor methods.",
        "After each successful mutation, the serviceMeetingConductors query is invalidated/refetched so the table updates without manual reload.",
        "All user-facing success/error text is in English."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single-actor Motoko canister; keep all Motoko logic in backend/main.mo.",
    "Only create backend/migration.mo if required by the conditional migration policy when upgrading existing state.",
    "Do not edit files under frontend/src/components/ui or any other frontend immutable paths listed in SYSTEM_CONTEXT.",
    "Use Internet Identity-based actor access patterns already present (useActor/useInternetIdentity)."
  ],
  "nonGoals": [
    "Implementing weekly assignment scheduling (e.g., \"Week Of\" assignments) for conductors.",
    "Adding third-party auth providers or external databases.",
    "Adding advanced table sorting/filtering UI beyond default alphabetical ordering."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}