{
  "kind": "build_request",
  "title": "Add Publisher column to Territories table (from most recent checkout)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the Territories table on the Territories page (frontend/src/pages/Territories.tsx) to include a new column titled \"Publisher\" positioned between the \"Territory Number\" column and the \"Status\" column, adjusting the column order as needed to satisfy this placement while keeping all other functionality unchanged.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Add a \"Publisher\" column to the Territories table:\n\n1. On the Territories page, add a new column titled \"Publisher\" between the \"Number\" column and the \"Status\" column.\n\n4. Make sure the column fits well with the existing table layout.\n\nKeep everything else unchanged."
        ]
      },
      "acceptanceCriteria": [
        "The Territories table header includes a \"Publisher\" column.",
        "The \"Publisher\" column is rendered between \"Territory Number\" and \"Status\" in the table header and corresponding row cells.",
        "No other table features/regressions are introduced (row click navigation, highlighting, duration display, loading/empty states remain unchanged).",
        "The new column width/alignment fits the existing table layout (no overflow or broken layout at typical viewport sizes)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "For each territory row on the Territories page, render the \"Publisher\" cell value based on the territory’s most recent checkout record: if territory.status is \"Checked Out\", show the publisher name from the most recent checkout record for that territory; if territory.status is \"Available\", show an em dash (\"—\") styled in gray (muted).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "2. For each territory:\n   - If the territory status is \"Checked Out\", show the name of the publisher who has it checked out\n   - If the territory status is \"Available\", show \"—\" in gray\n\n3. Get the publisher name from the most recent checkout record for that territory."
        ]
      },
      "acceptanceCriteria": [
        "When a territory row has status \"Checked Out\", the Publisher cell displays the publisher name associated with the most recent checkout record for that territory.",
        "When a territory row has status \"Available\", the Publisher cell displays exactly \"—\" and uses a muted/gray text style (e.g., Tailwind text-muted-foreground or equivalent).",
        "The logic for \"most recent checkout record\" is based on the largest dateCheckedOut value in the territory’s checkout history (and is not dependent on UI sort order).",
        "If a territory is \"Checked Out\" but no checkout record can be found, the UI fails gracefully (shows \"—\" in muted text) without breaking the table rendering."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Use the existing publishers query hook from frontend/src/hooks/useQueries.ts (useGetAllPublishers) in Territories.tsx to ensure the displayed publisher name is correct and consistent with the rest of the app; prefer the publisher name on the checkout record when available, otherwise resolve the name via the publishers list by publisher ID if present in the checkout record model.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "It's called usePublishers and it's located at:\n\nfrontend/src/hooks/useQueries.ts\n\nThis hook fetches all publishers and returns an array with publisher data including id and name.\n\nUse it the same way here."
        ]
      },
      "acceptanceCriteria": [
        "Territories.tsx fetches publishers using the existing hook in frontend/src/hooks/useQueries.ts (useGetAllPublishers) following the established patterns in the codebase.",
        "The Publisher column value uses checkout-record publisher name when present; otherwise it attempts to look up the publisher’s current full name from the publishers list using the checkout record’s publisher identifier (if available).",
        "No backend changes are required to display the Publisher column."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/components/ui (read-only Shadcn components).",
    "Keep all existing Territories page behaviors unchanged aside from adding the new Publisher column and any minimal column reordering required to place it between Number and Status.",
    "Use English for all user-facing text."
  ],
  "nonGoals": [
    "Adding new backend endpoints or changing backend data models for territories/checkout records.",
    "Changing territory checkout/return behavior or altering territory status logic.",
    "Adding new filters, sorting controls, or search to the Territories table."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}