{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Dashboard overview statistic cards",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Update the Dashboard page at /dashboard to show four statistic cards in a single top-row section while leaving the rest of the page/layout unchanged.",
      "acceptanceCriteria": [
        "Navigating to /dashboard renders the Dashboard page (not a placeholder/Coming Soon screen).",
        "The top section of the /dashboard page shows exactly 4 stat cards laid out in a single row on desktop (responsive stacking allowed on small screens).",
        "Other routes/pages and existing layout components remain unchanged."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Dashboard.tsx",
          "operation": "create",
          "description": "Create the real Dashboard page UI that renders a top section containing exactly four stat cards in a responsive single-row grid on desktop, keeping the rest of the page minimal (e.g., existing heading) so the overall layout remains unchanged."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Fetch publishers, territories, and tasks using existing React Query actor hooks and compute the four Dashboard counts using client runtime Unix timestamp seconds with safe bigint handling.",
      "acceptanceCriteria": [
        "The Dashboard page fetches publishers, territories, and tasks via existing backend APIs (no new backend endpoints are introduced).",
        "The displayed Active Publishers count equals the number of publishers with isActive === true.",
        "The displayed Checked Out Territories count equals the number of territories with status exactly equal to \"Checked Out\".",
        "The displayed Upcoming Tasks count equals the number of tasks with isCompleted === false and dueDate strictly greater than the current timestamp in seconds.",
        "The displayed Overdue Tasks count equals the number of tasks with isCompleted === false and dueDate strictly less than the current timestamp in seconds.",
        "The timestamp used for comparisons is computed at runtime on the client as the current Unix timestamp in seconds (not milliseconds).",
        "If dueDate values arrive as a bigint-like type, the implementation converts safely for comparison without crashing the page."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Dashboard.tsx",
          "operation": "modify",
          "description": "Implement data fetching via existing hooks (useGetAllPublishers, useGetAllTerritories, useGetTasks(TaskStatus.all)) and compute counts with rules provided. Compute current timestamp at runtime in seconds and compare using safe bigint-friendly logic (e.g., normalize dueDate to bigint and compare against BigInt(nowSeconds)) to avoid crashes."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Render four labeled stat cards with specified color backgrounds and prominent numeric values.",
      "acceptanceCriteria": [
        "Each of the four cards shows a large numeric value and the specified label beneath it.",
        "The four card labels match exactly: \"Active Publishers\", \"Checked Out Territories\", \"Upcoming Tasks\", \"Overdue Tasks\".",
        "The card background colors are visually green/blue/orange/red respectively (Tailwind utility classes are acceptable).",
        "User-facing text on the cards is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Dashboard.tsx",
          "operation": "modify",
          "description": "Add the four stat cards with exact labels and background colors (green/blue/orange/red) and render the computed count prominently with the label beneath; use Tailwind utilities to match color requirements and keep card count exactly four."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Align routing and sidebar navigation so Dashboard is accessible at /dashboard without breaking existing routes, preserving access from the sidebar.",
      "acceptanceCriteria": [
        "Entering /dashboard in the browser loads the Dashboard page.",
        "The sidebar has a working Dashboard navigation link that takes the user to the Dashboard page.",
        "No other route definitions are removed or broken."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Register the Dashboard page at path /dashboard in the TanStack Router configuration and ensure the current / route behavior does not break existing navigation (e.g., redirect / to /dashboard or render the same Dashboard component at / as a compatibility route)."
        },
        {
          "path": "frontend/src/components/layout/Sidebar.tsx",
          "operation": "modify",
          "description": "Update the Dashboard navigation item to link to /dashboard and ensure active highlighting continues to work for the Dashboard route without affecting other sidebar links."
        }
      ]
    }
  ]
}