{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add tri-state column sorting to Territories table",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add tri-state (default/asc/desc) single-column sorting behavior to the Territories table headers, preserving the initial fetched order when unsorted.",
      "acceptanceCriteria": [
        "All Territories table headers (Territory Number, Publisher, Status, Type, Checked Out Duration) are clickable.",
        "Clicking a header applies ascending sort for that column; clicking again applies descending sort; clicking a third time returns to the default ordering (the same ordering as when the page first rendered with the fetched territories list).",
        "When a new column header is clicked, any prior column’s sort indicator is removed and only the new column is sorted.",
        "Sorting only affects the displayed rows; row click behavior, CSV export behavior, and highlight styling for long checkouts remain unchanged."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Territories.tsx",
          "operation": "modify",
          "description": "Implement table sorting state (active column + tri-state direction), header click handlers that cycle default→asc→desc→default, and compute a derived displayedTerritories list (useMemo) that sorts a copy while preserving the original fetched array order when in default state and as a tiebreaker for stable sorting. Ensure only the rendered rows change; keep navigation, exportTerritoryAssignmentRecord usage, and long-checkout row highlighting logic unchanged."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Show per-column sort arrows and add header hover affordances using Tailwind utility classes within Territories page (no shared UI component changes).",
      "acceptanceCriteria": [
        "When a column is sorted ascending, the header shows \"Column Name ↑\"; when descending, it shows \"Column Name ↓\"; when default, no arrow is shown.",
        "Hovering over any header visibly indicates interactivity (at minimum: cursor becomes pointer; header shows a subtle hover background change).",
        "Only the active sorted column shows an arrow at any time.",
        "No user-facing text is introduced other than the arrow characters."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Territories.tsx",
          "operation": "modify",
          "description": "Wrap each TableHead label content in a clickable element (e.g., a button) that renders the sort indicator character (↑/↓) immediately next to the label only for the active sorted column, and apply subtle Tailwind hover/cursor styles (e.g., cursor-pointer + slight hover background) on the header content without modifying anything under frontend/src/components/ui."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add appropriate comparison logic for each Territories table column, including consistent handling of em-dash placeholders and numeric parsing for number/duration.",
      "acceptanceCriteria": [
        "Sorting by Territory Number orders rows by the territory.number value in ascending/descending order (numeric when parsable).",
        "Sorting by Publisher orders rows alphabetically by the value shown in the Publisher column.",
        "Sorting by Status orders rows alphabetically by territory.status.",
        "Sorting by Type orders rows alphabetically by territory.territoryType.",
        "Sorting by Checked Out Duration orders rows numerically by the computed months value used to render the duration display.",
        "Returning to default sorting restores the original row order from the fetched territories list."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Territories.tsx",
          "operation": "modify",
          "description": "Implement column-specific comparator helpers for Territory Number (numeric when possible, else localeCompare), Publisher (use the same getPublisherName display value; sort '—' consistently), Status (alphabetical), Type (alphabetical), and Checked Out Duration (use the same computed months used for display; sort missing duration '—' consistently). Ensure switching back to default uses the original fetched ordering."
        }
      ]
    }
  ]
}