{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Make Publisher dropdowns scrollable and constrained within modals (max height 250px)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Constrain the Publisher Select dropdown lists in the four specified modals to a max height of 250px with vertical scrolling and collision-aware positioning so they remain visually contained within the modal/viewport, without changing any other behavior or text.",
      "acceptanceCriteria": [
        "In each of the four specified modals, the Publisher dropdown list has a maximum height of 250px.",
        "When the Publisher list exceeds 250px in height, the dropdown list becomes vertically scrollable and a scrollbar is available.",
        "When opened near the bottom/top of the modal/viewport, the dropdown list repositions and/or constrains itself so it does not render off-screen and does not visually escape the modal experience.",
        "No other fields, dropdowns (e.g., service year, status), form validation, submission behavior, or user-facing text is changed."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/pioneers/AddPioneerModal.tsx",
          "operation": "modify",
          "description": "Update ONLY the Publisher Select dropdown usage to make the list scrollable with max height 250px (e.g., applying max-height and overflow-y styles to SelectContent) and enable collision-aware/contained rendering within the modal/viewport using supported SelectContent positioning props. Use the existing shadcn-ui Select/SelectContent components (do not modify any files under frontend/src/components/ui). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/shepherding/RecordVisitModal.tsx",
          "operation": "modify",
          "description": "Update ONLY the Publisher Select dropdown usage to enforce max height 250px with vertical scrolling on the SelectContent, and ensure the dropdown is constrained/repositioned to remain within the modal/viewport when opened near edges (using supported SelectContent positioning/collision props). Keep all other styling, validation, and text unchanged. Do not modify any files under frontend/src/components/ui. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/conductors/ConductorModal.tsx",
          "operation": "modify",
          "description": "Update ONLY the Publisher Select dropdown usage (not Status or other controls) so SelectContent has max height 250px with overflow-y scrolling and remains contained within the modal/viewport via supported positioning/collision settings. Preserve all existing behavior, validation, and text. Do not modify any files under frontend/src/components/ui. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/publicWitnessing/TrainedPublisherModal.tsx",
          "operation": "modify",
          "description": "Update ONLY the Publisher Select dropdown usage to apply a 250px max height with vertical scrolling to SelectContent and ensure the dropdown stays within the modal/viewport using supported collision-aware positioning options. Keep all other behavior, styling, and text unchanged. Do not modify any files under frontend/src/components/ui. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}