{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Territories table: checked-out duration column + long-checkout row highlight",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Insert a new \"Checked Out Duration\" column in the Territories table immediately after the existing \"Status\" column, without changing other table behavior.",
      "acceptanceCriteria": [
        "The Territories table header includes a new \"Checked Out Duration\" column placed after \"Status\".",
        "Each Territories table row renders a corresponding cell under \"Checked Out Duration\"."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Territories.tsx",
          "operation": "modify",
          "description": "Add a new <TableHead> labeled \"Checked Out Duration\" immediately after the existing \"Status\" header, and add a matching <TableCell> in each mapped row in the same position (after the Status cell), preserving existing table structure and interactions."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Compute and display checked-out duration in whole months for \"Checked Out\" territories using the most recent active checkout record; otherwise show an em dash.",
      "acceptanceCriteria": [
        "For territories with status exactly \"Checked Out\" and an active checkout record, the \"Checked Out Duration\" cell shows \"[X] months\" where X matches the specified formula using current time in seconds and the active record's dateCheckedOut.",
        "The active checkout record is selected as the most recent record (largest dateCheckedOut) among those with dateReturned = null.",
        "If territory.status is \"Checked Out\" but there is no active checkout record, the duration cell displays \"—\" (em dash)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Territories.tsx",
          "operation": "modify",
          "description": "Implement a local helper (in this file) to derive the active checkout record from territory.checkOutHistory by filtering records with dateReturned == null and selecting the one with the largest dateCheckedOut; compute months as floor((currentTimestampSeconds - dateCheckedOutSeconds) / (30*24*60*60)) using currentTimestampSeconds = Math.floor(Date.now()/1000); render the duration cell as \"[X] months\" only when territory.status is exactly \"Checked Out\" and an active record exists, otherwise render an em dash (—)."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Show an em dash for \"Available\" and \"Under Review\" territories in the duration column and ensure no red background styling is applied.",
      "acceptanceCriteria": [
        "If territory.status is exactly \"Available\", the duration cell displays \"—\" and the row has no red background class applied.",
        "If territory.status is exactly \"Under Review\", the duration cell displays \"—\" and the row has no red background class applied."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Territories.tsx",
          "operation": "modify",
          "description": "Ensure the duration-rendering logic explicitly returns an em dash (—) for territories whose status is exactly \"Available\" or exactly \"Under Review\", and ensure the row highlight class is not applied for these statuses regardless of checkout history content."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Apply a subtle light red background to the full table row when a territory is \"Checked Out\" for 4+ months, without changing readability or existing click/navigation behavior.",
      "acceptanceCriteria": [
        "When a territory is \"Checked Out\" and computed months >= 4, the corresponding <TableRow> has a light red background class (e.g., bg-red-50 or bg-red-100) and the background spans the entire row width.",
        "When computed months < 4, no red background class is applied to the row.",
        "The row remains readable (text contrast preserved) and existing click/navigation behavior for the Territory Number remains unchanged."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Territories.tsx",
          "operation": "modify",
          "description": "Use the computed months value (from REQ-2) to conditionally add a Tailwind class such as bg-red-50 (or bg-red-100) to the entire <TableRow> only when territory.status is exactly \"Checked Out\" and months >= 4; otherwise leave the row unstyled. Keep existing Territory Number button and navigation logic unchanged to preserve current behavior and readability."
        }
      ]
    }
  ]
}