{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Service Meeting Conductors: CRUD table + shared modal wired to backend",
  "requirements": [
    {
      "id": "REQ-4",
      "summary": "Replace the /conductors page placeholder with a full CRUD UI (Add button, modal, table, Edit/Delete wired to mutations).",
      "acceptanceCriteria": [
        "The page at route \"/conductors\" shows a header and an \"Add Conductor\" button.",
        "Clicking \"Add Conductor\" opens the conductor modal in create mode with empty fields.",
        "The table renders all conductors from the backend and updates automatically after create/edit/delete (React Query invalidation/refetch).",
        "Loading state and empty state messages are shown in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ServiceMeetingConductors.tsx",
          "operation": "modify",
          "description": "Replace the current assignment-focused placeholder UI with a trained conductors CRUD page: header + \"Add Conductor\" button, table listing trained conductors (from the existing ['serviceMeetingConductors'] query), and per-row Edit/Delete actions that open the shared modal / delete dialog and trigger React Query mutations; include English loading + empty states."
        },
        {
          "path": "frontend/src/components/conductors/ConductorModal.tsx",
          "operation": "create",
          "description": "Create a shared Create/Edit modal for trained conductors (Publisher dropdown, Training Date picker, Status dropdown) and wire it for both modes. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/conductors/DeleteConductorDialog.tsx",
          "operation": "create",
          "description": "Create a conductor delete confirmation dialog used by the /conductors page that blocks deletion until confirmed and triggers the delete mutation + English toast feedback. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Implement a single shared modal component for BOTH creating and editing a conductor with Publisher, Training Date, and Status fields.",
      "acceptanceCriteria": [
        "Create mode: opening modal shows empty Publisher/Training Date/Status controls and submit creates a new record.",
        "Edit mode: clicking Edit on a row opens the same modal pre-filled with that row’s publisherId/publisherName, trainingDate, and status; submit updates that record.",
        "Publisher dropdown is populated from the existing publishers backend list (use existing publishers query hook) and displays publisher full names.",
        "Training Date picker writes/reads a seconds-based timestamp compatible with the backend model.",
        "Status dropdown only allows \"Available\" and \"Unavailable\"."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/conductors/ConductorModal.tsx",
          "operation": "modify",
          "description": "Implement dual-mode behavior (create vs edit) with modal titles \"Add Conductor\" and \"Edit Conductor\", pre-fill values in edit mode, and validate/convert Training Date to a seconds-based bigint when calling mutations; populate Publisher dropdown via useGetAllPublishers and display publisher fullName; restrict Status options to \"Available\" and \"Unavailable\". Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/ServiceMeetingConductors.tsx",
          "operation": "modify",
          "description": "Wire the shared ConductorModal into the /conductors page for both create and edit flows (open in create mode from \"Add Conductor\", open in edit mode from row action, and pass selected conductor data for prefill)."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Update the conductors table columns, default alphabetical ordering, training date formatting, status badges, and actions.",
      "acceptanceCriteria": [
        "Rows are displayed alphabetically by conductor/publisher name by default.",
        "Training Date displays in the format \"MMM d, yyyy\" (e.g., \"Feb 7, 2026\").",
        "Status renders as a colored badge: green for \"Available\", red for \"Unavailable\".",
        "Each row includes working Edit and Delete buttons."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ServiceMeetingConductors.tsx",
          "operation": "modify",
          "description": "Render the table with columns: Conductor Name (publisherName; default alphabetical sort only), Training Date (formatted \"MMM d, yyyy\"), Status (badge styling: green for \"Available\", red for \"Unavailable\"), and Actions (Edit/Delete buttons)."
        },
        {
          "path": "frontend/src/utils/formatters.ts",
          "operation": "modify",
          "description": "Add or reuse a formatter for conductor training dates that formats a seconds-based bigint timestamp into \"MMM d, yyyy\" (e.g., by reusing the existing seconds-based task/visit formatting pattern)."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Add a delete confirmation dialog with exact prompt text before deleting a conductor, with success/error feedback.",
      "acceptanceCriteria": [
        "Delete action does not call the backend until the user confirms in the dialog.",
        "The dialog displays the exact question text \"Delete this conductor?\".",
        "On successful delete, the dialog closes and the table refreshes to remove the row.",
        "On error, the dialog remains usable and an English error toast/message is shown."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/conductors/DeleteConductorDialog.tsx",
          "operation": "modify",
          "description": "Implement the confirmation UI using the existing alert-dialog UI primitives with the exact prompt text \"Delete this conductor?\"; only call the delete mutation after confirm; on success close dialog and show an English success toast; on error keep dialog usable and show an English error toast. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/ServiceMeetingConductors.tsx",
          "operation": "modify",
          "description": "Wire Delete action buttons to open DeleteConductorDialog with the selected row, and ensure closing/reset behavior mirrors existing delete dialogs used elsewhere."
        }
      ]
    },
    {
      "id": "REQ-8",
      "summary": "Create React Query mutation hooks for create/update/delete conductors and invalidate/refetch ['serviceMeetingConductors'] after success.",
      "acceptanceCriteria": [
        "There are mutation hooks for create/update/delete that call the corresponding backend actor methods.",
        "After each successful mutation, the serviceMeetingConductors query is invalidated/refetched so the table updates without manual reload.",
        "All user-facing success/error text is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useServiceMeetingConductors.ts",
          "operation": "modify",
          "description": "Align the existing ['serviceMeetingConductors'] query hook to fetch the trained conductors list from the backend actor and return the trained conductor record shape used by the CRUD UI (keeping the same React Query key so invalidation works as required)."
        },
        {
          "path": "frontend/src/hooks/useCreateTrainedConductor.ts",
          "operation": "create",
          "description": "Add a React Query mutation hook that creates a trained conductor via the backend actor and invalidates/refetches ['serviceMeetingConductors'] on success."
        },
        {
          "path": "frontend/src/hooks/useUpdateTrainedConductor.ts",
          "operation": "create",
          "description": "Add a React Query mutation hook that updates a trained conductor via the backend actor and invalidates/refetches ['serviceMeetingConductors'] on success."
        },
        {
          "path": "frontend/src/hooks/useDeleteTrainedConductor.ts",
          "operation": "create",
          "description": "Add a React Query mutation hook that deletes a trained conductor via the backend actor and invalidates/refetches ['serviceMeetingConductors'] on success."
        },
        {
          "path": "frontend/src/components/conductors/ConductorModal.tsx",
          "operation": "modify",
          "description": "Use the new create/update mutation hooks and show English success/error toasts/messages; ensure successful mutation closes the modal and relies on query invalidation to refresh the table. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/conductors/DeleteConductorDialog.tsx",
          "operation": "modify",
          "description": "Use the new delete mutation hook and show English success/error toasts/messages; ensure successful mutation closes the dialog and relies on query invalidation to refresh the table. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}