{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Update privilege badge background colors for Elder and Ministerial Servant",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Change only the background colors for the \"Elder\" and \"Ministerial Servant\" privilege badges everywhere they are rendered next to publisher names, keeping all other badge styling unchanged.",
      "acceptanceCriteria": [
        "Wherever an \"Elder\" privilege badge is rendered next to a publisher name, its background color is exactly #7C3AED.",
        "Wherever a \"Ministerial Servant\" privilege badge is rendered next to a publisher name, its background color is exactly #2563EB.",
        "No changes are made to badge padding, border radius, font weight, text size, or any other styling besides background color.",
        "Changes apply across the app anywhere these privilege badges appear (including the publishers list shown on Field Service Group profile pages)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/privilegeBadges.ts",
          "operation": "create",
          "description": "Add a small helper that returns Tailwind class overrides for PRIVILEGE badges, mapping \"Elder\" to background #7C3AED and \"Ministerial Servant\" to background #2563EB (including matching hover background), without changing any other styling. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/FieldServiceGroupProfile.tsx",
          "operation": "modify",
          "description": "Update privilege badge rendering to apply the new Elder/Ministerial Servant background colors via a shared helper, while keeping all other Badge props and styling the same. Ensure only privilege badges change (not layout, spacing, typography, padding, radius, etc.). Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Ensure the Field Service Group leadership role badges (\"Overseer\" and \"Assistant\") are not changed while implementing privilege badge color updates.",
      "acceptanceCriteria": [
        "Existing \"Overseer\" and \"Assistant\" badges keep their current colors and styling with no visual or code changes made specifically to them while implementing the privilege badge color updates."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/FieldServiceGroupProfile.tsx",
          "operation": "modify",
          "description": "Keep the current Overseer (black) and Assistant (gray) badge className styling untouched and ensure any refactor applies the new colors only to the \"Elder\" and \"Ministerial Servant\" privilege badges. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}