{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Global persistent reconnect toast for actor unavailability during React Query activity",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Show a global persistent Sonner toast in the top-right while any React Query operation is pending and the backend actor is unavailable; auto-dismiss when the actor reconnects.",
      "acceptanceCriteria": [
        "When at least one React Query query or mutation is in-flight (pending) and the backend actor is not available, a toast is shown in the top-right (using the existing Sonner <Toaster /> in AppLayout).",
        "The toast remains visible (is not auto-timed-out) until connectivity is restored (actor becomes available again).",
        "Once the actor becomes available again, the toast is dismissed automatically without user interaction.",
        "The toast uses English user-facing text (e.g., \"Reconnecting…\" / \"Connection restored\").",
        "The solution is global (no need to add per-button/per-modal loading UI) and applies across all pages/routes."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/system/ReconnectToastManager.tsx",
          "operation": "create",
          "description": "Create a global manager component that (1) observes React Query in-flight state (queries/mutations) and (2) reads actor availability via the existing useActor hook (do not modify immutable hook), then shows a single persistent Sonner toast with a stable id while conditions indicate reconnection is needed; dismiss and optionally show a short \"Connection restored\" toast when actor becomes available again. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/layout/AppLayout.tsx",
          "operation": "modify",
          "description": "Wire the new ReconnectToastManager into the global layout so it runs across all pages/routes without changing the existing Sonner <Toaster /> placement (compose around it, do not replace it). Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Treat React Query failures with message containing \"Actor not available\" as a reconnect condition, showing the same single persistent reconnect toast until the actor is available again (no duplicate spam).",
      "acceptanceCriteria": [
        "If a mutation or query throws an error with message containing \"Actor not available\" (as seen in existing hooks), the reconnect toast appears and stays visible until the actor becomes available again.",
        "The reconnect toast does not spam duplicates; at most one reconnect toast is visible at a time (use a stable toast id or equivalent).",
        "After reconnection, the reconnect toast is dismissed and normal success/error toasts continue to work as before."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/reconnectState.ts",
          "operation": "create",
          "description": "Add a small shared frontend-only state utility (e.g., subscribe/notify) to record when an \"Actor not available\" error has been observed so the reconnect toast can be triggered globally without adding per-hook UI handling. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/main.tsx",
          "operation": "modify",
          "description": "Configure the React Query QueryClient to globally observe query/mutation errors and, when an Error message includes \"Actor not available\", signal reconnectState (without changing existing per-feature success/error toasts). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/system/ReconnectToastManager.tsx",
          "operation": "modify",
          "description": "Integrate reconnectState so the manager also shows the persistent reconnect toast when an \"Actor not available\" error is detected (even if no in-flight operations remain), ensuring only one toast instance via a stable id and dismissing automatically when the actor becomes available again. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}