{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add Publisher column to Territories table using most recent checkout",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add a Publisher column to the Territories table and reorder columns so Publisher sits between Territory Number and Status without changing other behaviors.",
      "acceptanceCriteria": [
        "The Territories table header includes a \"Publisher\" column.",
        "The \"Publisher\" column is rendered between \"Territory Number\" and \"Status\" in the table header and corresponding row cells.",
        "No other table features/regressions are introduced (row click navigation, highlighting, duration display, loading/empty states remain unchanged).",
        "The new column width/alignment fits the existing table layout (no overflow or broken layout at typical viewport sizes)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Territories.tsx",
          "operation": "modify",
          "description": "Update the Territories table column definitions/rendering to insert a new \"Publisher\" header and cell between \"Territory Number\" and \"Status\", reordering the existing \"Type\" column as needed while preserving all existing interactions, loading/empty states, highlighting, and duration display."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Compute and render per-row Publisher display from the most recent checkout record, with graceful fallback and muted em dash for Available.",
      "acceptanceCriteria": [
        "When a territory row has status \"Checked Out\", the Publisher cell displays the publisher name associated with the most recent checkout record for that territory.",
        "When a territory row has status \"Available\", the Publisher cell displays exactly \"—\" and uses a muted/gray text style (e.g., Tailwind text-muted-foreground or equivalent).",
        "The logic for \"most recent checkout record\" is based on the largest dateCheckedOut value in the territory’s checkout history (and is not dependent on UI sort order).",
        "If a territory is \"Checked Out\" but no checkout record can be found, the UI fails gracefully (shows \"—\" in muted text) without breaking the table rendering."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Territories.tsx",
          "operation": "modify",
          "description": "Add helper logic to select the most recent checkout record by largest dateCheckedOut from territory.checkOutHistory and render the Publisher cell: for status \"Available\" show a muted gray \"—\"; for status \"Checked Out\" show the resolved publisher name or fall back to muted \"—\" if missing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Use the existing useGetAllPublishers hook to resolve publisher names consistently when checkout record name is missing.",
      "acceptanceCriteria": [
        "Territories.tsx fetches publishers using the existing hook in frontend/src/hooks/useQueries.ts (useGetAllPublishers) following the established patterns in the codebase.",
        "The Publisher column value uses checkout-record publisher name when present; otherwise it attempts to look up the publisher’s current full name from the publishers list using the checkout record’s publisher identifier (if available).",
        "No backend changes are required to display the Publisher column."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Territories.tsx",
          "operation": "modify",
          "description": "Import and use the existing publishers query hook (useGetAllPublishers) from frontend/src/hooks/useQueries.ts, then resolve the Publisher display by preferring checkoutRecord.publisherName when present, otherwise mapping checkoutRecord.publisherId to the publishers list fullName; keep the UI resilient if publishers data is still loading or missing."
        }
      ]
    }
  ]
}