{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Global Notes: Notes page Add Note modal and create flow (frontend)",
  "requirements": [
    {
      "id": "REQ-10",
      "summary": "Implement an Add Note modal on /notes with required fields and exact conditional Attach To behavior by category.",
      "acceptanceCriteria": [
        "Clicking \"Add Note\" opens a modal containing Title, Content, Category, and Submit/Cancel controls.",
        "\"Attach To\" behavior matches exactly: shown for Publishers (enabled), shown for Territory (disabled with placeholder \"Territories (coming soon)\"), shown for Shepherding (disabled with placeholder \"Shepherding Visits (coming soon)\"), hidden for Elder/General/None.",
        "All user-facing text in the modal is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/notes/AddGlobalNoteModal.tsx",
          "operation": "create",
          "description": "Create an Add Global Note modal using shadcn-ui primitives (Dialog, Input, Select, Button, etc.) with fields Title (required), Content (required), Category dropdown (required; options exactly: None, Publishers, Territory, Shepherding, Elder, General), and conditional \"Attach To\" UI: (1) Publishers shows enabled dropdown, (2) Territory shows disabled dropdown with placeholder text \"Territories (coming soon)\", (3) Shepherding shows disabled dropdown with placeholder text \"Shepherding Visits (coming soon)\", (4) hidden for Elder/General/None. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/Notes.tsx",
          "operation": "modify",
          "description": "Wire the existing \"Add Note\" button to open/close the new AddGlobalNoteModal component and pass required state/handlers so the modal renders on /notes without introducing new routes."
        }
      ]
    },
    {
      "id": "REQ-11",
      "summary": "For Category = \"Publishers\", populate Attach To with only active publishers and reflect updates without reload.",
      "acceptanceCriteria": [
        "The \"Attach To\" dropdown lists only publishers whose active flag is true.",
        "Inactive publishers are not visible/selectable in the dropdown without requiring a page reload after the publishers query refetches/updates."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/notes/AddGlobalNoteModal.tsx",
          "operation": "modify",
          "description": "Populate the Publishers \"Attach To\" dropdown from the existing publishers query data and filter to only `isActive === true`; ensure the dropdown options are derived from query state so changes in the cached/refetched publishers list immediately update what can be selected for new Global Notes. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Confirm the existing publishers query hook behavior is suitable for reactive updates (React Query cached data + refetch/invalidation) and, if needed, adjust query options (without changing semantics) to support timely UI updates for the active-publishers Attach To dropdown."
        }
      ]
    },
    {
      "id": "REQ-12",
      "summary": "Implement Add Note modal Submit/Cancel flows: create Global Note via backend call, reset/close, and show exact success toast.",
      "acceptanceCriteria": [
        "Submit triggers a backend call and creates a persisted Global Note with an integer creation timestamp.",
        "After a successful submit, the modal closes, form state resets, and a success toast appears with the exact text and auto-dismiss timing.",
        "Cancel closes the modal and does not create any note in the backend."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useCreateGlobalNote.ts",
          "operation": "create",
          "description": "Add a React Query mutation hook that calls the backend capability to create a Global Note (title/content/category plus attachedPublisher as PublisherId|null) and returns the created ID; include basic client-side validation alignment (required fields; attachedPublisher only when category is exactly \"Publishers\") and expose pending/error state for UI control."
        },
        {
          "path": "frontend/src/components/notes/AddGlobalNoteModal.tsx",
          "operation": "modify",
          "description": "Wire Submit to call useCreateGlobalNote; on success close the modal, clear form fields, and show a green success toast with exact text \"Note created successfully!\" that auto-dismisses after 3 seconds; on Cancel, close the modal without saving. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/Notes.tsx",
          "operation": "modify",
          "description": "Ensure the Notes page passes modal open/close and completion handlers so a successful submit closes the modal and resets UI state while preserving all existing Notes page behavior aside from the requested create flow."
        }
      ]
    },
    {
      "id": "REQ-13",
      "summary": "Ensure Global Notes UI and Publisher Profile Notes UI remain independent and do not cross-populate.",
      "acceptanceCriteria": [
        "Creating a Global Note attached to a publisher does not change or populate the Publisher Profile Notes section for that publisher.",
        "Publisher Profile Notes CRUD continues to operate only on the publisher-keyed notes system and does not read/write Global Notes storage."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useGlobalNotes.ts",
          "operation": "create",
          "description": "Create dedicated React Query hook(s) for Global Notes reads (e.g., fetch all Global Notes) using distinct query keys (e.g., ['globalNotes', ...]) so Global Notes are cached/invalidated separately from any publisher-related notes concerns."
        },
        {
          "path": "frontend/src/hooks/useCreateGlobalNote.ts",
          "operation": "modify",
          "description": "On successful creation, invalidate/refetch only Global Notes query keys (e.g., ['globalNotes']) and avoid invalidating any publisher profile notes keys, ensuring Global Notes creation on /notes does not implicitly drive Publisher Profile Notes UI updates."
        },
        {
          "path": "frontend/src/pages/PublisherProfile.tsx",
          "operation": "modify",
          "description": "Audit and enforce that PublisherProfile does not import or query Global Notes hooks/components; keep Publisher Profile behavior unchanged and ensure no Global Notes rendering is introduced when a Global Note references a publisher."
        }
      ]
    }
  ]
}