{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Update Overseer and Assistant badge colors on Field Service Groups pages",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Update Overseer and Assistant badges in FieldServiceGroupProfile to use black/white and gray/white color schemes without altering any other badge styling.",
      "acceptanceCriteria": [
        "When a publisher in the group has the Overseer badge, it renders with a black background and white text, with no change in badge sizing/shape other than color.",
        "When a publisher in the group has the Assistant badge, it renders with a gray background and white text, with no change in badge sizing/shape other than color.",
        "Elder and Ministerial Servant badges render exactly as they did before this change.",
        "No new pages or reusable badge components are introduced; changes are limited to styling within `FieldServiceGroupProfile.tsx`."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/FieldServiceGroupProfile.tsx",
          "operation": "modify",
          "description": "Adjust the existing Badge rendering for role labels so that only badges with label \"Overseer\" receive a black background with white text (Tailwind equivalent of #000000 + white), and only badges with label \"Assistant\" receive a gray background with white text (Tailwind equivalent of #6B7280/#9CA3AF + white). Preserve existing Badge variant usage and all other styling (size/padding/typography/radius); do not change Elder or Ministerial Servant badge colors."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Update any existing Overseer/Assistant badge-like labeling in FieldServiceGroups list view to match the black/white and gray/white color schemes without other styling changes.",
      "acceptanceCriteria": [
        "Any existing Overseer/Assistant badges on the Field Service Groups list page render with the specified background/text colors and otherwise unchanged styling.",
        "No Elder/Ministerial Servant badge colors are changed on this page (if present).",
        "No new pages or components are added; updates are limited to `FieldServiceGroups.tsx` styling."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/FieldServiceGroups.tsx",
          "operation": "modify",
          "description": "Locate the existing UI elements that visually label \"Overseer\" and/or \"Assistant\" (badge or badge-like label styling) and update only their background/text colors to: Overseer black background with white text; Assistant gray background with white text. Keep the existing typography/layout/sizing unchanged aside from the color changes, and do not introduce new pages or components."
        }
      ]
    }
  ]
}