{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Service Meeting Conductors page (real route + React Query read-only wiring)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Replace the /conductors placeholder with a real Service Meeting Conductors page using the standard layout, header/button, table scaffold, and exact empty-state copy.",
      "acceptanceCriteria": [
        "Navigating to \"/conductors\" renders the new page (not the ComingSoon placeholder).",
        "The page heading reads \"Service Meeting Conductors\".",
        "The \"Assign Conductor\" button is clickable and has #43587A background with white text; clicking it does not navigate or open any modal yet.",
        "The table renders with the three specified columns and no runtime errors.",
        "When the backend returns zero assignments, the empty-state message matches exactly."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ServiceMeetingConductors.tsx",
          "operation": "create",
          "description": "Create the \"Service Meeting Conductors\" page UI using the standard page padding/styling, with heading text, a top \"Assign Conductor\" button styled with background #43587A and white text (clickable no-op), and a table scaffold with columns \"Week Of\", \"Conductor Name\", and \"Actions\" (placeholder). Use shadcn-ui Table/Button components where appropriate. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire the existing \"/conductors\" route to render the new ServiceMeetingConductors page instead of the ComingSoon placeholder, keeping it under the authenticated AppLayout."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Fetch conductor assignments via React Query and show a visible spinner with \"Loading...\" while fetching; show the exact empty-state when the list is empty.",
      "acceptanceCriteria": [
        "While the assignments query is in-flight, the page shows a visible spinner and the text \"Loading...\".",
        "When the assignments query resolves to an empty list, the loading UI disappears and the empty-state message is shown.",
        "No mock data is displayed; data shown (if any) comes from the backend query."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useServiceMeetingConductors.ts",
          "operation": "create",
          "description": "Add a React Query hook (patterned after existing hooks like useGetAllPioneers) that uses useActor and queries the backend actor for all Service Meeting Conductor assignments, with enabled gating on actor availability and actor fetching state."
        },
        {
          "path": "frontend/src/pages/ServiceMeetingConductors.tsx",
          "operation": "modify",
          "description": "Consume the new React Query hook to drive UI states: show a centered spinner plus the exact text \"Loading...\" while loading; when results are empty, show the exact empty-state copy: \"No conductors assigned. Click 'Assign Conductor' to create one.\" Ensure no mock data is rendered."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Ensure frontend backend bindings expose the assignments list query/type and render assignment rows with formatted Week Of date and Conductor Name when data exists.",
      "acceptanceCriteria": [
        "Frontend type bindings include the conductor assignment type and the list query method.",
        "When backend returns one or more assignments, the page renders a table row per assignment showing Week Of (formatted date) and Conductor Name.",
        "No console errors related to missing actor methods/bindings when visiting the page authenticated."
      ],
      "file_operations": [
        {
          "path": "frontend/src/backend.d.ts",
          "operation": "modify",
          "description": "Verify/align generated frontend bindings to include the ServiceMeetingConductor type and the getAllServiceMeetingConductors method signature used by the page (update declarations if they are missing or mismatched)."
        },
        {
          "path": "frontend/src/utils/formatters.ts",
          "operation": "modify",
          "description": "Add a formatter utility for the conductor assignment weekOf value (bigint timestamp in seconds for the Monday of that week) to produce a user-friendly date string for the Week Of column."
        },
        {
          "path": "frontend/src/pages/ServiceMeetingConductors.tsx",
          "operation": "modify",
          "description": "Render one table row per assignment returned from the backend query, showing Week Of using the new formatter and Conductor Name, with an Actions column containing placeholder content only. Use shadcn-ui Table components for consistent styling. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}