{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Update Elder and Ministerial Servant privilege badge colors app-wide",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Introduce a single shared PrivilegeBadge implementation for Elder/Ministerial Servant and replace ad-hoc rendering where these privilege badges appear.",
      "acceptanceCriteria": [
        "There is a single shared implementation (e.g., a dedicated component or shared helper) responsible for styling/rendering the Elder and Ministerial Servant privilege badges.",
        "All locations that render Elder/Ministerial Servant as colored pill/rectangle badges are updated to use the shared implementation rather than duplicating ad-hoc styling.",
        "The updated badges remain the same size/shape/typography as before (only background color changes for these two badges)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/publishers/PrivilegeBadge.tsx",
          "operation": "create",
          "description": "Create a shared PrivilegeBadge component dedicated to rendering the \"Elder\" and \"Ministerial Servant\" privilege badges with consistent styling across the app (compose the existing shadcn Badge component; do not modify any files under frontend/src/components/ui)."
        },
        {
          "path": "frontend/src/pages/FieldServiceGroupProfile.tsx",
          "operation": "modify",
          "description": "Replace inline/ad-hoc Elder/Ministerial Servant badge rendering with the shared PrivilegeBadge component everywhere these privilege badges are rendered on this page; keep other badge rendering (e.g., Overseer/Assistant/Inactive) as-is."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Set Elder badge background to #7C3AED and Ministerial Servant badge background to #2563EB with white text, with no dark-mode variants and no noticeable hover/focus color shifts.",
      "acceptanceCriteria": [
        "Every \"Elder\" privilege badge renders with background color #7C3AED and white text.",
        "Every \"Ministerial Servant\" privilege badge renders with background color #2563EB and white text.",
        "No separate/different colors are applied for dark mode for these two badges (they use the same colors in all themes).",
        "Hover/focus states (if any) do not change the background away from the specified colors in a noticeable way (i.e., remain effectively the same specified color)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/publishers/PrivilegeBadge.tsx",
          "operation": "modify",
          "description": "Implement the exact Elder (#7C3AED) and Ministerial Servant (#2563EB) background colors with white text, explicitly overriding dark-mode classes so both themes use identical colors; ensure hover/focus states remain effectively the same specified color by forcing hover/focus background classes to match."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Ensure only Elder and Ministerial Servant privilege badges change color; all other badges remain unchanged.",
      "acceptanceCriteria": [
        "Badges unrelated to Elder/Ministerial Servant privileges are visually unchanged compared to current behavior.",
        "Status badges such as \"On Track\"/\"Behind\" and role badges such as \"Overseer\"/\"Assistant\" remain as they are today (colors and variants unchanged)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/FieldServiceGroupProfile.tsx",
          "operation": "modify",
          "description": "Limit usage of the new PrivilegeBadge component to only the \"Elder\" and \"Ministerial Servant\" labels; keep existing Badge variants/classes for other labels (e.g., Overseer, Assistant, Inactive) unchanged to preserve their current colors and styling."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Apply the shared updated privilege badge styling across all known pages/locations where Elder/Ministerial Servant privilege badges are displayed next to publisher names.",
      "acceptanceCriteria": [
        "Where the app currently displays an Elder badge next to a publisher name on any page, it uses #7C3AED with white text.",
        "Where the app currently displays a Ministerial Servant badge next to a publisher name on any page, it uses #2563EB with white text.",
        "If any of the listed pages do not currently show privilege badges next to names, no new product behavior is introduced beyond ensuring any existing Elder/Ministerial Servant badge instances are updated wherever present."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Publishers.tsx",
          "operation": "modify",
          "description": "Audit this page for any existing Elder/Ministerial Servant pill/rectangle badge rendering next to publisher names; if present, refactor those instances to use the shared PrivilegeBadge component (do not introduce new badge displays if they do not already exist)."
        },
        {
          "path": "frontend/src/pages/PublisherProfile.tsx",
          "operation": "modify",
          "description": "Audit this page for any existing Elder/Ministerial Servant pill/rectangle badge rendering next to the publisher name/details; if present, refactor those instances to use the shared PrivilegeBadge component (do not introduce new badge displays if they do not already exist)."
        },
        {
          "path": "frontend/src/pages/FieldServiceGroups.tsx",
          "operation": "modify",
          "description": "Audit publisher lists on this page for any existing Elder/Ministerial Servant badge rendering next to names; if present, refactor those instances to use the shared PrivilegeBadge component (do not introduce new badge displays if they do not already exist)."
        },
        {
          "path": "frontend/src/pages/Pioneers.tsx",
          "operation": "modify",
          "description": "Audit the pioneers table for any existing Elder/Ministerial Servant badge rendering next to publisher names; if present, refactor those instances to use the shared PrivilegeBadge component (do not introduce new badge displays if they do not already exist)."
        }
      ]
    }
  ]
}