{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Update Group 3 color mapping and align Publisher table Overseer/Assistant badges",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Change Field Service Group 3 to use darker green #0B6623 in the centralized color map so all consuming UI reflects the new color.",
      "acceptanceCriteria": [
        "In frontend/src/utils/fieldServiceGroupColors.ts, Group 3 color is exactly '#0B6623' (hex) and other group colors remain unchanged.",
        "On the Field Service Groups main page, Group 3’s top bar, group label text, and icon render using #0B6623.",
        "On the Field Service Group profile page for Group 3, the page heading, the group leadership colored section, and the Record Visit button use #0B6623.",
        "No other styling or behavior changes occur outside of Group 3’s color update."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/fieldServiceGroupColors.ts",
          "operation": "modify",
          "description": "Update the Group 3 entry in FIELD_SERVICE_GROUP_COLORS from '#059669' to exactly '#0B6623' so all pages using getGroupColor (Field Service Groups list + Field Service Group profile UI elements) automatically reflect the darker green."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Make the Publishers table Overseer/Assistant badges use the same Tailwind styling (including hover) as the Field Service Group profile page badges.",
      "acceptanceCriteria": [
        "In the Publishers table rows, the Overseer badge uses the same Tailwind classes as the Field Service Group profile’s Overseer badge (currently black background with white text, including matching hover styling).",
        "In the Publishers table rows, the Assistant badge uses the same Tailwind classes as the Field Service Group profile’s Assistant badge (currently gray background with white text, including matching hover styling).",
        "Badge text remains 'Overseer' and 'Assistant' and appears only when the corresponding boolean flags are true.",
        "No other Publisher table styling, sorting, filtering, or CRUD behavior is changed."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Publishers.tsx",
          "operation": "modify",
          "description": "Update the conditional Overseer/Assistant <Badge> components in the Name column to match FieldServiceGroupProfile styling: Overseer uses 'bg-black text-white hover:bg-black' and Assistant uses 'bg-gray-500 text-white hover:bg-gray-500' (retain existing conditional rendering and keep other table behavior unchanged)."
        }
      ]
    }
  ]
}