{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "Build a Service Meeting Conductors feature: add a new sidebar-accessible page with table UI and wire it to a new backend domain (stable storage) for conductor assignments, ready for future create-assignment flow.",
  "architectural_notes": [
    "New backend domain 'Service Meeting Conductors' with stable storage for assignments: {id: Text, weekOf: Int (seconds, Monday), conductorId: Text, conductorName: Text, createdAt: Int}.",
    "Conductor dropdown for create flow will be sourced from existing Publishers backend filtered by privileges in ['Elder','Ministerial Servant'].",
    "Service Meeting Conductors page should query backend for assignments and show loading/empty states; create/edit UI to be added later."
  ],
  "known_issues": [],
  "isFixRequest": false,
  "existing_features": [
    {
      "id": "feature-replace-the-existing-conductors-route-placeholder-with-a-real-service-meeting-conductors-page-that-uses-the-standard-app-layout-styling-and-includes-1-heading-text-service-meeting-conductors-2-a-top-assign-conductor-button-styled-with-background-color-43587a-and-white-text-that-is-clickable-but-currently-performs-no-action-3-a-table-with-columns-week-of-conductor-name-and-actions-actions-are-placeholder-only-4-an-empty-state-message-exactly-no-conductors-assigned-click-assign-conductor-to-create-one-when-no-assignments-exist",
      "title": "Replace the existing \"/conductors\" route placeholder with a real \"Service Meeting Conductors\" page that uses the standard app layout/styling and includes: (1) heading text \"Service Meeting Conductors\"; (2) a top \"Assign Conductor\" button styled with background color #43587A and white text that is clickable but currently performs no action; (3) a table with columns \"Week Of\", \"Conductor Name\", and \"Actions\" (actions are placeholder only); (4) an empty-state message exactly: \"No conductors assigned. Click 'Assign Conductor' to create one.\" when no assignments exist.",
      "reqIds": [
        "REQ-1"
      ],
      "version": 1
    },
    {
      "id": "feature-wire-the-service-meeting-conductors-page-to-real-backend-queries-using-react-query-including-a-loading-state-that-shows-a-spinner-and-the-text-loading-while-fetching-assignments-the-initial-ui-should-correctly-display-an-empty-table-empty-state-when-the-backend-returns-no-assignments",
      "title": "Wire the Service Meeting Conductors page to real backend queries using React Query, including a loading state that shows a spinner and the text \"Loading...\" while fetching assignments. The initial UI should correctly display an empty table/empty-state when the backend returns no assignments.",
      "reqIds": [
        "REQ-2"
      ],
      "version": 1
    },
    {
      "id": "feature-expose-the-new-backend-query-in-the-generated-frontend-backend-bindings-and-consume-it-from-the-service-meeting-conductors-page-to-populate-the-table-rows-week-of-conductor-name-when-assignments-exist",
      "title": "Expose the new backend query in the generated frontend backend bindings and consume it from the Service Meeting Conductors page to populate the table rows (Week Of, Conductor Name) when assignments exist.",
      "reqIds": [
        "REQ-4"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Add 'Service Meeting Conductors' page accessible from sidebar with heading, styled 'Assign Conductor' button (#43587A, white text), table (Week Of, Conductor Name, Actions placeholder), empty-state message, and loading spinner using app-wide layout/styling.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Create new backend domain for Service Meeting Conductor assignments with stable storage (id, weekOf seconds timestamp for Monday, conductorId, conductorName, createdAt) and expose query endpoints; wire UI to real backend queries (initially empty until create flow is added).",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-3",
      "summary": "Prepare for future 'Assign Conductor' create flow: Week Of date picker (Monday), Conductor dropdown filtered to Publishers with privileges Elder or Ministerial Servant; for now button is clickable placeholder with no modal/page yet.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-6",
      "summary": "Add a new backend domain for \"Service Meeting Conductor\" assignments with stable storage and query APIs. The backend must persist and return assignment records with fields: id (Text, unique), weekOf (Int; timestamp in seconds for the Monday of that week), conductorId (Text; links to Publishers), conductorName (Text), createdAt (Int timestamp). Implement at least a read API to list all assignments (for populating the table now), keeping the structure ready for a future create-assignment API in the next prompt.",
      "reqIds": [
        "REQ-3"
      ],
      "status": "pending"
    }
  ],
  "projectName": "Service Meeting Conductors page wired to new stable backend domain (read-only list for now)",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}