{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "New project",
  "architectural_notes": [
    "Privilege badges for Elder and Ministerial Servant should use consistent styling across the app (prefer shared component/styling logic) and only background color should change; text remains white; no dark-mode variants."
  ],
  "known_issues": [],
  "isFixRequest": false,
  "existing_features": [
    {
      "id": "feature-create-a-single-shared-privilege-badge-styling-implementation-for-the-elder-and-ministerial-servant-badges-and-use-it-everywhere-these-privilege-badges-are-rendered-in-the-ui-so-the-styling-is-consistent-across-pages",
      "title": "Create a single, shared privilege badge styling implementation for the \"Elder\" and \"Ministerial Servant\" badges, and use it everywhere these privilege badges are rendered in the UI so the styling is consistent across pages.",
      "reqIds": [
        "REQ-1"
      ],
      "version": 1
    },
    {
      "id": "feature-update-elder-and-ministerial-servant-badge-background-colors-everywhere-they-appear-elder-must-use-7c3aed-and-ministerial-servant-must-use-2563eb-badge-text-must-remain-white-do-not-introduce-dark-mode-variants-for-these-badges",
      "title": "Update Elder and Ministerial Servant badge background colors everywhere they appear: Elder must use #7C3AED and Ministerial Servant must use #2563EB; badge text must remain white; do not introduce dark-mode variants for these badges.",
      "reqIds": [
        "REQ-2"
      ],
      "version": 1
    },
    {
      "id": "feature-ensure-that-only-the-elder-and-ministerial-servant-privilege-badges-change-color-all-other-badges-e-g-available-checked-out-on-track-behind-overseer-assistant-inactive-etc-must-retain-their-current-colors-and-styling",
      "title": "Ensure that only the Elder and Ministerial Servant privilege badges change color; all other badges (e.g., Available, Checked Out, On Track, Behind, Overseer, Assistant, Inactive, etc.) must retain their current colors and styling.",
      "reqIds": [
        "REQ-3"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Update Elder and Ministerial Servant privilege badge background colors app-wide (Elder #7C3AED, Ministerial Servant #2563EB) while keeping white text and existing size/styling; do not change other badges; no dark-mode variants.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-5",
      "summary": "Apply the updated Elder/Ministerial Servant badge styling in all the known pages where they appear (Publishers page table, Publisher profile page, Field Service Groups page publisher lists, Field Service Group profile page publisher lists, Pioneers page table) and any other UI location that displays these privilege badges next to publisher names.",
      "reqIds": [
        "REQ-4"
      ],
      "status": "pending"
    }
  ],
  "projectName": "Update Elder and Ministerial Servant privilege badge colors app-wide",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}