{
  "kind": "spec_vs_diff_report",
  "version": "1.0",
  "generatedAt": "2026-02-13T06:29:51.928Z",
  "summary": "Implemented a global ReconnectToastManager mounted in AppLayout that shows a persistent Sonner loading toast when there are in-flight React Query operations and the actor is unavailable, and dismisses it on reconnection. However, the diff does not show any wiring that detects React Query failures with error messages containing \"Actor not available\" to trigger the same reconnect toast, so REQ-2 is not fully implemented.",
  "missing_requirements": [
    {
      "id": "REQ-2",
      "requirement": "Detect and treat the \"Actor not available\" failure state as a reconnect condition by showing the same persistent reconnect toast when React Query operations fail with an Error whose message includes \"Actor not available\", and keep it visible until the actor is available again.",
      "reason": "The diff introduces a shared reconnectState and the ReconnectToastManager subscribes to it, but there is no evidence in the provided changes that any React Query query/mutation error handler (or hooks) sets reconnectState based on errors whose message includes \"Actor not available\". Without that wiring, failures will not trigger the reconnect toast as required.",
      "evidence": [
        "frontend/src/components/system/ReconnectToastManager.tsx",
        "frontend/src/utils/reconnectState.ts",
        "frontend-file-summaries.txt (shows many hooks exist, but no diff evidence of modifications to set reconnectState on errors)"
      ]
    }
  ],
  "hallucinated_features": [
    {
      "description": "Shows an additional \"Connection restored\" success toast automatically whenever the reconnect condition ends.",
      "reason": "The request/AC require the reconnect toast to auto-dismiss when connectivity is restored and mention English text examples, but do not explicitly request emitting a separate success toast on restoration. This is added behavior beyond the stated requirement.",
      "evidence": [
        "frontend/src/components/system/ReconnectToastManager.tsx"
      ]
    }
  ],
  "confidence": 0.74,
  "changed_files": [
    "frontend-file-summaries.txt",
    "frontend/src/components/layout/AppLayout.tsx",
    "frontend/src/components/system/ReconnectToastManager.tsx",
    "frontend/src/utils/reconnectState.ts",
    "project_state.json"
  ]
}